/*
#############################################################################################
# Killing Floor 2 (1.8787) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: Engine_f_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function Engine.Actor.ActorTimeSince
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct AActor_execActorTimeSince_Parms
{
	// float                                           Time;                                             		// 0x0000 (0x0004) [0x0000000000000000]              
	// float                                           ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function Engine.Actor.GetActorTimeSeconds
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct AActor_execGetActorTimeSeconds_Parms
{
	// float                                           ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function Engine.Actor.OnAnimNotifyParticleSystemSpawned
// [0x00020100] 
struct AActor_execOnAnimNotifyParticleSystemSpawned_Parms
{
	// class UAnimNotify_PlayParticleEffect*           AnimNotifyData;                                   		// 0x0000 (0x0008) [0x0000000000000000]              
	// class UParticleSystemComponent*                 PSC;                                              		// 0x0008 (0x0008) [0x0000000000000000]              
};

// Function Engine.Actor.AdjustRadiusDamage
// [0x00420000] 
struct AActor_execAdjustRadiusDamage_Parms
{
	// float                                           InBaseDamage;                                     		// 0x0000 (0x0004) [0x0000000000000000]              
	// float                                           DamageScale;                                      		// 0x0004 (0x0004) [0x0000000000000000]              
	// struct FVector                                  HurtOrigin;                                       		// 0x0008 (0x000C) [0x0000000000000000]              
};

// Function Engine.Actor.GetActorSpriteComponent
// [0x00020400] ( FUNC_Native )
struct AActor_execGetActorSpriteComponent_Parms
{
	// class USpriteComponent*                         ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function Engine.Actor.GetActorMetrics
// [0x00020500] ( FUNC_Native )
struct AActor_execGetActorMetrics_Parms
{
	// unsigned char                                   MetricsType;                                      		// 0x0000 (0x0001) [0x0000000000000000]              
	// int                                             ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function Engine.Actor.OnMobileTouch
// [0x00020802] ( FUNC_Event )
struct AActor_eventOnMobileTouch_Parms
{
	// class APlayerController*                        InPC;                                             		// 0x0000 (0x0008) [0x0000000000000000]              
	// struct FVector2D                                TouchLocation;                                    		// 0x0008 (0x0008) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function Engine.Actor.IsMobileTouchEnabled
// [0x00020002] 
struct AActor_execIsMobileTouchEnabled_Parms
{
	// DWORD                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function Engine.Actor.ShouldBeHiddenBySHOW_NavigationNodes
// [0x00020400] ( FUNC_Native )
struct AActor_execShouldBeHiddenBySHOW_NavigationNodes_Parms
{
	// DWORD                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function Engine.Actor.WillOverlap
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct AActor_execWillOverlap_Parms
{
	// struct FVector                                  PosA;                                             		// 0x0000 (0x000C) [0x0000000000000000]              
	// struct FVector                                  VelA;                                             		// 0x000C (0x000C) [0x0000000000000000]              
	// struct FVector                                  PosB;                                             		// 0x0018 (0x000C) [0x0000000000000000]              
	// struct FVector                                  VelB;                                             		// 0x0024 (0x000C) [0x0000000000000000]              
	// float                                           StepSize;                                         		// 0x0030 (0x0004) [0x0000000000000000]              
	// float                                           Radius;                                           		// 0x0034 (0x0004) [0x0000000000000000]              
	// float                                           Time;                                             		// 0x0038 (0x0004) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x003C (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function Engine.Actor.GetAvoidanceVector
// [0x00424401] ( FUNC_Final | FUNC_Native )
struct AActor_execGetAvoidanceVector_Parms
{
	// TArray< class AActor* >                         Obstacles;                                        		// 0x0000 (0x0010) [0x0000000000000000]              
	// struct FVector                                  GoalLocation;                                     		// 0x0010 (0x000C) [0x0000000000000000]              
	// float                                           CollisionRadius;                                  		// 0x001C (0x0004) [0x0000000000000000]              
	// float                                           MaxSpeed;                                         		// 0x0020 (0x0004) [0x0000000000000000]              
	// int                                             NumSamples;                                       		// 0x0024 (0x0004) [0x0000000000000000]              
	// float                                           VelocityStepRate;                                 		// 0x0028 (0x0004) [0x0000000000000000]              
	// float                                           MaxTimeTilOverlap;                                		// 0x002C (0x0004) [0x0000000000000000]              
	// struct FVector                                  ReturnValue;                                      		// 0x0030 (0x000C) [0x0000000000000000]              
};

// Function Engine.Actor.ReplicationEnded
// [0x00020900] ( FUNC_Event )
struct AActor_eventReplicationEnded_Parms
{
};

// Function Engine.Actor.PostDemoRewind
// [0x00020900] ( FUNC_Event )
struct AActor_eventPostDemoRewind_Parms
{
};

// Function Engine.Actor.AnimTreeUpdated
// [0x00020900] ( FUNC_Event )
struct AActor_eventAnimTreeUpdated_Parms
{
	// class USkeletalMeshComponent*                   SkelMesh;                                         		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function Engine.Actor.SupportsKismetModification
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct AActor_execSupportsKismetModification_Parms
{
	// class USequenceOp*                              AskingOp;                                         		// 0x0000 (0x0008) [0x0000000000000000]              
	// struct FString                                  Reason;                                           		// 0x0008 (0x0010) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0018 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function Engine.Actor.GetAnimTrailParticleSystem
// [0x00020400] ( FUNC_Native )
struct AActor_execGetAnimTrailParticleSystem_Parms
{
	// class UAnimNotify_Trails*                       AnimNotifyData;                                   		// 0x0000 (0x0008) [0x0000000000000000]              
	// class UParticleSystem*                          ReturnValue;                                      		// 0x0008 (0x0008) [0x0000000000000000]              
};

// Function Engine.Actor.TrailsNotifyEnd
// [0x00020800] ( FUNC_Event )
struct AActor_eventTrailsNotifyEnd_Parms
{
	// class UAnimNotify_Trails*                       AnimNotifyData;                                   		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function Engine.Actor.TrailsNotifyTick
// [0x00020800] ( FUNC_Event )
struct AActor_eventTrailsNotifyTick_Parms
{
	// class UAnimNotify_Trails*                       AnimNotifyData;                                   		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function Engine.Actor.TrailsNotify
// [0x00020800] ( FUNC_Event )
struct AActor_eventTrailsNotify_Parms
{
	// class UAnimNotify_Trails*                       AnimNotifyData;                                   		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function Engine.Actor.CreateForceField
// [0x00020802] ( FUNC_Event )
struct AActor_eventCreateForceField_Parms
{
	// class UAnimNotify_ForceField*                   AnimNotifyData;                                   		// 0x0000 (0x0008) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function Engine.Actor.PlayParticleEffect
// [0x00020802] ( FUNC_Event )
struct AActor_eventPlayParticleEffect_Parms
{
	// class UAnimNotify_PlayParticleEffect*           AnimNotifyData;                                   		// 0x0000 (0x0008) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function Engine.Actor.GetAimAdhesionExtent
// [0x00420102] 
struct AActor_execGetAimAdhesionExtent_Parms
{
	// float                                           Width;                                            		// 0x0000 (0x0004) [0x0000000000000000]              
	// float                                           Height;                                           		// 0x0004 (0x0004) [0x0000000000000000]              
	// struct FVector                                  Center;                                           		// 0x0008 (0x000C) [0x0000000000000000]              
};

// Function Engine.Actor.GetAimFrictionExtent
// [0x00420102] 
struct AActor_execGetAimFrictionExtent_Parms
{
	// float                                           Width;                                            		// 0x0000 (0x0004) [0x0000000000000000]              
	// float                                           Height;                                           		// 0x0004 (0x0004) [0x0000000000000000]              
	// struct FVector                                  Center;                                           		// 0x0008 (0x000C) [0x0000000000000000]              
};

// Function Engine.Actor.IsInPersistentLevel
// [0x00024401] ( FUNC_Final | FUNC_Native )
struct AActor_execIsInPersistentLevel_Parms
{
	// DWORD                                           bIncludeLevelStreamingPersistent : 1;             		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function Engine.Actor.OnRigidBodySpringOverextension
// [0x00020900] ( FUNC_Event )
struct AActor_eventOnRigidBodySpringOverextension_Parms
{
	// class URB_BodyInstance*                         BodyInstance;                                     		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function Engine.Actor.GetPackageGuid
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct AActor_execGetPackageGuid_Parms
{
	// struct FName                                    PackageName;                                      		// 0x0000 (0x0008) [0x0000000000000000]              
	// struct FGuid                                    ReturnValue;                                      		// 0x0008 (0x0010) [0x0000000000000000]              
};

// Function Engine.Actor.PostInitAnimTree
// [0x00020800] ( FUNC_Event )
struct AActor_eventPostInitAnimTree_Parms
{
	// class USkeletalMeshComponent*                   SkelComp;                                         		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function Engine.Actor.RootMotionExtracted
// [0x00420900] ( FUNC_Event )
struct AActor_eventRootMotionExtracted_Parms
{
	// class USkeletalMeshComponent*                   SkelComp;                                         		// 0x0000 (0x0008) [0x0000000000000000]              
	// struct FBoneAtom                                ExtractedRootMotionDelta;                         		// 0x0010 (0x0020) [0x0000000000000000]              
};

// Function Engine.Actor.RootMotionProcessed
// [0x00020900] ( FUNC_Event )
struct AActor_eventRootMotionProcessed_Parms
{
	// class USkeletalMeshComponent*                   SkelComp;                                         		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function Engine.Actor.RootMotionModeChanged
// [0x00020900] ( FUNC_Event )
struct AActor_eventRootMotionModeChanged_Parms
{
	// class USkeletalMeshComponent*                   SkelComp;                                         		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function Engine.Actor.PostRenderFor
// [0x00020900] ( FUNC_Event )
struct AActor_eventPostRenderFor_Parms
{
	// class APlayerController*                        PC;                                               		// 0x0000 (0x0008) [0x0000000000000000]              
	// class UCanvas*                                  Canvas;                                           		// 0x0008 (0x0008) [0x0000000000000000]              
	// struct FVector                                  CameraPosition;                                   		// 0x0010 (0x000C) [0x0000000000000000]              
	// struct FVector                                  CameraDir;                                        		// 0x001C (0x000C) [0x0000000000000000]              
};

// Function Engine.Actor.NativePostRenderFor
// [0x00020500] ( FUNC_Native )
struct AActor_execNativePostRenderFor_Parms
{
	// class APlayerController*                        PC;                                               		// 0x0000 (0x0008) [0x0000000000000000]              
	// class UCanvas*                                  Canvas;                                           		// 0x0008 (0x0008) [0x0000000000000000]              
	// struct FVector                                  CameraPosition;                                   		// 0x0010 (0x000C) [0x0000000000000000]              
	// struct FVector                                  CameraDir;                                        		// 0x001C (0x000C) [0x0000000000000000]              
};

// Function Engine.Actor.SetHUDLocation
// [0x00020500] ( FUNC_Native )
struct AActor_execSetHUDLocation_Parms
{
	// struct FVector                                  NewHUDLocation;                                   		// 0x0000 (0x000C) [0x0000000000000000]              
};

// Function Engine.Actor.OnRanOver
// [0x00020800] ( FUNC_Event )
struct AActor_eventOnRanOver_Parms
{
	// class ASVehicle*                                Vehicle;                                          		// 0x0000 (0x0008) [0x0000000000000000]              
	// class UPrimitiveComponent*                      RunOverComponent;                                 		// 0x0008 (0x0008) [0x0000000000000000]              
	// int                                             WheelIndex;                                       		// 0x0010 (0x0004) [0x0000000000000000]              
};

// Function Engine.Actor.RigidBodyCollision
// [0x00420800] ( FUNC_Event )
struct AActor_eventRigidBodyCollision_Parms
{
	// class UPrimitiveComponent*                      HitComponent;                                     		// 0x0000 (0x0008) [0x0000000000000000]              
	// class UPrimitiveComponent*                      OtherComponent;                                   		// 0x0008 (0x0008) [0x0000000000000000]              
	// struct FCollisionImpactData                     RigidCollisionData;                               		// 0x0010 (0x0028) [0x0000000000000000]              
	// int                                             ContactIndex;                                     		// 0x0038 (0x0004) [0x0000000000000000]              
};

// Function Engine.Actor.InterpolationChanged
// [0x00020900] ( FUNC_Event )
struct AActor_eventInterpolationChanged_Parms
{
	// class USeqAct_Interp*                           InterpAction;                                     		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function Engine.Actor.InterpolationFinished
// [0x00020900] ( FUNC_Event )
struct AActor_eventInterpolationFinished_Parms
{
	// class USeqAct_Interp*                           InterpAction;                                     		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function Engine.Actor.InterpolationStarted
// [0x00020900] ( FUNC_Event )
struct AActor_eventInterpolationStarted_Parms
{
	// class USeqAct_Interp*                           InterpAction;                                     		// 0x0000 (0x0008) [0x0000000000000000]              
	// class UInterpGroupInst*                         GroupInst;                                        		// 0x0008 (0x0008) [0x0000000000000000]              
};

// Function Engine.Actor.SpawnedByKismet
// [0x00020800] ( FUNC_Event )
struct AActor_eventSpawnedByKismet_Parms
{
};

// Function Engine.Actor.GetTargetLocation
// [0x00024500] ( FUNC_Native )
struct AActor_execGetTargetLocation_Parms
{
	// class AActor*                                   RequestedBy;                                      		// 0x0000 (0x0008) [0x0000000000000000]              
	// DWORD                                           bRequestAlternateLoc : 1;                         		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	// struct FVector                                  ReturnValue;                                      		// 0x000C (0x000C) [0x0000000000000000]              
};

// Function Engine.Actor.FindGoodEndView
// [0x00420102] 
struct AActor_execFindGoodEndView_Parms
{
	// class APlayerController*                        PC;                                               		// 0x0000 (0x0008) [0x0000000000000000]              
	// struct FRotator                                 GoodRotation;                                     		// 0x0008 (0x000C) [0x0000000000000000]              
};

// Function Engine.Actor.NotifyLocalPlayerTeamReceived
// [0x00020100] 
struct AActor_execNotifyLocalPlayerTeamReceived_Parms
{
};

// Function Engine.Actor.ScriptGetTeamNum
// [0x00020902] ( FUNC_Event )
struct AActor_eventScriptGetTeamNum_Parms
{
	// unsigned char                                   ReturnValue;                                      		// 0x0000 (0x0001) [0x0000000000000000]              
};

// Function Engine.Actor.GetTeamNum
// [0x00020500] ( FUNC_Native )
struct AActor_execGetTeamNum_Parms
{
	// unsigned char                                   ReturnValue;                                      		// 0x0000 (0x0001) [0x0000000000000000]              
};

// Function Engine.Actor.PawnBaseDied
// [0x00020000] 
struct AActor_execPawnBaseDied_Parms
{
};

// Function Engine.Actor.IsPlayerOwned
// [0x00020500] ( FUNC_Native )
struct AActor_execIsPlayerOwned_Parms
{
	// DWORD                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function Engine.Actor.GetActorEyesViewPoint
// [0x00420902] ( FUNC_Event )
struct AActor_eventGetActorEyesViewPoint_Parms
{
	// struct FVector                                  out_Location;                                     		// 0x0000 (0x000C) [0x0000000000000000]              
	// struct FRotator                                 out_Rotation;                                     		// 0x000C (0x000C) [0x0000000000000000]              
};

// Function Engine.Actor.IsStationary
// [0x00020002] 
struct AActor_execIsStationary_Parms
{
	// DWORD                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function Engine.Actor.GetActorFaceFXAsset
// [0x00020800] ( FUNC_Event )
struct AActor_eventGetActorFaceFXAsset_Parms
{
	// class UFaceFXAsset*                             ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function Engine.Actor.CanActorPlayFaceFXAnim
// [0x00020102] 
struct AActor_execCanActorPlayFaceFXAnim_Parms
{
	// DWORD                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function Engine.Actor.IsActorPlayingFaceFXAnim
// [0x00020102] 
struct AActor_execIsActorPlayingFaceFXAnim_Parms
{
	// DWORD                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function Engine.Actor.TickSkelControl
// [0x00020800] ( FUNC_Event )
struct AActor_eventTickSkelControl_Parms
{
	// float                                           DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000000]              
	// class USkeletalMeshComponent*                   SkelComp;                                         		// 0x0004 (0x0008) [0x0000000000000000]              
	// class USkelControlBase*                         SkelCtrl;                                         		// 0x000C (0x0008) [0x0000000000000000]              
};

// Function Engine.Actor.SetSkelControlScale
// [0x00020800] ( FUNC_Event )
struct AActor_eventSetSkelControlScale_Parms
{
	// struct FName                                    SkelControlName;                                  		// 0x0000 (0x0008) [0x0000000000000000]              
	// float                                           Scale;                                            		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function Engine.Actor.SetMorphWeight
// [0x00020800] ( FUNC_Event )
struct AActor_eventSetMorphWeight_Parms
{
	// struct FName                                    MorphNodeName;                                    		// 0x0000 (0x0008) [0x0000000000000000]              
	// float                                           MorphWeight;                                      		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function Engine.Actor.StopActorFaceFXAnim
// [0x00020800] ( FUNC_Event )
struct AActor_eventStopActorFaceFXAnim_Parms
{
};

// Function Engine.Actor.PlayActorFaceFXAnim
// [0x00020800] ( FUNC_Event )
struct AActor_eventPlayActorFaceFXAnim_Parms
{
	// class UFaceFXAnimSet*                           AnimSet;                                          		// 0x0000 (0x0008) [0x0000000000000000]              
	// struct FString                                  GroupName;                                        		// 0x0008 (0x0010) [0x0000000000000000]              
	// struct FString                                  SeqName;                                          		// 0x0018 (0x0010) [0x0000000000000000]              
	// class USoundCue*                                SoundCueToPlay;                                   		// 0x0028 (0x0008) [0x0000000000000000]              
	// class UAkEvent*                                 AkEventToPlay;                                    		// 0x0030 (0x0008) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0038 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function Engine.Actor.FinishAnimControl
// [0x00020800] ( FUNC_Event )
struct AActor_eventFinishAnimControl_Parms
{
	// class UInterpGroup*                             InInterpGroup;                                    		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function Engine.Actor.SetAnimPosition
// [0x00020800] ( FUNC_Event )
struct AActor_eventSetAnimPosition_Parms
{
	// struct FName                                    SlotName;                                         		// 0x0000 (0x0008) [0x0000000000000000]              
	// int                                             ChannelIndex;                                     		// 0x0008 (0x0004) [0x0000000000000000]              
	// struct FName                                    InAnimSeqName;                                    		// 0x000C (0x0008) [0x0000000000000000]              
	// float                                           InPosition;                                       		// 0x0014 (0x0004) [0x0000000000000000]              
	// DWORD                                           bFireNotifies : 1;                                		// 0x0018 (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           bLooping : 1;                                     		// 0x001C (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           bEnableRootMotion : 1;                            		// 0x0020 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function Engine.Actor.BeginAnimControl
// [0x00020800] ( FUNC_Event )
struct AActor_eventBeginAnimControl_Parms
{
	// class UInterpGroup*                             InInterpGroup;                                    		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function Engine.Actor.OnAnimPlay
// [0x00020800] ( FUNC_Event )
struct AActor_eventOnAnimPlay_Parms
{
	// class UAnimNodeSequence*                        SeqNode;                                          		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function Engine.Actor.OnAnimEnd
// [0x00020800] ( FUNC_Event )
struct AActor_eventOnAnimEnd_Parms
{
	// class UAnimNodeSequence*                        SeqNode;                                          		// 0x0000 (0x0008) [0x0000000000000000]              
	// float                                           PlayedTime;                                       		// 0x0008 (0x0004) [0x0000000000000000]              
	// float                                           ExcessTime;                                       		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function Engine.Actor.DoKismetAttachment
// [0x00820002] 
struct AActor_execDoKismetAttachment_Parms
{
	// class AActor*                                   Attachment;                                       		// 0x0000 (0x0008) [0x0000000000000000]              
	// class USeqAct_AttachToActor*                    Action;                                           		// 0x0008 (0x0008) [0x0000000000000000]              
	// DWORD                                           bOldCollideActors : 1;                            		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           bOldBlockActors : 1;                              		// 0x0014 (0x0004) [0x0000000000000000] [0x00000001] 
	// struct FVector                                  X;                                                		// 0x0018 (0x000C) [0x0000000000000000]              
	// struct FVector                                  Y;                                                		// 0x0024 (0x000C) [0x0000000000000000]              
	// struct FVector                                  Z;                                                		// 0x0030 (0x000C) [0x0000000000000000]              
};

// Function Engine.Actor.OnAttachToActor
// [0x00020002] 
struct AActor_execOnAttachToActor_Parms
{
	// class USeqAct_AttachToActor*                    Action;                                           		// 0x0000 (0x0008) [0x0000000000000000]              
	// int                                             Idx;                                              		// 0x0008 (0x0004) [0x0000000000000000]              
	// class AActor*                                   Attachment;                                       		// 0x000C (0x0008) [0x0000000000000000]              
	// class AController*                              C;                                                		// 0x0014 (0x0008) [0x0000000000000000]              
	// TArray< class UObject* >                        objVars;                                          		// 0x001C (0x0010) [0x0000000000000000]              
};

// Function Engine.Actor.OnToggleHidden
// [0x00020102] 
struct AActor_execOnToggleHidden_Parms
{
	// class USeqAct_ToggleHidden*                     Action;                                           		// 0x0000 (0x0008) [0x0000000000000000]              
	// int                                             AttachIdx;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
	// int                                             IgnoreIdx;                                        		// 0x000C (0x0004) [0x0000000000000000]              
	// class AActor*                                   A;                                                		// 0x0010 (0x0008) [0x0000000000000000]              
};

// Function Engine.Actor.OnChangeCollision
// [0x00020002] 
struct AActor_execOnChangeCollision_Parms
{
	// class USeqAct_ChangeCollision*                  Action;                                           		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function Engine.Actor.OnSetPhysics
// [0x00020102] 
struct AActor_execOnSetPhysics_Parms
{
	// class USeqAct_SetPhysics*                       Action;                                           		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function Engine.Actor.OnSetBlockRigidBody
// [0x00020102] 
struct AActor_execOnSetBlockRigidBody_Parms
{
	// class USeqAct_SetBlockRigidBody*                Action;                                           		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function Engine.Actor.OnSetVelocity
// [0x00820102] 
struct AActor_execOnSetVelocity_Parms
{
	// class USeqAct_SetVelocity*                      Action;                                           		// 0x0000 (0x0008) [0x0000000000000000]              
	// struct FVector                                  V;                                                		// 0x0008 (0x000C) [0x0000000000000000]              
	// float                                           Mag;                                              		// 0x0014 (0x0004) [0x0000000000000000]              
};

// Function Engine.Actor.OnTeleport
// [0x00820102] 
struct AActor_execOnTeleport_Parms
{
	// class USeqAct_Teleport*                         Action;                                           		// 0x0000 (0x0008) [0x0000000000000000]              
	// TArray< class UObject* >                        objVars;                                          		// 0x0008 (0x0010) [0x0000000000000000]              
	// int                                             Idx;                                              		// 0x0018 (0x0004) [0x0000000000000000]              
	// class AActor*                                   destActor;                                        		// 0x001C (0x0008) [0x0000000000000000]              
	// class AActor*                                   tempActor;                                        		// 0x0024 (0x0008) [0x0000000000000000]              
	// class AActor*                                   A;                                                		// 0x002C (0x0008) [0x0000000000000000]              
	// class AController*                              C;                                                		// 0x0034 (0x0008) [0x0000000000000000]              
	// DWORD                                           bOccupiedDest : 1;                                		// 0x003C (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           bColliding : 1;                                   		// 0x0040 (0x0004) [0x0000000000000000] [0x00000001] 
	// float                                           ColRadius;                                        		// 0x0044 (0x0004) [0x0000000000000000]              
	// float                                           ColHeight;                                        		// 0x0048 (0x0004) [0x0000000000000000]              
	// struct FVector                                  Extent;                                           		// 0x004C (0x000C) [0x0000000000000000]              
};

// Function Engine.Actor.OnModifyHealth
// [0x00020102] 
struct AActor_execOnModifyHealth_Parms
{
	// class USeqAct_ModifyHealth*                     Action;                                           		// 0x0000 (0x0008) [0x0000000000000000]              
	// class AController*                              InstigatorController;                             		// 0x0008 (0x0008) [0x0000000000000000]              
	// class APawn*                                    InstigatorPawn;                                   		// 0x0010 (0x0008) [0x0000000000000000]              
};

// Function Engine.Actor.PrestreamTextures
// [0x00024400] ( FUNC_Native )
struct AActor_execPrestreamTextures_Parms
{
	// float                                           Seconds;                                          		// 0x0000 (0x0004) [0x0000000000000000]              
	// DWORD                                           bEnableStreaming : 1;                             		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	// int                                             CinematicTextureGroups;                           		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function Engine.Actor.ShutDown
// [0x00020902] ( FUNC_Event )
struct AActor_eventShutDown_Parms
{
};

// Function Engine.Actor.SetNetUpdateTime
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct AActor_execSetNetUpdateTime_Parms
{
	// float                                           NewUpdateTime;                                    		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function Engine.Actor.ForceNetRelevant
// [0x00020802] ( FUNC_Event )
struct AActor_eventForceNetRelevant_Parms
{
};

// Function Engine.Actor.OnDestroy
// [0x00020102] 
struct AActor_execOnDestroy_Parms
{
	// class USeqAct_Destroy*                          Action;                                           		// 0x0000 (0x0008) [0x0000000000000000]              
	// int                                             AttachIdx;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
	// int                                             IgnoreIdx;                                        		// 0x000C (0x0004) [0x0000000000000000]              
	// class AActor*                                   A;                                                		// 0x0010 (0x0008) [0x0000000000000000]              
};

// Function Engine.Actor.ClearLatentAction
// [0x00024103] ( FUNC_Final )
struct AActor_execClearLatentAction_Parms
{
	// class UClass*                                   actionClass;                                      		// 0x0000 (0x0008) [0x0000000000000000]              
	// DWORD                                           bAborted : 1;                                     		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	// class USeqAct_Latent*                           exceptionAction;                                  		// 0x000C (0x0008) [0x0000000000000000]              
	// int                                             Idx;                                              		// 0x0014 (0x0004) [0x0000000000000000]              
};

// Function Engine.Actor.FindEventsOfClass
// [0x00424103] ( FUNC_Final )
struct AActor_execFindEventsOfClass_Parms
{
	// class UClass*                                   EventClass;                                       		// 0x0000 (0x0008) [0x0000000000000000]              
	// TArray< class USequenceEvent* >                 out_EventList;                                    		// 0x0008 (0x0010) [0x0000000000000000]              
	// DWORD                                           bIncludeDisabled : 1;                             		// 0x0018 (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           ReturnValue : 1;                                  		// 0x001C (0x0004) [0x0000000000000000] [0x00000001] 
	// class USequenceEvent*                           Evt;                                              		// 0x0020 (0x0008) [0x0000000000000000]              
	// DWORD                                           bFoundEvent : 1;                                  		// 0x0028 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function Engine.Actor.ActivateEventClass
// [0x00424103] ( FUNC_Final )
struct AActor_execActivateEventClass_Parms
{
	// class UClass*                                   InClass;                                          		// 0x0000 (0x0008) [0x0000000000000000]              
	// class AActor*                                   InInstigator;                                     		// 0x0008 (0x0008) [0x0000000000000000]              
	// TArray< class USequenceEvent* >                 EventList;                                        		// 0x0010 (0x0010) [0x0000000000000000]              
	// TArray< int >                                   ActivateIndices;                                  		// 0x0020 (0x0010) [0x0000000000000000]              
	// DWORD                                           bTest : 1;                                        		// 0x0030 (0x0004) [0x0000000000000000] [0x00000001] 
	// TArray< class USequenceEvent* >                 ActivatedEvents;                                  		// 0x0034 (0x0010) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0044 (0x0004) [0x0000000000000000] [0x00000001] 
	// class USequenceEvent*                           Evt;                                              		// 0x0048 (0x0008) [0x0000000000000000]              
};

// Function Engine.Actor.TriggerGlobalEventClass
// [0x00024102] 
struct AActor_execTriggerGlobalEventClass_Parms
{
	// class UClass*                                   InEventClass;                                     		// 0x0000 (0x0008) [0x0000000000000000]              
	// class AActor*                                   InInstigator;                                     		// 0x0008 (0x0008) [0x0000000000000000]              
	// int                                             ActivateIndex;                                    		// 0x0010 (0x0004) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000000] [0x00000001] 
	// TArray< class USequenceObject* >                EventsToActivate;                                 		// 0x0018 (0x0010) [0x0000000000000000]              
	// TArray< int >                                   ActivateIndices;                                  		// 0x0028 (0x0010) [0x0000000000000000]              
	// class USequence*                                GameSeq;                                          		// 0x0038 (0x0008) [0x0000000000000000]              
	// DWORD                                           bResult : 1;                                      		// 0x0040 (0x0004) [0x0000000000000000] [0x00000001] 
	// int                                             I;                                                		// 0x0044 (0x0004) [0x0000000000000000]              
};

// Function Engine.Actor.ReceivedNewEvent
// [0x00020900] ( FUNC_Event )
struct AActor_eventReceivedNewEvent_Parms
{
	// class USequenceEvent*                           Evt;                                              		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function Engine.Actor.TriggerEventClass
// [0x00424102] 
struct AActor_execTriggerEventClass_Parms
{
	// class UClass*                                   InEventClass;                                     		// 0x0000 (0x0008) [0x0000000000000000]              
	// class AActor*                                   InInstigator;                                     		// 0x0008 (0x0008) [0x0000000000000000]              
	// int                                             ActivateIndex;                                    		// 0x0010 (0x0004) [0x0000000000000000]              
	// DWORD                                           bTest : 1;                                        		// 0x0014 (0x0004) [0x0000000000000000] [0x00000001] 
	// TArray< class USequenceEvent* >                 ActivatedEvents;                                  		// 0x0018 (0x0010) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0028 (0x0004) [0x0000000000000000] [0x00000001] 
	// TArray< int >                                   ActivateIndices;                                  		// 0x002C (0x0010) [0x0000000000000000]              
};

// Function Engine.Actor.DebugMessagePlayer
// [0x00020803] ( FUNC_Final | FUNC_Event )
struct AActor_eventDebugMessagePlayer_Parms
{
	// struct FString                                  msg;                                              		// 0x0000 (0x0010) [0x0000000000000000]              
	// class APlayerController*                        PC;                                               		// 0x0010 (0x0008) [0x0000000000000000]              
};

// Function Engine.Actor.ImpactEffectIsRelevant
// [0x00824102] 
struct AActor_execImpactEffectIsRelevant_Parms
{
	// class APawn*                                    EffectInstigator;                                 		// 0x0000 (0x0008) [0x0000000000000000]              
	// struct FVector                                  SpawnLocation;                                    		// 0x0008 (0x000C) [0x0000000000000000]              
	// DWORD                                           bForceDedicated : 1;                              		// 0x0014 (0x0004) [0x0000000000000000] [0x00000001] 
	// float                                           VisibleCullDistance;                              		// 0x0018 (0x0004) [0x0000000000000000]              
	// float                                           HiddenCullDistance;                               		// 0x001C (0x0004) [0x0000000000000000]              
	// DWORD                                           bSkipLOSCheck : 1;                                		// 0x0020 (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           ReturnValue : 1;                                  		// 0x0024 (0x0004) [0x0000000000000000] [0x00000001] 
	// class APlayerController*                        P;                                                		// 0x0028 (0x0008) [0x0000000000000000]              
	// float                                           DistSq;                                           		// 0x0030 (0x0004) [0x0000000000000000]              
	// float                                           InViewThreshold;                                  		// 0x0034 (0x0004) [0x0000000000000000]              
	// DWORD                                           bIsInViewFrustrum : 1;                            		// 0x0038 (0x0004) [0x0000000000000000] [0x00000001] 
	// struct FVector                                  CameraLoc;                                        		// 0x003C (0x000C) [0x0000000000000000]              
	// struct FRotator                                 CameraRot;                                        		// 0x0048 (0x000C) [0x0000000000000000]              
};

// Function Engine.Actor.ActorEffectIsRelevant
// [0x00824102] 
struct AActor_execActorEffectIsRelevant_Parms
{
	// class APawn*                                    EffectInstigator;                                 		// 0x0000 (0x0008) [0x0000000000000000]              
	// DWORD                                           bForceDedicated : 1;                              		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	// float                                           VisibleCullDistance;                              		// 0x000C (0x0004) [0x0000000000000000]              
	// float                                           HiddenCullDistance;                               		// 0x0010 (0x0004) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000000] [0x00000001] 
	// class APlayerController*                        P;                                                		// 0x0018 (0x0008) [0x0000000000000000]              
	// float                                           DistSq;                                           		// 0x0020 (0x0004) [0x0000000000000000]              
	// struct FVector                                  CameraLoc;                                        		// 0x0024 (0x000C) [0x0000000000000000]              
	// struct FRotator                                 CameraRot;                                        		// 0x0030 (0x000C) [0x0000000000000000]              
};

// Function Engine.Actor.EffectIsRelevant
// [0x00024102] 
struct AActor_execEffectIsRelevant_Parms
{
	// struct FVector                                  SpawnLocation;                                    		// 0x0000 (0x000C) [0x0000000000000000]              
	// DWORD                                           bForceDedicated : 1;                              		// 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
	// float                                           VisibleCullDistance;                              		// 0x0010 (0x0004) [0x0000000000000000]              
	// float                                           HiddenCullDistance;                               		// 0x0014 (0x0004) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0018 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function Engine.Actor.ApplyFluidSurfaceImpact
// [0x00020102] 
struct AActor_execApplyFluidSurfaceImpact_Parms
{
	// class AFluidSurfaceActor*                       Fluid;                                            		// 0x0000 (0x0008) [0x0000000000000000]              
	// struct FVector                                  HitLocation;                                      		// 0x0008 (0x000C) [0x0000000000000000]              
	// float                                           Radius;                                           		// 0x0014 (0x0004) [0x0000000000000000]              
	// float                                           Height;                                           		// 0x0018 (0x0004) [0x0000000000000000]              
	// float                                           AdjustedVelocity;                                 		// 0x001C (0x0004) [0x0000000000000000]              
};

// Function Engine.Actor.CanSplash
// [0x00020102] 
struct AActor_execCanSplash_Parms
{
	// DWORD                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function Engine.Actor.PlayTeleportEffect
// [0x00020000] 
struct AActor_execPlayTeleportEffect_Parms
{
	// DWORD                                           bOut : 1;                                         		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           bSound : 1;                                       		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function Engine.Actor.IsInPain
// [0x00020002] 
struct AActor_execIsInPain_Parms
{
	// DWORD                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// class APhysicsVolume*                           V;                                                		// 0x0004 (0x0008) [0x0000000000000000]              
};

// Function Engine.Actor.Reset
// [0x00020800] ( FUNC_Event )
struct AActor_eventReset_Parms
{
};

// Function Engine.Actor.GetFaceFXAudioComponent
// [0x00020902] ( FUNC_Event )
struct AActor_eventGetFaceFXAudioComponent_Parms
{
	// class UAudioComponent*                          ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function Engine.Actor.ModifyHearSoundComponent
// [0x00020900] ( FUNC_Event )
struct AActor_eventModifyHearSoundComponent_Parms
{
	// class UAudioComponent*                          AC;                                               		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function Engine.Actor.GetPhysicsName
// [0x00020102] 
struct AActor_execGetPhysicsName_Parms
{
	// struct FString                                  ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000000000]              
};

// Function Engine.Actor.DisplayDebug
// [0x00420102] 
struct AActor_execDisplayDebug_Parms
{
	// class AHUD*                                     HUD;                                              		// 0x0000 (0x0008) [0x0000000000000000]              
	// float                                           out_YL;                                           		// 0x0008 (0x0004) [0x0000000000000000]              
	// float                                           out_YPos;                                         		// 0x000C (0x0004) [0x0000000000000000]              
	// struct FString                                  T;                                                		// 0x0010 (0x0010) [0x0000000000000000]              
	// class AActor*                                   A;                                                		// 0x0020 (0x0008) [0x0000000000000000]              
	// float                                           MyRadius;                                         		// 0x0028 (0x0004) [0x0000000000000000]              
	// float                                           MyHeight;                                         		// 0x002C (0x0004) [0x0000000000000000]              
	// class UCanvas*                                  Canvas;                                           		// 0x0030 (0x0008) [0x0000000000000000]              
};

// Function Engine.Actor.GetDebugName
// [0x00020002] 
struct AActor_execGetDebugName_Parms
{
	// struct FString                                  ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000000000]              
};

// Function Engine.Actor.MatchStarting
// [0x00020000] 
struct AActor_execMatchStarting_Parms
{
};

// Function Engine.Actor.GetLocalString
// [0x00026002] 
struct AActor_execGetLocalString_Parms
{
	// int                                             Switch;                                           		// 0x0000 (0x0004) [0x0000000000000000]              
	// class APlayerReplicationInfo*                   RelatedPRI;                                       		// 0x0004 (0x0008) [0x0000000000000000]              
	// class APlayerReplicationInfo*                   RelatedPRI01;                                     		// 0x000C (0x0008) [0x0000000000000000]              
	// struct FString                                  ReturnValue;                                      		// 0x0014 (0x0010) [0x0000000000000000]              
};

// Function Engine.Actor.ReplaceText
// [0x00422002] 
struct AActor_execReplaceText_Parms
{
	// struct FString                                  Text;                                             		// 0x0000 (0x0010) [0x0000000000000000]              
	// struct FString                                  Replace;                                          		// 0x0010 (0x0010) [0x0000000000000000]              
	// struct FString                                  With;                                             		// 0x0020 (0x0010) [0x0000000000000000]              
	// int                                             I;                                                		// 0x0030 (0x0004) [0x0000000000000000]              
	// struct FString                                  Input;                                            		// 0x0034 (0x0010) [0x0000000000000000]              
};

// Function Engine.Actor.GetHumanReadableName
// [0x00020102] 
struct AActor_execGetHumanReadableName_Parms
{
	// struct FString                                  ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000000000]              
};

// Function Engine.Actor.GetItemName
// [0x00020102] 
struct AActor_execGetItemName_Parms
{
	// struct FString                                  FullName;                                         		// 0x0000 (0x0010) [0x0000000000000000]              
	// struct FString                                  ReturnValue;                                      		// 0x0010 (0x0010) [0x0000000000000000]              
	// int                                             pos;                                              		// 0x0020 (0x0004) [0x0000000000000000]              
};

// Function Engine.Actor.CalcCamera
// [0x00C20102] 
struct AActor_execCalcCamera_Parms
{
	// float                                           fDeltaTime;                                       		// 0x0000 (0x0004) [0x0000000000000000]              
	// struct FVector                                  out_CamLoc;                                       		// 0x0004 (0x000C) [0x0000000000000000]              
	// struct FRotator                                 out_CamRot;                                       		// 0x0010 (0x000C) [0x0000000000000000]              
	// float                                           out_FOV;                                          		// 0x001C (0x0004) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0020 (0x0004) [0x0000000000000000] [0x00000001] 
	// struct FVector                                  HitNormal;                                        		// 0x0024 (0x000C) [0x0000000000000000]              
	// float                                           Radius;                                           		// 0x0030 (0x0004) [0x0000000000000000]              
	// float                                           Height;                                           		// 0x0034 (0x0004) [0x0000000000000000]              
};

// Function Engine.Actor.EndViewTarget
// [0x00020800] ( FUNC_Event )
struct AActor_eventEndViewTarget_Parms
{
	// class APlayerController*                        PC;                                               		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function Engine.Actor.BecomeViewTarget
// [0x00020800] ( FUNC_Event )
struct AActor_eventBecomeViewTarget_Parms
{
	// class APlayerController*                        PC;                                               		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function Engine.Actor.CheckForErrors
// [0x00020000] 
struct AActor_execCheckForErrors_Parms
{
	// DWORD                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function Engine.Actor.DebugFreezeGame
// [0x00024802] ( FUNC_Event )
struct AActor_eventDebugFreezeGame_Parms
{
	// class AActor*                                   ActorToLookAt;                                    		// 0x0000 (0x0008) [0x0000000000000000]              
	// class APlayerController*                        PC;                                               		// 0x0008 (0x0008) [0x0000000000000000]              
};

// Function Engine.Actor.GetGravityZ
// [0x00020400] ( FUNC_Native )
struct AActor_execGetGravityZ_Parms
{
	// float                                           ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function Engine.Actor.CheckHitInfo
// [0x00C20103] ( FUNC_Final )
struct AActor_execCheckHitInfo_Parms
{
	// struct FTraceHitInfo                            HitInfo;                                          		// 0x0000 (0x0028) [0x0000000000000000]              
	// class UPrimitiveComponent*                      FallBackComponent;                                		// 0x0028 (0x0008) [0x0000000000000000]              
	// struct FVector                                  Dir;                                              		// 0x0030 (0x000C) [0x0000000000000000]              
	// struct FVector                                  out_HitLocation;                                  		// 0x003C (0x000C) [0x0000000000000000]              
	// struct FVector                                  out_NewHitLocation;                               		// 0x0048 (0x000C) [0x0000000000000000]              
	// struct FVector                                  out_HitNormal;                                    		// 0x0054 (0x000C) [0x0000000000000000]              
	// struct FVector                                  TraceEnd;                                         		// 0x0060 (0x000C) [0x0000000000000000]              
	// struct FVector                                  TraceStart;                                       		// 0x006C (0x000C) [0x0000000000000000]              
	// struct FTraceHitInfo                            newHitInfo;                                       		// 0x0078 (0x0028) [0x0000000000000000]              
};

