/*
#############################################################################################
# Killing Floor 2 (1.8787) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: Engine_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Script Structs
# ========================================================================================= #
*/

// ScriptStruct Engine.StaticMesh.StaticMeshLODElement
// 0x0014
struct FStaticMeshLODElement
{
	class UMaterialInterface*                          Material;                                         		// 0x0000 (0x0008) [0x0000000000000000]              
	DWORD                                              bEnableShadowCasting : 1;                         		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x000C (0x0004) MISSED OFFSET
	DWORD                                              bEnableCollision : 1;                             		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct Engine.StaticMesh.StaticMeshLODInfo
// 0x0010
struct FStaticMeshLODInfo
{
	TArray< struct FStaticMeshLODElement >             Elements;                                         		// 0x0000 (0x0010) [0x0000000000000000]              
};

// ScriptStruct Engine.Actor.RigidBodyState
// 0x0039
struct FRigidBodyState
{
	struct FVector                                     Position;                                         		// 0x0000 (0x000C) [0x0000000000000000]              
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x000C (0x0004) MISSED OFFSET
	struct FQuat                                       Quaternion;                                       		// 0x0010 (0x0010) [0x0000000000000000]              
	struct FVector                                     LinVel;                                           		// 0x0020 (0x000C) [0x0000000000000000]              
	struct FVector                                     AngVel;                                           		// 0x002C (0x000C) [0x0000000000000000]              
	unsigned char                                      bNewData;                                         		// 0x0038 (0x0001) [0x0000000000000000]              
};

// ScriptStruct Engine.Actor.RigidBodyContactInfo
// 0x0044
struct FRigidBodyContactInfo
{
	struct FVector                                     ContactPosition;                                  		// 0x0000 (0x000C) [0x0000000000000000]              
	struct FVector                                     ContactNormal;                                    		// 0x000C (0x000C) [0x0000000000000000]              
	float                                              ContactPenetration;                               		// 0x0018 (0x0004) [0x0000000000000000]              
	struct FVector                                     ContactVelocity[ 0x2 ];                           		// 0x001C (0x0018) [0x0000000000000000]              
	class UPhysicalMaterial*                           PhysMaterial[ 0x2 ];                              		// 0x0034 (0x0010) [0x0000000000000000]              
};

// ScriptStruct Engine.Actor.CollisionImpactData
// 0x0028
struct FCollisionImpactData
{
	TArray< struct FRigidBodyContactInfo >             ContactInfos;                                     		// 0x0000 (0x0010) [0x0000000000000000]              
	struct FVector                                     TotalNormalForceVector;                           		// 0x0010 (0x000C) [0x0000000000000000]              
	struct FVector                                     TotalFrictionForceVector;                         		// 0x001C (0x000C) [0x0000000000000000]              
};

// ScriptStruct Engine.Actor.PhysEffectInfo
// 0x0018
struct FPhysEffectInfo
{
	float                                              Threshold;                                        		// 0x0000 (0x0004) [0x0000000000000000]              
	float                                              ReFireDelay;                                      		// 0x0004 (0x0004) [0x0000000000000000]              
	class UParticleSystem*                             Effect;                                           		// 0x0008 (0x0008) [0x0000000000000000]              
	class UAkBaseSoundObject*                          Sound;                                            		// 0x0010 (0x0008) [0x0000000000000000]              
};

// ScriptStruct Engine.Actor.ActorReference
// 0x0018
struct FActorReference
{
	class AActor*                                      Actor;                                            		// 0x0000 (0x0008) [0x0000000000000000]              
	struct FGuid                                       Guid;                                             		// 0x0008 (0x0010) [0x0000000000000000]              
};

// ScriptStruct Engine.Actor.NavReference
// 0x0018
struct FNavReference
{
	class ANavigationPoint*                            Nav;                                              		// 0x0000 (0x0008) [0x0000000000000000]              
	struct FGuid                                       Guid;                                             		// 0x0008 (0x0010) [0x0000000000000000]              
};

// ScriptStruct Engine.Actor.BasedPosition
// 0x0038
struct FBasedPosition
{
	class AActor*                                      Base;                                             		// 0x0000 (0x0008) [0x0000000000000000]              
	struct FVector                                     Position;                                         		// 0x0008 (0x000C) [0x0000000000000000]              
	struct FVector                                     CachedBaseLocation;                               		// 0x0014 (0x000C) [0x0000000000000000]              
	struct FRotator                                    CachedBaseRotation;                               		// 0x0020 (0x000C) [0x0000000000000000]              
	struct FVector                                     CachedTransPosition;                              		// 0x002C (0x000C) [0x0000000000000000]              
};

// ScriptStruct Engine.SequenceOp.SeqOpInputLink
// 0x0038
struct FSeqOpInputLink
{
	struct FString                                     LinkDesc;                                         		// 0x0000 (0x0010) [0x0000000000000000]              
	DWORD                                              bHasImpulse : 1;                                  		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
	int                                                QueuedActivations;                                		// 0x0014 (0x0004) [0x0000000000000000]              
	DWORD                                              bDisabled : 1;                                    		// 0x0018 (0x0004) [0x0000000000000000] [0x00000001] 
	DWORD                                              bDisabledPIE : 1;                                 		// 0x0018 (0x0004) [0x0000000000000000] [0x00000002] 
	class USequenceOp*                                 LinkedOp;                                         		// 0x001C (0x0008) [0x0000000000000000]              
	int                                                DrawY;                                            		// 0x0024 (0x0004) [0x0000000000000000]              
	DWORD                                              bHidden : 1;                                      		// 0x0028 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              ActivateDelay;                                    		// 0x002C (0x0004) [0x0000000000000000]              
	DWORD                                              bMoving : 1;                                      		// 0x0030 (0x0004) [0x0000000000000000] [0x00000001] 
	DWORD                                              bClampedMax : 1;                                  		// 0x0030 (0x0004) [0x0000000000000000] [0x00000002] 
	DWORD                                              bClampedMin : 1;                                  		// 0x0030 (0x0004) [0x0000000000000000] [0x00000004] 
	int                                                OverrideDelta;                                    		// 0x0034 (0x0004) [0x0000000000000000]              
};

// ScriptStruct Engine.Actor.TraceHitInfo
// 0x0028
struct FTraceHitInfo
{
	class UMaterial*                                   Material;                                         		// 0x0000 (0x0008) [0x0000000000000000]              
	class UPhysicalMaterial*                           PhysMaterial;                                     		// 0x0008 (0x0008) [0x0000000000000000]              
	int                                                Item;                                             		// 0x0010 (0x0004) [0x0000000000000000]              
	int                                                LevelIndex;                                       		// 0x0014 (0x0004) [0x0000000000000000]              
	struct FName                                       BoneName;                                         		// 0x0018 (0x0008) [0x0000000000000000]              
	class UPrimitiveComponent*                         HitComponent;                                     		// 0x0020 (0x0008) [0x0000000000000000]              
};

// ScriptStruct Engine.Actor.ImpactInfo
// 0x0060
struct FImpactInfo
{
	class AActor*                                      HitActor;                                         		// 0x0000 (0x0008) [0x0000000000000000]              
	struct FVector                                     HitLocation;                                      		// 0x0008 (0x000C) [0x0000000000000000]              
	struct FVector                                     HitNormal;                                        		// 0x0014 (0x000C) [0x0000000000000000]              
	struct FVector                                     RayDir;                                           		// 0x0020 (0x000C) [0x0000000000000000]              
	struct FVector                                     StartTrace;                                       		// 0x002C (0x000C) [0x0000000000000000]              
	struct FTraceHitInfo                               HitInfo;                                          		// 0x0038 (0x0028) [0x0000000000000000]              
};

// ScriptStruct Engine.Actor.AnimSlotDesc
// 0x000C
struct FAnimSlotDesc
{
	struct FName                                       SlotName;                                         		// 0x0000 (0x0008) [0x0000000000000000]              
	int                                                NumChannels;                                      		// 0x0008 (0x0004) [0x0000000000000000]              
};

// ScriptStruct Engine.Actor.AnimSlotInfo
// 0x0018
struct FAnimSlotInfo
{
	struct FName                                       SlotName;                                         		// 0x0000 (0x0008) [0x0000000000000000]              
	TArray< float >                                    ChannelWeights;                                   		// 0x0008 (0x0010) [0x0000000000000000]              
};

// ScriptStruct Engine.Actor.TimerData
// 0x0020
struct FTimerData
{
	DWORD                                              bLoop : 1;                                        		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	DWORD                                              bPaused : 1;                                      		// 0x0000 (0x0004) [0x0000000000000000] [0x00000002] 
	struct FName                                       FuncName;                                         		// 0x0004 (0x0008) [0x0000000000000000]              
	float                                              Rate;                                             		// 0x000C (0x0004) [0x0000000000000000]              
	float                                              Count;                                            		// 0x0010 (0x0004) [0x0000000000000000]              
	float                                              TimerTimeDilation;                                		// 0x0014 (0x0004) [0x0000000000000000]              
	class UObject*                                     TimerObj;                                         		// 0x0018 (0x0008) [0x0000000000000000]              
};

// ScriptStruct Engine.LightComponent.LightingChannelContainer
// 0x0004
struct FLightingChannelContainer
{
	DWORD                                              bInitialized : 1;                                 		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	DWORD                                              BSP : 1;                                          		// 0x0000 (0x0004) [0x0000000000000000] [0x00000002] 
	DWORD                                              Static : 1;                                       		// 0x0000 (0x0004) [0x0000000000000000] [0x00000004] 
	DWORD                                              Dynamic : 1;                                      		// 0x0000 (0x0004) [0x0000000000000000] [0x00000008] 
	DWORD                                              CompositeDynamic : 1;                             		// 0x0000 (0x0004) [0x0000000000000000] [0x00000010] 
	DWORD                                              Skybox : 1;                                       		// 0x0000 (0x0004) [0x0000000000000000] [0x00000020] 
	DWORD                                              Unnamed : 1;                                      		// 0x0000 (0x0004) [0x0000000000000000] [0x00000040] 
	DWORD                                              Unnamed01 : 1;                                    		// 0x0000 (0x0004) [0x0000000000000000] [0x00000080] 
	DWORD                                              Unnamed02 : 1;                                    		// 0x0000 (0x0004) [0x0000000000000000] [0x00000100] 
	DWORD                                              Unnamed03 : 1;                                    		// 0x0000 (0x0004) [0x0000000000000000] [0x00000200] 
	DWORD                                              Unnamed04 : 1;                                    		// 0x0000 (0x0004) [0x0000000000000000] [0x00000400] 
	DWORD                                              Unnamed05 : 1;                                    		// 0x0000 (0x0004) [0x0000000000000000] [0x00000800] 
	DWORD                                              Cinematic : 1;                                    		// 0x0000 (0x0004) [0x0000000000000000] [0x00001000] 
	DWORD                                              Cinematic01 : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00002000] 
	DWORD                                              Cinematic02 : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00004000] 
	DWORD                                              Cinematic03 : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00008000] 
	DWORD                                              Cinematic04 : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00010000] 
	DWORD                                              Cinematic05 : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00020000] 
	DWORD                                              Cinematic06 : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00040000] 
	DWORD                                              Cinematic07 : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00080000] 
	DWORD                                              Cinematic08 : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00100000] 
	DWORD                                              Cinematic09 : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00200000] 
	DWORD                                              Gameplay : 1;                                     		// 0x0000 (0x0004) [0x0000000000000000] [0x00400000] 
	DWORD                                              Gameplay01 : 1;                                   		// 0x0000 (0x0004) [0x0000000000000000] [0x00800000] 
	DWORD                                              Gameplay02 : 1;                                   		// 0x0000 (0x0004) [0x0000000000000000] [0x01000000] 
	DWORD                                              Gameplay03 : 1;                                   		// 0x0000 (0x0004) [0x0000000000000000] [0x02000000] 
	DWORD                                              Crowd : 1;                                        		// 0x0000 (0x0004) [0x0000000000000000] [0x04000000] 
	DWORD                                              Indoor : 1;                                       		// 0x0000 (0x0004) [0x0000000000000000] [0x08000000] 
	DWORD                                              Outdoor : 1;                                      		// 0x0000 (0x0004) [0x0000000000000000] [0x10000000] 
};

// ScriptStruct Engine.PrimitiveComponent.RBCollisionChannelContainer
// 0x0004
struct FRBCollisionChannelContainer
{
	DWORD                                              Default : 1;                                      		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	DWORD                                              Nothing : 1;                                      		// 0x0000 (0x0004) [0x0000000000000000] [0x00000002] 
	DWORD                                              Pawn : 1;                                         		// 0x0000 (0x0004) [0x0000000000000000] [0x00000004] 
	DWORD                                              Vehicle : 1;                                      		// 0x0000 (0x0004) [0x0000000000000000] [0x00000008] 
	DWORD                                              Water : 1;                                        		// 0x0000 (0x0004) [0x0000000000000000] [0x00000010] 
	DWORD                                              GameplayPhysics : 1;                              		// 0x0000 (0x0004) [0x0000000000000000] [0x00000020] 
	DWORD                                              EffectPhysics : 1;                                		// 0x0000 (0x0004) [0x0000000000000000] [0x00000040] 
	DWORD                                              Untitled1 : 1;                                    		// 0x0000 (0x0004) [0x0000000000000000] [0x00000080] 
	DWORD                                              Untitled2 : 1;                                    		// 0x0000 (0x0004) [0x0000000000000000] [0x00000100] 
	DWORD                                              Untitled3 : 1;                                    		// 0x0000 (0x0004) [0x0000000000000000] [0x00000200] 
	DWORD                                              Untitled4 : 1;                                    		// 0x0000 (0x0004) [0x0000000000000000] [0x00000400] 
	DWORD                                              Cloth : 1;                                        		// 0x0000 (0x0004) [0x0000000000000000] [0x00000800] 
	DWORD                                              FluidDrain : 1;                                   		// 0x0000 (0x0004) [0x0000000000000000] [0x00001000] 
	DWORD                                              SoftBody : 1;                                     		// 0x0000 (0x0004) [0x0000000000000000] [0x00002000] 
	DWORD                                              FracturedMeshPart : 1;                            		// 0x0000 (0x0004) [0x0000000000000000] [0x00004000] 
	DWORD                                              BlockingVolume : 1;                               		// 0x0000 (0x0004) [0x0000000000000000] [0x00008000] 
	DWORD                                              DeadPawn : 1;                                     		// 0x0000 (0x0004) [0x0000000000000000] [0x00010000] 
	DWORD                                              Clothing : 1;                                     		// 0x0000 (0x0004) [0x0000000000000000] [0x00020000] 
	DWORD                                              ClothingCollision : 1;                            		// 0x0000 (0x0004) [0x0000000000000000] [0x00040000] 
	DWORD                                              Pickup : 1;                                       		// 0x0000 (0x0004) [0x0000000000000000] [0x00080000] 
	DWORD                                              FlexAsset : 1;                                    		// 0x0000 (0x0004) [0x0000000000000000] [0x00100000] 
	DWORD                                              CanBecomeDynamic : 1;                             		// 0x0000 (0x0004) [0x0000000000000000] [0x00200000] 
	DWORD                                              KnockedDownPawn : 1;                              		// 0x0000 (0x0004) [0x0000000000000000] [0x00400000] 
	DWORD                                              Visibility : 1;                                   		// 0x0000 (0x0004) [0x0000000000000000] [0x00800000] 
};

// ScriptStruct Engine.PrimitiveComponent.MaterialViewRelevance
// 0x0004
struct FMaterialViewRelevance
{
	DWORD                                              bOpaque : 1;                                      		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	DWORD                                              bTranslucent : 1;                                 		// 0x0000 (0x0004) [0x0000000000000000] [0x00000002] 
	DWORD                                              bDistortion : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000004] 
	DWORD                                              bOneLayerDistortionRelevance : 1;                 		// 0x0000 (0x0004) [0x0000000000000000] [0x00000008] 
	DWORD                                              bLit : 1;                                         		// 0x0000 (0x0004) [0x0000000000000000] [0x00000010] 
	DWORD                                              bUsesSceneColor : 1;                              		// 0x0000 (0x0004) [0x0000000000000000] [0x00000020] 
};

// ScriptStruct Engine.Texture.TextureGroupContainer
// 0x0008
struct FTextureGroupContainer
{
	DWORD                                              TEXTUREGROUP_World : 1;                           		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	DWORD                                              TEXTUREGROUP_WorldNormalMap : 1;                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000002] 
	DWORD                                              TEXTUREGROUP_WorldSpecular : 1;                   		// 0x0000 (0x0004) [0x0000000000000000] [0x00000004] 
	DWORD                                              TEXTUREGROUP_Character : 1;                       		// 0x0000 (0x0004) [0x0000000000000000] [0x00000008] 
	DWORD                                              TEXTUREGROUP_CharacterNormalMap : 1;              		// 0x0000 (0x0004) [0x0000000000000000] [0x00000010] 
	DWORD                                              TEXTUREGROUP_CharacterSpecular : 1;               		// 0x0000 (0x0004) [0x0000000000000000] [0x00000020] 
	DWORD                                              TEXTUREGROUP_Weapon : 1;                          		// 0x0000 (0x0004) [0x0000000000000000] [0x00000040] 
	DWORD                                              TEXTUREGROUP_WeaponNormalMap : 1;                 		// 0x0000 (0x0004) [0x0000000000000000] [0x00000080] 
	DWORD                                              TEXTUREGROUP_WeaponSpecular : 1;                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000100] 
	DWORD                                              TEXTUREGROUP_Vehicle : 1;                         		// 0x0000 (0x0004) [0x0000000000000000] [0x00000200] 
	DWORD                                              TEXTUREGROUP_VehicleNormalMap : 1;                		// 0x0000 (0x0004) [0x0000000000000000] [0x00000400] 
	DWORD                                              TEXTUREGROUP_VehicleSpecular : 1;                 		// 0x0000 (0x0004) [0x0000000000000000] [0x00000800] 
	DWORD                                              TEXTUREGROUP_Cinematic : 1;                       		// 0x0000 (0x0004) [0x0000000000000000] [0x00001000] 
	DWORD                                              TEXTUREGROUP_Effects : 1;                         		// 0x0000 (0x0004) [0x0000000000000000] [0x00002000] 
	DWORD                                              TEXTUREGROUP_EffectsNotFiltered : 1;              		// 0x0000 (0x0004) [0x0000000000000000] [0x00004000] 
	DWORD                                              TEXTUREGROUP_Skybox : 1;                          		// 0x0000 (0x0004) [0x0000000000000000] [0x00008000] 
	DWORD                                              TEXTUREGROUP_UI : 1;                              		// 0x0000 (0x0004) [0x0000000000000000] [0x00010000] 
	DWORD                                              TEXTUREGROUP_Lightmap : 1;                        		// 0x0000 (0x0004) [0x0000000000000000] [0x00020000] 
	DWORD                                              TEXTUREGROUP_RenderTarget : 1;                    		// 0x0000 (0x0004) [0x0000000000000000] [0x00040000] 
	DWORD                                              TEXTUREGROUP_MobileFlattened : 1;                 		// 0x0000 (0x0004) [0x0000000000000000] [0x00080000] 
	DWORD                                              TEXTUREGROUP_ProcBuilding_Face : 1;               		// 0x0000 (0x0004) [0x0000000000000000] [0x00100000] 
	DWORD                                              TEXTUREGROUP_ProcBuilding_LightMap : 1;           		// 0x0000 (0x0004) [0x0000000000000000] [0x00200000] 
	DWORD                                              TEXTUREGROUP_Shadowmap : 1;                       		// 0x0000 (0x0004) [0x0000000000000000] [0x00400000] 
	DWORD                                              TEXTUREGROUP_ColorLookupTable : 1;                		// 0x0000 (0x0004) [0x0000000000000000] [0x00800000] 
	DWORD                                              TEXTUREGROUP_Terrain_Heightmap : 1;               		// 0x0000 (0x0004) [0x0000000000000000] [0x01000000] 
	DWORD                                              TEXTUREGROUP_Terrain_Weightmap : 1;               		// 0x0000 (0x0004) [0x0000000000000000] [0x02000000] 
	DWORD                                              TEXTUREGROUP_ImageBasedReflection : 1;            		// 0x0000 (0x0004) [0x0000000000000000] [0x04000000] 
	DWORD                                              TEXTUREGROUP_Bokeh : 1;                           		// 0x0000 (0x0004) [0x0000000000000000] [0x08000000] 
	DWORD                                              TEXTUREGROUP_Creature : 1;                        		// 0x0000 (0x0004) [0x0000000000000000] [0x10000000] 
	DWORD                                              TEXTUREGROUP_CreatureNormalMap : 1;               		// 0x0000 (0x0004) [0x0000000000000000] [0x20000000] 
	DWORD                                              TEXTUREGROUP_CreatureSpecular : 1;                		// 0x0000 (0x0004) [0x0000000000000000] [0x40000000] 
	DWORD                                              TEXTUREGROUP_Weapon3rd : 1;                       		// 0x0000 (0x0004) [0x0000000000000000] [0x80000000] 
	DWORD                                              TEXTUREGROUP_Weapon3rdNormalMap : 1;              		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	DWORD                                              TEXTUREGROUP_Weapon3rdSpecular : 1;               		// 0x0004 (0x0004) [0x0000000000000000] [0x00000002] 
	DWORD                                              TEXTUREGROUP_Splattermap : 1;                     		// 0x0004 (0x0004) [0x0000000000000000] [0x00000004] 
	DWORD                                              TEXTUREGROUP_Cosmetic : 1;                        		// 0x0004 (0x0004) [0x0000000000000000] [0x00000008] 
	DWORD                                              TEXTUREGROUP_CosmeticNormalMap : 1;               		// 0x0004 (0x0004) [0x0000000000000000] [0x00000010] 
	DWORD                                              TEXTUREGROUP_CosmeticSpecular : 1;                		// 0x0004 (0x0004) [0x0000000000000000] [0x00000020] 
	DWORD                                              TEXTUREGROUP_UIWithMips : 1;                      		// 0x0004 (0x0004) [0x0000000000000000] [0x00000040] 
};

// ScriptStruct Engine.Texture2D.Texture2DMipMap
// 0x0048
struct FTexture2DMipMap
{
	struct FUntypedBulkData_Mirror                     Data;                                             		// 0x0000 (0x0040) [0x0000000000000000]              
	int                                                SizeX;                                            		// 0x0040 (0x0004) [0x0000000000000000]              
	int                                                SizeY;                                            		// 0x0044 (0x0004) [0x0000000000000000]              
};

// ScriptStruct Engine.Texture2D.TextureLinkedListMirror
// 0x0018
struct FTextureLinkedListMirror
{
	struct FPointer                                    Element;                                          		// 0x0000 (0x0008) [0x0000000000000000]              
	struct FPointer                                    Next;                                             		// 0x0008 (0x0008) [0x0000000000000000]              
	struct FPointer                                    PrevLink;                                         		// 0x0010 (0x0008) [0x0000000000000000]              
};

// ScriptStruct Engine.Info.KeyValuePair
// 0x0020
struct FKeyValuePair
{
	struct FString                                     Key;                                              		// 0x0000 (0x0010) [0x0000000000000000]              
	struct FString                                     Value;                                            		// 0x0010 (0x0010) [0x0000000000000000]              
};

// ScriptStruct Engine.Info.PlayerResponseLine
// 0x0034
struct FPlayerResponseLine
{
	int                                                PlayerNum;                                        		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                PlayerID;                                         		// 0x0004 (0x0004) [0x0000000000000000]              
	struct FString                                     PlayerName;                                       		// 0x0008 (0x0010) [0x0000000000000000]              
	int                                                Ping;                                             		// 0x0018 (0x0004) [0x0000000000000000]              
	int                                                Score;                                            		// 0x001C (0x0004) [0x0000000000000000]              
	int                                                StatsID;                                          		// 0x0020 (0x0004) [0x0000000000000000]              
	TArray< struct FKeyValuePair >                     PlayerInfo;                                       		// 0x0024 (0x0010) [0x0000000000000000]              
};

// ScriptStruct Engine.Info.ServerResponseLine
// 0x0078
struct FServerResponseLine
{
	int                                                ServerID;                                         		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FString                                     IP;                                               		// 0x0004 (0x0010) [0x0000000000000000]              
	int                                                Port;                                             		// 0x0014 (0x0004) [0x0000000000000000]              
	int                                                QueryPort;                                        		// 0x0018 (0x0004) [0x0000000000000000]              
	struct FString                                     ServerName;                                       		// 0x001C (0x0010) [0x0000000000000000]              
	struct FString                                     MapName;                                          		// 0x002C (0x0010) [0x0000000000000000]              
	struct FString                                     GameType;                                         		// 0x003C (0x0010) [0x0000000000000000]              
	int                                                CurrentPlayers;                                   		// 0x004C (0x0004) [0x0000000000000000]              
	int                                                MaxPlayers;                                       		// 0x0050 (0x0004) [0x0000000000000000]              
	int                                                Ping;                                             		// 0x0054 (0x0004) [0x0000000000000000]              
	TArray< struct FKeyValuePair >                     ServerInfo;                                       		// 0x0058 (0x0010) [0x0000000000000000]              
	TArray< struct FPlayerResponseLine >               PlayerInfo;                                       		// 0x0068 (0x0010) [0x0000000000000000]              
};

// ScriptStruct Engine.OnlineSubsystem.UniqueNetId
// 0x0008
struct FUniqueNetId
{
	struct FQWord                                      Uid;                                              		// 0x0000 (0x0008) [0x0000000000000000]              
};

// ScriptStruct Engine.OnlineSubsystem.PlayerNameIdPair
// 0x0018
struct FPlayerNameIdPair
{
	struct FString                                     PlayerName;                                       		// 0x0000 (0x0010) [0x0000000000000000]              
	struct FUniqueNetId                                UniqueId;                                         		// 0x0010 (0x0008) [0x0000000000000000]              
};

// ScriptStruct Engine.OnlineSubsystem.OnlineRegistrant
// 0x0008
struct FOnlineRegistrant
{
	struct FUniqueNetId                                PlayerNetId;                                      		// 0x0000 (0x0008) [0x0000000000000000]              
};

// ScriptStruct Engine.OnlineSubsystem.OnlineArbitrationRegistrant
// 0x000C(0x0014 - 0x0008)
struct FOnlineArbitrationRegistrant : FOnlineRegistrant
{
	struct FQWord                                      MachineId;                                        		// 0x0008 (0x0008) [0x0000000000000000]              
	int                                                Trustworthiness;                                  		// 0x0010 (0x0004) [0x0000000000000000]              
};

// ScriptStruct Engine.OnlineSubsystem.NamedSession
// 0x0038
struct FNamedSession
{
	struct FName                                       SessionName;                                      		// 0x0000 (0x0008) [0x0000000000000000]              
	struct FPointer                                    SessionInfo;                                      		// 0x0008 (0x0008) [0x0000000000000000]              
	class UOnlineGameSettings*                         GameSettings;                                     		// 0x0010 (0x0008) [0x0000000000000000]              
	TArray< struct FOnlineRegistrant >                 Registrants;                                      		// 0x0018 (0x0010) [0x0000000000000000]              
	TArray< struct FOnlineArbitrationRegistrant >      ArbitrationRegistrants;                           		// 0x0028 (0x0010) [0x0000000000000000]              
};

// ScriptStruct Engine.OnlineSubsystem.NamedInterface
// 0x0010
struct FNamedInterface
{
	struct FName                                       InterfaceName;                                    		// 0x0000 (0x0008) [0x0000000000000000]              
	class UObject*                                     InterfaceObject;                                  		// 0x0008 (0x0008) [0x0000000000000000]              
};

// ScriptStruct Engine.OnlineSubsystem.ExchangeRule
// 0x0008
struct FExchangeRule
{
	int                                                Definition;                                       		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                Quantity;                                         		// 0x0004 (0x0004) [0x0000000000000000]              
};

// ScriptStruct Engine.OnlineSubsystem.ExchangeRuleSets
// 0x0015
struct FExchangeRuleSets
{
	TArray< struct FExchangeRule >                     Sources;                                          		// 0x0000 (0x0010) [0x0000000000000000]              
	int                                                Target;                                           		// 0x0010 (0x0004) [0x0000000000000000]              
	unsigned char                                      Type;                                             		// 0x0014 (0x0001) [0x0000000000000000]              
};

// ScriptStruct Engine.OnlineSubsystem.ItemProperties
// 0x00E0
struct FItemProperties
{
	int                                                Definition;                                       		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FString                                     PlayfabItemId;                                    		// 0x0004 (0x0010) [0x0000000000000000]              
	struct FString                                     ProductID;                                        		// 0x0014 (0x0010) [0x0000000000000000]              
	struct FString                                     SignedOfferId;                                    		// 0x0024 (0x0010) [0x0000000000000000]              
	struct FString                                     RequiredKeyId;                                    		// 0x0034 (0x0010) [0x0000000000000000]              
	struct FString                                     Name;                                             		// 0x0044 (0x0010) [0x0000000000000000]              
	unsigned char                                      Type;                                             		// 0x0054 (0x0001) [0x0000000000000000]              
	unsigned char                                      Rarity;                                           		// 0x0055 (0x0001) [0x0000000000000000]              
	struct FString                                     ShortDescription;                                 		// 0x0058 (0x0010) [0x0000000000000000]              
	struct FString                                     Price;                                            		// 0x0068 (0x0010) [0x0000000000000000]              
	int                                                Quality;                                          		// 0x0078 (0x0004) [0x0000000000000000]              
	struct FString                                     IconURL;                                          		// 0x007C (0x0010) [0x0000000000000000]              
	struct FString                                     IconURLLarge;                                     		// 0x008C (0x0010) [0x0000000000000000]              
	DWORD                                              Tradeable : 1;                                    		// 0x009C (0x0004) [0x0000000000000000] [0x00000001] 
	DWORD                                              Commodity : 1;                                    		// 0x009C (0x0004) [0x0000000000000000] [0x00000002] 
	DWORD                                              Marketable : 1;                                   		// 0x009C (0x0004) [0x0000000000000000] [0x00000004] 
	struct FString                                     Description;                                      		// 0x00A0 (0x0010) [0x0000000000000000]              
	struct FString                                     Exchange;                                         		// 0x00B0 (0x0010) [0x0000000000000000]              
	struct FString                                     Bundle;                                           		// 0x00C0 (0x0010) [0x0000000000000000]              
	DWORD                                              UniqueToOwn : 1;                                  		// 0x00D0 (0x0004) [0x0000000000000000] [0x00000001] 
	int                                                PerkId;                                           		// 0x00D4 (0x0004) [0x0000000000000000]              
	int                                                AltPerkId;                                        		// 0x00D8 (0x0004) [0x0000000000000000]              
	int                                                WeaponType;                                       		// 0x00DC (0x0004) [0x0000000000000000]              
};

// ScriptStruct Engine.OnlineSubsystem.CurrentInventoryEntry
// 0x002C
struct FCurrentInventoryEntry
{
	struct FUniqueNetId                                Instance;                                         		// 0x0000 (0x0008) [0x0000000000000000]              
	struct FString                                     PlayfabItemId;                                    		// 0x0008 (0x0010) [0x0000000000000000]              
	int                                                Definition;                                       		// 0x0018 (0x0004) [0x0000000000000000]              
	int                                                Quantity;                                         		// 0x001C (0x0004) [0x0000000000000000]              
	int                                                NewlyAdded;                                       		// 0x0020 (0x0004) [0x0000000000000000]              
	int                                                LastUsedTime;                                     		// 0x0024 (0x0004) [0x0000000000000000]              
	DWORD                                              InFlight : 1;                                     		// 0x0028 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct Engine.OnlineSubsystem.SessionMemberInfo
// 0x0030
struct FSessionMemberInfo
{
	struct FUniqueNetId                                PlayerNetId;                                      		// 0x0000 (0x0008) [0x0000000000000000]              
	unsigned char                                      MemberStatus;                                     		// 0x0008 (0x0001) [0x0000000000000000]              
	struct FString                                     SecureAddress;                                    		// 0x000C (0x0010) [0x0000000000000000]              
	struct FString                                     NickName;                                         		// 0x001C (0x0010) [0x0000000000000000]              
	DWORD                                              Muted : 1;                                        		// 0x002C (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct Engine.OnlineSubsystem.SessionUpdateInfo
// 0x0024
struct FSessionUpdateInfo
{
	TArray< struct FSessionMemberInfo >                MembersJoined;                                    		// 0x0000 (0x0010) [0x0000000000000000]              
	TArray< struct FSessionMemberInfo >                MembersLeft;                                      		// 0x0010 (0x0010) [0x0000000000000000]              
	DWORD                                              bHostDeviceTokenChanged : 1;                      		// 0x0020 (0x0004) [0x0000000000000000] [0x00000001] 
	DWORD                                              bInitializationStateChanged : 1;                  		// 0x0020 (0x0004) [0x0000000000000000] [0x00000002] 
	DWORD                                              bMatchmakingStatusChanged : 1;                    		// 0x0020 (0x0004) [0x0000000000000000] [0x00000004] 
	DWORD                                              bMemberJoinedOrLeft : 1;                          		// 0x0020 (0x0004) [0x0000000000000000] [0x00000008] 
	DWORD                                              bMemberStatusChanged : 1;                         		// 0x0020 (0x0004) [0x0000000000000000] [0x00000010] 
	DWORD                                              bSessionJoinabilityChanged : 1;                   		// 0x0020 (0x0004) [0x0000000000000000] [0x00000020] 
	DWORD                                              bCustomPropertyChange : 1;                        		// 0x0020 (0x0004) [0x0000000000000000] [0x00000040] 
	DWORD                                              bMemberCustomPropertyChange : 1;                  		// 0x0020 (0x0004) [0x0000000000000000] [0x00000080] 
};

// ScriptStruct Engine.OnlineSubsystem.SocialPostImageFlags
// 0x0004
struct FSocialPostImageFlags
{
	DWORD                                              bIsUserGeneratedImage : 1;                        		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	DWORD                                              bIsGameGeneratedImage : 1;                        		// 0x0000 (0x0004) [0x0000000000000000] [0x00000002] 
	DWORD                                              bIsAchievementImage : 1;                          		// 0x0000 (0x0004) [0x0000000000000000] [0x00000004] 
	DWORD                                              bIsMediaImage : 1;                                		// 0x0000 (0x0004) [0x0000000000000000] [0x00000008] 
};

// ScriptStruct Engine.OnlineSubsystem.SocialPostImageInfo
// 0x0044
struct FSocialPostImageInfo
{
	struct FSocialPostImageFlags                       Flags;                                            		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FString                                     MessageText;                                      		// 0x0004 (0x0010) [0x0000000000000000]              
	struct FString                                     TitleText;                                        		// 0x0014 (0x0010) [0x0000000000000000]              
	struct FString                                     PictureCaption;                                   		// 0x0024 (0x0010) [0x0000000000000000]              
	struct FString                                     PictureDescription;                               		// 0x0034 (0x0010) [0x0000000000000000]              
};

// ScriptStruct Engine.OnlineSubsystem.SocialPostLinkInfo
// 0x0020(0x0064 - 0x0044)
struct FSocialPostLinkInfo : FSocialPostImageInfo
{
	struct FString                                     TitleURL;                                         		// 0x0044 (0x0010) [0x0000000000000000]              
	struct FString                                     PictureURL;                                       		// 0x0054 (0x0010) [0x0000000000000000]              
};

// ScriptStruct Engine.OnlineSubsystem.SocialPostPrivileges
// 0x0004
struct FSocialPostPrivileges
{
	DWORD                                              bCanPostImage : 1;                                		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	DWORD                                              bCanPostLink : 1;                                 		// 0x0000 (0x0004) [0x0000000000000000] [0x00000002] 
};

// ScriptStruct Engine.OnlineSubsystem.OnlinePartyMember
// 0x003C
struct FOnlinePartyMember
{
	struct FUniqueNetId                                UniqueId;                                         		// 0x0000 (0x0008) [0x0000000000000000]              
	struct FString                                     NickName;                                         		// 0x0008 (0x0010) [0x0000000000000000]              
	unsigned char                                      LocalUserNum;                                     		// 0x0018 (0x0001) [0x0000000000000000]              
	unsigned char                                      NatType;                                          		// 0x0019 (0x0001) [0x0000000000000000]              
	int                                                TitleId;                                          		// 0x001C (0x0004) [0x0000000000000000]              
	DWORD                                              bIsLocal : 1;                                     		// 0x0020 (0x0004) [0x0000000000000000] [0x00000001] 
	DWORD                                              bIsInPartyVoice : 1;                              		// 0x0020 (0x0004) [0x0000000000000000] [0x00000002] 
	DWORD                                              bIsTalking : 1;                                   		// 0x0020 (0x0004) [0x0000000000000000] [0x00000004] 
	DWORD                                              bIsInGameSession : 1;                             		// 0x0020 (0x0004) [0x0000000000000000] [0x00000008] 
	DWORD                                              bIsPlayingThisGame : 1;                           		// 0x0020 (0x0004) [0x0000000000000000] [0x00000010] 
	struct FQWord                                      SessionId;                                        		// 0x0024 (0x0008) [0x0000000000000000]              
	int                                                Data1;                                            		// 0x002C (0x0004) [0x0000000000000000]              
	int                                                Data2;                                            		// 0x0030 (0x0004) [0x0000000000000000]              
	int                                                Data3;                                            		// 0x0034 (0x0004) [0x0000000000000000]              
	int                                                Data4;                                            		// 0x0038 (0x0004) [0x0000000000000000]              
};

// ScriptStruct Engine.OnlineSubsystem.PermissionsResult
// 0x0034
struct FPermissionsResult
{
	struct FSessionMemberInfo                          User;                                             		// 0x0000 (0x0030) [0x0000000000000000]              
	DWORD                                              bHasPermission : 1;                               		// 0x0030 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct Engine.OnlineSubsystem.MarketplaceInventoryItem
// 0x0064
struct FMarketplaceInventoryItem
{
	struct FString                                     ProductID;                                        		// 0x0000 (0x0010) [0x0000000000000000]              
	unsigned char                                      MediaItemType;                                    		// 0x0010 (0x0001) [0x0000000000000000]              
	unsigned char                                      ItemState;                                        		// 0x0011 (0x0001) [0x0000000000000000]              
	int                                                ConsumableBalance;                                		// 0x0014 (0x0004) [0x0000000000000000]              
	int                                                TitleId;                                          		// 0x0018 (0x0004) [0x0000000000000000]              
	TArray< struct FString >                           ContainerIds;                                     		// 0x001C (0x0010) [0x0000000000000000]              
	struct FQWord                                      StartDate;                                        		// 0x002C (0x0008) [0x0000000000000000]              
	struct FQWord                                      EndDate;                                          		// 0x0034 (0x0008) [0x0000000000000000]              
	struct FQWord                                      RightsObtainedDate;                               		// 0x003C (0x0008) [0x0000000000000000]              
	struct FString                                     URL;                                              		// 0x0044 (0x0010) [0x0000000000000000]              
	struct FString                                     ConsumableUrl;                                    		// 0x0054 (0x0010) [0x0000000000000000]              
};

// ScriptStruct Engine.OnlineSubsystem.MarketplaceProductImage
// 0x0048
struct FMarketplaceProductImage
{
	struct FString                                     Id;                                               		// 0x0000 (0x0010) [0x0000000000000000]              
	int                                                Height;                                           		// 0x0010 (0x0004) [0x0000000000000000]              
	int                                                Width;                                            		// 0x0014 (0x0004) [0x0000000000000000]              
	struct FString                                     Purpose;                                          		// 0x0018 (0x0010) [0x0000000000000000]              
	TArray< struct FString >                           Purposes;                                         		// 0x0028 (0x0010) [0x0000000000000000]              
	struct FString                                     ResizeURL;                                        		// 0x0038 (0x0010) [0x0000000000000000]              
};

// ScriptStruct Engine.OnlineSubsystem.MarketplaceProductAvailability
// 0x00C0
struct FMarketplaceProductAvailability
{
	TArray< struct FString >                           AcceptablePaymentInstrumentTypes;                 		// 0x0000 (0x0010) [0x0000000000000000]              
	struct FString                                     Description;                                      		// 0x0010 (0x0010) [0x0000000000000000]              
	struct FString                                     Title;                                            		// 0x0020 (0x0010) [0x0000000000000000]              
	int                                                ConsumableQuantity;                               		// 0x0030 (0x0004) [0x0000000000000000]              
	struct FString                                     ContentId;                                        		// 0x0034 (0x0010) [0x0000000000000000]              
	struct FString                                     CurrencyCode;                                     		// 0x0044 (0x0010) [0x0000000000000000]              
	struct FString                                     DisplayListPrice;                                 		// 0x0054 (0x0010) [0x0000000000000000]              
	struct FString                                     DisplayPrice;                                     		// 0x0064 (0x0010) [0x0000000000000000]              
	struct FString                                     DistributionType;                                 		// 0x0074 (0x0010) [0x0000000000000000]              
	DWORD                                              bIsPurchasable : 1;                               		// 0x0084 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              ListPrice;                                        		// 0x0088 (0x0004) [0x0000000000000000]              
	struct FString                                     OfferId;                                          		// 0x008C (0x0010) [0x0000000000000000]              
	float                                              Price;                                            		// 0x009C (0x0004) [0x0000000000000000]              
	struct FString                                     PromotionalText;                                  		// 0x00A0 (0x0010) [0x0000000000000000]              
	struct FString                                     SignedOffer;                                      		// 0x00B0 (0x0010) [0x0000000000000000]              
};

// ScriptStruct Engine.OnlineSubsystem.MarketplaceProductDetails
// 0x0098
struct FMarketplaceProductDetails
{
	struct FString                                     StandardId;                                       		// 0x0000 (0x0010) [0x0000000000000000]              
	unsigned char                                      MediaItemType;                                    		// 0x0010 (0x0001) [0x0000000000000000]              
	struct FString                                     ProductName;                                      		// 0x0014 (0x0010) [0x0000000000000000]              
	struct FString                                     ProductID;                                        		// 0x0024 (0x0010) [0x0000000000000000]              
	struct FQWord                                      ReleaseDate;                                      		// 0x0034 (0x0008) [0x0000000000000000]              
	struct FString                                     SandboxId;                                        		// 0x003C (0x0010) [0x0000000000000000]              
	int                                                TitleId;                                          		// 0x004C (0x0004) [0x0000000000000000]              
	DWORD                                              bIsBundle : 1;                                    		// 0x0050 (0x0004) [0x0000000000000000] [0x00000001] 
	DWORD                                              bIsPartOfAnyBundle : 1;                           		// 0x0050 (0x0004) [0x0000000000000000] [0x00000002] 
	struct FString                                     ReducedName;                                      		// 0x0054 (0x0010) [0x0000000000000000]              
	TArray< struct FMarketplaceProductImage >          Images;                                           		// 0x0064 (0x0010) [0x0000000000000000]              
	unsigned char                                      DetailsReadState;                                 		// 0x0074 (0x0001) [0x0000000000000000]              
	TArray< struct FMarketplaceProductAvailability >   Availabilities;                                   		// 0x0078 (0x0010) [0x0000000000000000]              
	struct FString                                     ProductDescription;                               		// 0x0088 (0x0010) [0x0000000000000000]              
};

// ScriptStruct Engine.OnlineSubsystem.AchievementReward
// 0x0031
struct FAchievementReward
{
	struct FString                                     RewardName;                                       		// 0x0000 (0x0010) [0x0000000000000000]              
	struct FString                                     Description;                                      		// 0x0010 (0x0010) [0x0000000000000000]              
	struct FString                                     Data;                                             		// 0x0020 (0x0010) [0x0000000000000000]              
	unsigned char                                      RewardType;                                       		// 0x0030 (0x0001) [0x0000000000000000]              
};

// ScriptStruct Engine.OnlineSubsystem.AchievementMediaAsset
// 0x0024
struct FAchievementMediaAsset
{
	struct FString                                     AssetName;                                        		// 0x0000 (0x0010) [0x0000000000000000]              
	unsigned char                                      AssetType;                                        		// 0x0010 (0x0001) [0x0000000000000000]              
	struct FString                                     AssetURL;                                         		// 0x0014 (0x0010) [0x0000000000000000]              
};

// ScriptStruct Engine.OnlineSubsystem.AchievementTitleAssociation
// 0x0014
struct FAchievementTitleAssociation
{
