/*
#############################################################################################
# Killing Floor 2 (1.8787) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: GameFramework_classes.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/

#define CONST_LOADING_MOVIE                                      "LoadingMovie"
#define CONST_GAMEEVENT_AGGREGATED_DATA                          10000
#define CONST_GAMEEVENT_AGGREGATED_PLAYER_TIMEALIVE              10001
#define CONST_GAMEEVENT_AGGREGATED_PLAYER_KILLS                  10002
#define CONST_GAMEEVENT_AGGREGATED_PLAYER_DEATHS                 10003
#define CONST_GAMEEVENT_AGGREGATED_PLAYER_MATCH_WON              10004
#define CONST_GAMEEVENT_AGGREGATED_PLAYER_ROUND_WON              10005

	GT_Multiplayer                                     = 3,
	GT_MAX                                             = 4
};*/

// Enum GameFramework.GameThirdPersonCameraMode.ECameraViewportTypes
/*enum ECameraViewportTypes
{
	CVT_16to9_Full                                     = 0,
	CVT_16to9_VertSplit                                = 1,
	CVT_16to9_HorizSplit                               = 2,
	CVT_4to3_Full                                      = 3,
	CVT_4to3_HorizSplit                                = 4,
	CVT_4to3_VertSplit                                 = 5,
	CVT_MAX                                            = 6
};*/

// Enum GameFramework.MobileInputZone.EZoneType
/*enum EZoneType
{
	ZoneType_Button                                    = 0,
	ZoneType_Joystick                                  = 1,
	ZoneType_Trackball                                 = 2,
	ZoneType_Slider                                    = 3,
	ZoneType_SubClassed                                = 4,
	ZoneType_MAX                                       = 5
};*/

// Enum GameFramework.MobileInputZone.EZoneState
/*enum EZoneState
{
	ZoneState_Inactive                                 = 0,
	ZoneState_Activating                               = 1,
	ZoneState_Active                                   = 2,
	ZoneState_Deactivating                             = 3,
	ZoneState_MAX                                      = 4
};*/

// Enum GameFramework.MobileInputZone.EZoneSlideType
/*enum EZoneSlideType
{
	ZoneSlide_UpDown                                   = 0,
	ZoneSlide_LeftRight                                = 1,
	ZoneSlide_MAX                                      = 2
};*/

// Enum GameFramework.MobilePlayerInput.EUIOrientation
/*enum EUIOrientation
{
	UI_Unknown                                         = 0,
	UI_Portait                                         = 1,
	UI_PortaitUpsideDown                               = 2,
	UI_LandscapeRight                                  = 3,
	UI_LandscapeLeft                                   = 4,
	UI_MAX                                             = 5
};*/

// Enum GameFramework.MobileMenuImage.MenuImageDrawStyle
/*enum MenuImageDrawStyle
{
	IDS_Normal                                         = 0,
	IDS_Stretched                                      = 1,
	IDS_Tile                                           = 2,
	IDS_MAX                                            = 3
};*/

// Enum GameFramework.SeqEvent_HudRenderText.ETextDrawMethod
/*enum ETextDrawMethod
{
	DRAW_CenterText                                    = 0,
	DRAW_WrapText                                      = 1,
	DRAW_MAX                                           = 2
};*/


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class GameFramework.GameAIController
// 0x004C (0x04A8 - 0x045C)
class AGameAIController : public AAIController
{
public:
	class UGameAICommand*                              CommandList;                                      		// 0x045C (0x0008) [0x0000000000000000]              
	DWORD                                              bHasRunawayCommandList : 1;                       		// 0x0464 (0x0004) [0x0000000000000000] [0x00000001] 
	DWORD                                              bAILogging : 1;                                   		// 0x0464 (0x0004) [0x0000000000000000] [0x00000002] 
	DWORD                                              bAILogToWindow : 1;                               		// 0x0464 (0x0004) [0x0000000000000000] [0x00000004] 
	DWORD                                              bFlushAILogEachLine : 1;                          		// 0x0464 (0x0004) [0x0000000000000000] [0x00000008] 
	DWORD                                              bMapBasedLogName : 1;                             		// 0x0464 (0x0004) [0x0000000000000000] [0x00000010] 
	DWORD                                              bAIDrawDebug : 1;                                 		// 0x0464 (0x0004) [0x0000000000000000] [0x00000020] 
	DWORD                                              bAIBroken : 1;                                    		// 0x0464 (0x0004) [0x0000000000000000] [0x00000040] 
	class AFileLog*                                    AILogFile;                                        		// 0x0468 (0x0008) [0x0000000000000000]              
	float                                              DebugTextMaxLen;                                  		// 0x0470 (0x0004) [0x0000000000000000]              
	TArray< struct FAICmdHistoryItem >                 CommandHistory;                                   		// 0x0474 (0x0010) [0x0000000000000000]              
	int                                                CommandHistoryNum;                                		// 0x0484 (0x0004) [0x0000000000000000]              
	TArray< struct FName >                             AILogFilter;                                      		// 0x0488 (0x0010) [0x0000000000000000]              
	struct FString                                     DemoActionString;                                 		// 0x0498 (0x0010) [0x0000000000170000]              ( CPF_Travel | CPF_EditConst | CPF_GlobalConfig )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2830 ];

		return pClassPointer;
	};

	void eventGetActionString ( );
	void SetDesiredRotation ( );
	void eventAILog_Internal ( );
	void RecordDemoAILog ( );
	void eventDestroyed ( );
	void ReachedIntermediateMoveGoal ( );
	void ReachedMoveGoal ( );
	void GetDestinationOffset ( );
	void GetAICommandInStack ( );
	void FindCommandOfClass ( );
	void DumpCommandStack ( );
	void CheckCommandCount ( );
	void GetActiveCommand ( );
	void AbortCommand ( );
	void PopCommand ( );
	void PushCommand ( );
	void AllCommands ( );
};

UClass* AGameAIController::pClassPointer = NULL;

// Class GameFramework.GamePawn
// 0x0004 (0x055C - 0x0558)
class AGamePawn : public APawn
{
public:
	DWORD                                              bLastHitWasHeadShot : 1;                          		// 0x0558 (0x0004) [0x0000000000320000] [0x00000001] ( CPF_EditConst )
	DWORD                                              bRespondToExplosions : 1;                         		// 0x0558 (0x0004) [0x0000000000000000] [0x00000002] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2835 ];

		return pClassPointer;
	};

	void ReattachMeshWithoutBeingSeen ( );
	void ReattachMesh ( );
	void eventUpdateShadowSettings ( );
};

UClass* AGamePawn::pClassPointer = NULL;

// Class GameFramework.DynamicSpriteComponent
// 0x004C (0x02AC - 0x0260)
class UDynamicSpriteComponent : public USpriteComponent
{
public:
	struct FInterpCurveFloat                           AnimatedScale;                                    		// 0x0260 (0x0014) [0x0000000000000000]              
	struct FInterpCurveLinearColor                     AnimatedColor;                                    		// 0x0274 (0x0014) [0x0000000000000000]              
	struct FInterpCurveVector2D                        AnimatedPosition;                                 		// 0x0288 (0x0014) [0x0000000000000000]              
	struct FVector                                     LocationOffset;                                   		// 0x029C (0x000C) [0x0000000000000000]              
	int                                                LoopCount;                                        		// 0x02A8 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2869 ];

		return pClassPointer;
	};

};

UClass* UDynamicSpriteComponent::pClassPointer = NULL;

// Class GameFramework.FrameworkGame
// 0x0010 (0x04A8 - 0x0498)
class AFrameworkGame : public AGameInfo
{
public:
	TArray< struct FRequiredMobileInputConfig >        RequiredMobileInputConfigs;                       		// 0x0498 (0x0010) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2871 ];

		return pClassPointer;
	};

};

UClass* AFrameworkGame::pClassPointer = NULL;

// Class GameFramework.GameAICommand
// 0x0034 (0x0094 - 0x0060)
class UGameAICommand : public UAICommandBase
{
public:
	class UGameAICommand*                              ChildCommand;                                     		// 0x0060 (0x0008) [0x0000000000000000]              
	struct FName                                       ChildStatus;                                      		// 0x0068 (0x0008) [0x0000000000000000]              
	class AGameAIController*                           GameAIOwner;                                      		// 0x0070 (0x0008) [0x0000000000000000]              
	struct FName                                       Status;                                           		// 0x0078 (0x0008) [0x0000000000000000]              
	DWORD                                              bAllowNewSameClassInstance : 1;                   		// 0x0080 (0x0004) [0x0000000000000000] [0x00000001] 
	DWORD                                              bReplaceActiveSameClassInstance : 1;              		// 0x0080 (0x0004) [0x0000000000000000] [0x00000002] 
	DWORD                                              bAborted : 1;                                     		// 0x0080 (0x0004) [0x0000000000000000] [0x00000004] 
	DWORD                                              bIgnoreNotifies : 1;                              		// 0x0080 (0x0004) [0x0000000000000000] [0x00000008] 
	DWORD                                              bIgnoreStepAside : 1;                             		// 0x0080 (0x0004) [0x0000000000000000] [0x00000010] 
	DWORD                                              bPendingPop : 1;                                  		// 0x0080 (0x0004) [0x0000000000000000] [0x00000020] 
	DWORD                                              bDisableSteering : 1;                             		// 0x0080 (0x0004) [0x0000000000000000] [0x00000040] 
	struct FString                                     HistoryString;                                    		// 0x0084 (0x0010) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2873 ];

		return pClassPointer;
	};

	void HandlePathObstruction ( );
	void MoveUnreachable ( );
	void NotifyNeedRepath ( );
	void eventGetDebugVerboseText ( );
	void GetDebugOverheadText ( );
	void eventDrawDebug ( );
	void eventGetDumpString ( );
	void Resumed ( );
	void Paused ( );
	void Popped ( );
	void Pushed ( );
	void PostPopped ( );
	void PrePushed ( );
	void AllowStateTransitionTo ( );
	void AllowTransitionTo ( );
	void Tick ( );
	void ShouldIgnoreNotifies ( );
	void eventInternalTick ( );
	void eventInternalResumed ( );
	void eventInternalPaused ( );
	void eventInternalPopped ( );
	void eventInternalPushed ( );
	void eventInternalPrePushed ( );
	void InitCommand ( );
	void InitCommandUserActor ( );
};

UClass* UGameAICommand::pClassPointer = NULL;

// Class GameFramework.GameCameraBlockingVolume
// 0x0000 (0x0284 - 0x0284)
class AGameCameraBlockingVolume : public ABlockingVolume
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2875 ];

		return pClassPointer;
	};

};

UClass* AGameCameraBlockingVolume::pClassPointer = NULL;

// Class GameFramework.GamePlayerController
// 0x0010 (0x0780 - 0x0770)
class AGamePlayerController : public APlayerController
{
public:
	DWORD                                              bWarnCrowdMembers : 1;                            		// 0x0770 (0x0004) [0x0000000000000000] [0x00000001] 
	DWORD                                              bDebugCrowdAwareness : 1;                         		// 0x0770 (0x0004) [0x0000000000000000] [0x00000002] 
	DWORD                                              bIsWarmupPaused : 1;                              		// 0x0770 (0x0004) [0x0000000000000000] [0x00000004] 
	float                                              AgentAwareRadius;                                 		// 0x0774 (0x0004) [0x0000000000000000]              
	struct FName                                       CurrentSoundMode;                                 		// 0x0778 (0x0008) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2877 ];

		return pClassPointer;
	};

	void ClientColorFade ( );
	void eventWarmupPause ( );
	void CanUnpauseWarmup ( );
	void GetCurrentMovie ( );
	void eventClientStopMovie ( );
	void eventClientPlayMovie ( );
	void KeepPlayingLoadingMovie ( );
	void ShowLoadingMovie ( );
	void SetSoundMode ( );
	void DoForceFeedbackForScreenShake ( );
	void eventNotifyCrowdAgentInRadius ( );
	void eventNotifyCrowdAgentRefresh ( );
	void CrowdDebug ( );
	void GetUIPlayerIndex ( );
	void OnToggleMouseCursor ( );
};

UClass* AGamePlayerController::pClassPointer = NULL;

// Class GameFramework.GameCheatManager
// 0x0020 (0x00A0 - 0x0080)
class UGameCheatManager : public UCheatManager
{
public:
	class ADebugCameraController*                      DebugCameraControllerRef;                         		// 0x0080 (0x0008) [0x0000000000000000]              
	class UClass*                                      DebugCameraControllerClass;                       		// 0x0088 (0x0008) [0x0000000000000000]              
	struct FString                                     DebugCameraControllerClassName;                   		// 0x0090 (0x0010) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2879 ];

		return pClassPointer;
	};

	void OnRequestComplete ( );
	void TestHttp ( );
	void EnableDebugCamera ( );
	void TeleportPawnToCamera ( );
	void ToggleDebugCamera ( );
	void PatchDebugCameraController ( );
};

UClass* UGameCheatManager::pClassPointer = NULL;

// Class GameFramework.GameCrowdAgent
// 0x0278 (0x04C4 - 0x024C)
class AGameCrowdAgent : public ACrowdAgentBase
{
public:
	struct FPointer                                    VfTable_IInterface_RVO;                           		// 0x024C (0x0008) [0x0000000000000000]              
	class UGameCrowdGroup*                             MyGroup;                                          		// 0x0254 (0x0008) [0x0000000000000000]              
	struct FVector                                     PreferredVelocity;                                		// 0x025C (0x000C) [0x0000000000000000]              
	struct FVector                                     PendingVelocity;                                  		// 0x0268 (0x000C) [0x0000000000000000]              
	class AGameCrowdDestination*                       CurrentDestination;                               		// 0x0274 (0x0008) [0x0000000000000000]              
	class AGameCrowdDestination*                       BehaviorDestination;                              		// 0x027C (0x0008) [0x0000000000000000]              
	class AGameCrowdDestination*                       PreviousDestination;                              		// 0x0284 (0x0008) [0x0000000000000000]              
	float                                              InterpZTranslation;                               		// 0x028C (0x0004) [0x0000000000000000]              
	int                                                Health;                                           		// 0x0290 (0x0004) [0x0000000000000000]              
	float                                              DeadBodyDuration;                                 		// 0x0294 (0x0004) [0x0000000000000000]              
	class UDynamicLightEnvironmentComponent*           LightEnvironment;                                 		// 0x0298 (0x0008) [0x0000000000000000]              
	int                                                ConformTraceFrameCount;                           		// 0x02A0 (0x0004) [0x0000000000000000]              
	TArray< struct FNearbyDynamicItem >                NearbyDynamics;                                   		// 0x02A4 (0x0010) [0x0000000000000000]              
	DWORD                                              bUniformScale : 1;                                		// 0x02B4 (0x0004) [0x0000000000000000] [0x00000001] 
	DWORD                                              bCheckForObstacles : 1;                           		// 0x02B4 (0x0004) [0x0000000000000000] [0x00000002] 
	DWORD                                              bUseNavMeshPathing : 1;                           		// 0x02B4 (0x0004) [0x0000000000000000] [0x00000004] 
	DWORD                                              bWantsSeePlayerNotification : 1;                  		// 0x02B4 (0x0004) [0x0000000000000000] [0x00000008] 
	DWORD                                              bAllowPitching : 1;                               		// 0x02B4 (0x0004) [0x0000000000000000] [0x00000010] 
	DWORD                                              bHitObstacle : 1;                                 		// 0x02B4 (0x0004) [0x0000000000000000] [0x00000020] 
	DWORD                                              bBadHitNormal : 1;                                		// 0x02B4 (0x0004) [0x0000000000000000] [0x00000040] 
	DWORD                                              bSimulateThisTick : 1;                            		// 0x02B4 (0x0004) [0x0000000000000000] [0x00000080] 
	DWORD                                              bPotentialEncounter : 1;                          		// 0x02B4 (0x0004) [0x0000000000000000] [0x00000100] 
	DWORD                                              bIsPanicked : 1;                                  		// 0x02B4 (0x0004) [0x0000000000000000] [0x00000200] 
	DWORD                                              bWantsGroupIdle : 1;                              		// 0x02B4 (0x0004) [0x0000000000000000] [0x00000400] 
	DWORD                                              bPreferVisibleDestination : 1;                    		// 0x02B4 (0x0004) [0x0000000000000000] [0x00000800] 
	DWORD                                              bPreferVisibleDestinationOnSpawn : 1;             		// 0x02B4 (0x0004) [0x0000000000000000] [0x00001000] 
	DWORD                                              bHasNotifiedSpawner : 1;                          		// 0x02B4 (0x0004) [0x0000000000000000] [0x00002000] 
	DWORD                                              bIsInSpawnPool : 1;                               		// 0x02B4 (0x0004) [0x0000000000000000] [0x00004000] 
	DWORD                                              bPaused : 1;                                      		// 0x02B4 (0x0004) [0x0000000000000000] [0x00008000] 
	unsigned char                                      ConformType;                                      		// 0x02B8 (0x0001) [0x0000000000000000]              
	float                                              ConformTraceDist;                                 		// 0x02BC (0x0004) [0x0000000000000000]              
	int                                                ConformTraceInterval;                             		// 0x02C0 (0x0004) [0x0000000000000000]              
	int                                                CurrentConformTraceInterval;                      		// 0x02C4 (0x0004) [0x0000000000000000]              
	float                                              LastGroundZ;                                      		// 0x02C8 (0x0004) [0x0000000000000000]              
	float                                              AwareRadius;                                      		// 0x02CC (0x0004) [0x0000000000000000]              
	float                                              AvoidOtherRadius;                                 		// 0x02D0 (0x0004) [0x0000000000000000]              
	TArray< struct FAvoidOtherSampleItem >             AvoidOtherSampleList;                             		// 0x02D4 (0x0010) [0x0000000000000000]              
	float                                              PENALTY_COEFF_ANGLETOGOAL;                        		// 0x02E4 (0x0004) [0x0000000000000000]              
	float                                              PENALTY_COEFF_ANGLETOVEL;                         		// 0x02E8 (0x0004) [0x0000000000000000]              
	float                                              PENALTY_COEFF_MAG;                                		// 0x02EC (0x0004) [0x0000000000000000]              
	float                                              MIN_PENALTY_THRESHOLD;                            		// 0x02F0 (0x0004) [0x0000000000000000]              
	float                                              LastProgressTime;                                 		// 0x02F4 (0x0004) [0x0000000000000000]              
	float                                              LastFallbackActiveTime;                           		// 0x02F8 (0x0004) [0x0000000000000000]              
	float                                              MaxPathLaneValue;                                 		// 0x02FC (0x0004) [0x0000000000000000]              
	float                                              CurrentPathLaneValue;                             		// 0x0300 (0x0004) [0x0000000000000000]              
	int                                                ExtraPathCost;                                    		// 0x0304 (0x0004) [0x0000000000000000]              
	float                                              RotateToTargetSpeed;                              		// 0x0308 (0x0004) [0x0000000000000000]              
	float                                              MaxYawRate;                                       		// 0x030C (0x0004) [0x0000000000000000]              
	struct FVector                                     MeshMinScale3D;                                   		// 0x0310 (0x000C) [0x0000000000000000]              
	struct FVector                                     MeshMaxScale3D;                                   		// 0x031C (0x000C) [0x0000000000000000]              
	float                                              EyeZOffset;                                       		// 0x0328 (0x0004) [0x0000000000000000]              
	float                                              ProximityLODDist;                                 		// 0x032C (0x0004) [0x0000000000000000]              
	float                                              VisibleProximityLODDist;                          		// 0x0330 (0x0004) [0x0000000000000000]              
	struct FVector                                     LastKnownGoodPosition;                            		// 0x0334 (0x000C) [0x0000000000000000]              
	float                                              GroundOffset;                                     		// 0x0340 (0x0004) [0x0000000000000000]              
	struct FVector                                     IntermediatePoint;                                		// 0x0344 (0x000C) [0x0000000000000000]              
	struct FVector                                     SearchExtent;                                     		// 0x0350 (0x000C) [0x0000000000000000]              
	class UClass*                                      NavigationHandleClass;                            		// 0x035C (0x0008) [0x0000000000000000]              
	class UNavigationHandle*                           NavigationHandle;                                 		// 0x0364 (0x0008) [0x0000000000000000]              
	int                                                ObstacleCheckCount;                               		// 0x036C (0x0004) [0x0000000000000000]              
	float                                              WalkableFloorZ;                                   		// 0x0370 (0x0004) [0x0000000000000000]              
	float                                              LastPathingAttempt;                               		// 0x0374 (0x0004) [0x0000000000000000]              
	float                                              LastUpdateTime;                                   		// 0x0378 (0x0004) [0x0000000000000000]              
	float                                              NotVisibleLifeSpan;                               		// 0x037C (0x0004) [0x0000000000000000]              
	class AGameCrowdAgent*                             MyArchetype;                                      		// 0x0380 (0x0008) [0x0000000000000000]              
	float                                              MaxWalkingSpeed;                                  		// 0x0388 (0x0004) [0x0000000000000000]              
	float                                              MaxRunningSpeed;                                  		// 0x038C (0x0004) [0x0000000000000000]              
	float                                              MaxSpeed;                                         		// 0x0390 (0x0004) [0x0000000000000000]              
	TArray< struct FRecentInteraction >                RecentInteractions;                               		// 0x0394 (0x0010) [0x0000000000000000]              
	float                                              BeaconMaxDist;                                    		// 0x03A4 (0x0004) [0x0000000000000000]              
	struct FVector                                     BeaconOffset;                                     		// 0x03A8 (0x000C) [0x0000000000000000]              
	class UTexture2D*                                  BeaconTexture;                                    		// 0x03B4 (0x0008) [0x0000000000000000]              
	struct FLinearColor                                BeaconColor;                                      		// 0x03BC (0x0010) [0x0000000000000000]              
	class USoundCue*                                   AmbientSoundCue;                                  		// 0x03CC (0x0008) [0x0000000000000000]              
	class UAudioComponent*                             AmbientSoundComponent;                            		// 0x03D4 (0x0008) [0x0000000000000000]              
	class UGameCrowdAgentBehavior*                     CurrentBehavior;                                  		// 0x03DC (0x0008) [0x0000000000000000]              
	float                                              CurrentBehaviorActivationTime;                    		// 0x03E4 (0x0004) [0x0000000000000000]              
	TArray< struct FBehaviorEntry >                    EncounterAgentBehaviors;                          		// 0x03E8 (0x0010) [0x0000000000000000]              
	TArray< struct FBehaviorEntry >                    SeePlayerBehaviors;                               		// 0x03F8 (0x0010) [0x0000000000000000]              
	float                                              MaxSeePlayerDistSq;                               		// 0x0408 (0x0004) [0x0000000000000000]              
	float                                              SeePlayerInterval;                                		// 0x040C (0x0004) [0x0000000000000000]              
	TArray< struct FBehaviorEntry >                    SpawnBehaviors;                                   		// 0x0410 (0x0010) [0x0000000000000000]              
	TArray< struct FBehaviorEntry >                    UneasyBehaviors;                                  		// 0x0420 (0x0010) [0x0000000000000000]              
	TArray< struct FBehaviorEntry >                    AlertBehaviors;                                   		// 0x0430 (0x0010) [0x0000000000000000]              
	TArray< struct FBehaviorEntry >                    PanicBehaviors;                                   		// 0x0440 (0x0010) [0x0000000000000000]              
	TArray< struct FBehaviorEntry >                    RandomBehaviors;                                  		// 0x0450 (0x0010) [0x0000000000000000]              
	TArray< struct FBehaviorEntry >                    TakeDamageBehaviors;                              		// 0x0460 (0x0010) [0x0000000000000000]              
	float                                              RandomBehaviorInterval;                           		// 0x0470 (0x0004) [0x0000000000000000]              
	float                                              ForceUpdateTime;                                  		// 0x0474 (0x0004) [0x0000000000000000]              
	float                                              ReachThreshold;                                   		// 0x0478 (0x0004) [0x0000000000000000]              
	TArray< struct FBehaviorEntry >                    GroupWaitingBehaviors;                            		// 0x047C (0x0010) [0x0000000000000000]              
	float                                              DesiredGroupRadius;                               		// 0x048C (0x0004) [0x0000000000000000]              
	float                                              DesiredGroupRadiusSq;                             		// 0x0490 (0x0004) [0x0000000000000000]              
	float                                              MaxLOSLifeDistanceSq;                             		// 0x0494 (0x0004) [0x0000000000000000]              
	class UGameCrowdSpawnerInterface*                  MySpawner;                                        		// 0x0498 (0x0010) [0x0000000000000000]              
	unsigned char                                      UnknownData00[ 0x8 ];                             		// 0x04A0 (0x0008) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FVector                                     SpawnOffset;                                      		// 0x04A8 (0x000C) [0x0000000000000000]              
	float                                              InitialLastRenderTime;                            		// 0x04B4 (0x0004) [0x0000000000000000]              
	struct FColor                                      DebugAgentColor;                                  		// 0x04B8 (0x0004) [0x0000000000000000]              
	class AGameCrowdDestination*                       DebugSpawnDest;                                   		// 0x04BC (0x0008) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2881 ];

		return pClassPointer;
	};

	void InitDebugColor ( );
	void GetBehaviorString ( );
	void GetDestString ( );
	void eventPostRenderFor ( );
	void NativePostRenderFor ( );
	void eventGeneratePathToActor ( );
	void eventInitNavigationHandle ( );
	void eventOverlappedActorEvent ( );
	void TakeDamage ( );
	void eventFireDeathEvent ( );
	void PlayDeath ( );
	void eventUpdateIntermediatePoint ( );
	void CalcCamera ( );
	void IsIdle ( );
	void SetCurrentBehavior ( );
	void eventStopBehavior ( );
	void eventHandleBehaviorEvent ( );
	void ActivateInstancedBehavior ( );
	void eventActivateBehavior ( );
	void ResetSeePlayer ( );
	void TryRandomBehavior ( );
	void eventNotifySeePlayer ( );
	void PlaySpawnBehavior ( );
	void eventHandlePotentialAgentEncounter ( );
	void eventStopIdleAnimation ( );
	void eventPlayIdleAnimation ( );
	void OnPlayAgentAnimation ( );
	void InitializeAgent ( );
	void GetAttemptedSpawnLocation ( );
	void SetLighting ( );
	void DisplayDebug ( );
	void Destroyed ( );
	void ResetPooledAgent ( );
	void eventKillAgent ( );
	void PostBeginPlay ( );
	void SetMaxSpeed ( );
	void eventSetCurrentDestination ( );
	void eventWaitForGroupMembers ( );
	void PickBehaviorFrom ( );
	void IsPanicked ( );
	void eventFellOutOfWorld ( );
	void GetCollisionExtent ( );
};

UClass* AGameCrowdAgent::pClassPointer = NULL;

// Class GameFramework.GameCrowdAgentSkeletal
// 0x00B4 (0x0578 - 0x04C4)
class AGameCrowdAgentSkeletal : public AGameCrowdAgent
{
public:
	class USkeletalMeshComponent*                      SkeletalMeshComponent;                            		// 0x04C4 (0x0008) [0x0000000000000000]              
	class UAnimNodeBlend*                              SpeedBlendNode;                                   		// 0x04CC (0x0008) [0x0000000000000000]              
	class UAnimNodeSlot*                               FullBodySlot;                                     		// 0x04D4 (0x0008) [0x0000000000000000]              
	class UAnimNodeSequence*                           ActionSeqNode;                                    		// 0x04DC (0x0008) [0x0000000000000000]              
	class UAnimNodeSequence*                           WalkSeqNode;                                      		// 0x04E4 (0x0008) [0x0000000000000000]              
	class UAnimNodeSequence*                           RunSeqNode;                                       		// 0x04EC (0x0008) [0x0000000000000000]              
	class UAnimTree*                                   AgentTree;                                        		// 0x04F4 (0x0008) [0x0000000000000000]              
	TArray< struct FName >                             WalkAnimNames;                                    		// 0x04FC (0x0010) [0x0000000000000000]              
	TArray< struct FName >                             RunAnimNames;                                     		// 0x050C (0x0010) [0x0000000000000000]              
	TArray< struct FName >                             IdleAnimNames;                                    		// 0x051C (0x0010) [0x0000000000000000]              
	TArray< struct FName >                             DeathAnimNames;                                   		// 0x052C (0x0010) [0x0000000000000000]              
	float                                              SpeedBlendStart;                                  		// 0x053C (0x0004) [0x0000000000000000]              
	float                                              SpeedBlendEnd;                                    		// 0x0540 (0x0004) [0x0000000000000000]              
	float                                              AnimVelRate;                                      		// 0x0544 (0x0004) [0x0000000000000000]              
	float                                              MaxSpeedBlendChangeSpeed;                         		// 0x0548 (0x0004) [0x0000000000000000]              
	struct FName                                       MoveSyncGroupName;                                		// 0x054C (0x0008) [0x0000000000000000]              
	TArray< struct FGameCrowdAttachmentList >          Attachments;                                      		// 0x0554 (0x0010) [0x0000000000000000]              
	float                                              MaxTargetAcquireTime;                             		// 0x0564 (0x0004) [0x0000000000000000]              
	DWORD                                              bUseRootMotionVelocity : 1;                       		// 0x0568 (0x0004) [0x0000000000000000] [0x00000001] 
	DWORD                                              bAllowSkeletonUpdateChangeBasedOnTickResult : 1;  		// 0x0568 (0x0004) [0x0000000000000000] [0x00000002] 
	DWORD                                              bTickWhenNotVisible : 1;                          		// 0x0568 (0x0004) [0x0000000000000000] [0x00000004] 
	DWORD                                              bIsPlayingIdleAnimation : 1;                      		// 0x0568 (0x0004) [0x0000000000000000] [0x00000008] 
	DWORD                                              bIsPlayingDeathAnimation : 1;                     		// 0x0568 (0x0004) [0x0000000000000000] [0x00000010] 
	DWORD                                              bIsPlayingImportantAnimation : 1;                 		// 0x0568 (0x0004) [0x0000000000000000] [0x00000020] 
	DWORD                                              bAnimateThisTick : 1;                             		// 0x0568 (0x0004) [0x0000000000000000] [0x00000040] 
	float                                              NotVisibleDisableTickTime;                        		// 0x056C (0x0004) [0x0000000000000000]              
	float                                              MaxAnimationDistance;                             		// 0x0570 (0x0004) [0x0000000000000000]              
	float                                              MaxAnimationDistanceSq;                           		// 0x0574 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2883 ];

		return pClassPointer;
	};

	void CreateAttachments ( );
	void eventOnAnimEnd ( );
	void eventStopIdleAnimation ( );
	void eventPlayIdleAnimation ( );
	void eventClearLatentAnimation ( );
	void OnPlayAgentAnimation ( );
	void SetRootMotion ( );
	void PlayDeath ( );
	void SetLighting ( );
	void PostBeginPlay ( );
};

UClass* AGameCrowdAgentSkeletal::pClassPointer = NULL;

// Class GameFramework.GameCrowdAgentSM
// 0x0010 (0x04D4 - 0x04C4)
class AGameCrowdAgentSM : public AGameCrowdAgent
{
public:
	class UStaticMeshComponent*                        Mesh;                                             		// 0x04C4 (0x0008) [0x0000000000000000]              
	class UMaterialInstanceConstant*                   MeshColor;                                        		// 0x04CC (0x0008) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2885 ];

		return pClassPointer;
	};

	void StopBehavior ( );
	void ActivateBehavior ( );
	void ChangeDebugColor ( );
	void InitDebugColor ( );
	void PostBeginPlay ( );
};

UClass* AGameCrowdAgentSM::pClassPointer = NULL;

// Class GameFramework.GameCrowdAgentBehavior
// 0x003C (0x009C - 0x0060)
class UGameCrowdAgentBehavior : public UObject
{
public:
	unsigned char                                      MyEventType;                                      		// 0x0060 (0x0001) [0x0000000000000000]              
	unsigned char                                      ViralBehaviorEvent;                               		// 0x0061 (0x0001) [0x0000000000000000]              
	float                                              DurationOfBehavior;                               		// 0x0064 (0x0004) [0x0000000000000000]              
	float                                              TimeUntilStopBehavior;                            		// 0x0068 (0x0004) [0x0000000000000000]              
	DWORD                                              bIdleBehavior : 1;                                		// 0x006C (0x0004) [0x0000000000000000] [0x00000001] 
	DWORD                                              bFaceActionTargetFirst : 1;                       		// 0x006C (0x0004) [0x0000000000000000] [0x00000002] 
	DWORD                                              bIsViralBehavior : 1;                             		// 0x006C (0x0004) [0x0000000000000000] [0x00000004] 
	DWORD                                              bPassOnIsViralBehaviorFlag : 1;                   		// 0x006C (0x0004) [0x0000000000000000] [0x00000008] 
	class AActor*                                      ActionTarget;                                     		// 0x0070 (0x0008) [0x0000000000000000]              
	float                                              MaxPlayerDistance;                                		// 0x0078 (0x0004) [0x0000000000000000]              
	float                                              ViralRadius;                                      		// 0x007C (0x0004) [0x0000000000000000]              
	float                                              DurationBeforeBecomesViral;                       		// 0x0080 (0x0004) [0x0000000000000000]              
	float                                              TimeToBecomeViral;                                		// 0x0084 (0x0004) [0x0000000000000000]              
	float                                              DurationOfViralBehaviorPropagation;               		// 0x0088 (0x0004) [0x0000000000000000]              
	float                                              TimeToStopPropagatingViralBehavior;               		// 0x008C (0x0004) [0x0000000000000000]              
	class AGameCrowdAgent*                             MyAgent;                                          		// 0x0090 (0x0008) [0x0000000000000000]              
	struct FColor                                      DebugBehaviorColor;                               		// 0x0098 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2887 ];

		return pClassPointer;
	};

	void AllowBehaviorAt ( );
	void AllowThisDestination ( );
	void eventPropagateViralBehaviorTo ( );
	void GetBehaviorInstigator ( );
	void ActivatedBy ( );
	void GetDestinationActor ( );
	void ChangingDestination ( );
	void GetBehaviorString ( );
	void eventOnAnimEnd ( );
	void StopBehavior ( );
	void InitBehavior ( );
	void HandleMovement ( );
	void eventFinishedTargetRotation ( );
	void CanBeUsedBy ( );
	void eventTick ( );
	void ShouldEndIdle ( );
	void TriggerCrowdBehavior ( );
};

UClass* UGameCrowdAgentBehavior::pClassPointer = NULL;

// Class GameFramework.GameCrowdBehavior_PlayAnimation
// 0x0038 (0x00D4 - 0x009C)
class UGameCrowdBehavior_PlayAnimation : public UGameCrowdAgentBehavior
{
public:
	TArray< struct FName >                             AnimationList;                                    		// 0x009C (0x0010) [0x0000000000000000]              
	float                                              BlendInTime;                                      		// 0x00AC (0x0004) [0x0000000000000000]              
	float                                              BlendOutTime;                                     		// 0x00B0 (0x0004) [0x0000000000000000]              
	DWORD                                              bUseRootMotion : 1;                               		// 0x00B4 (0x0004) [0x0000000000000000] [0x00000001] 
	DWORD                                              bLookAtPlayer : 1;                                		// 0x00B4 (0x0004) [0x0000000000000000] [0x00000002] 
	DWORD                                              bLooping : 1;                                     		// 0x00B4 (0x0004) [0x0000000000000000] [0x00000004] 
	DWORD                                              bBlendBetweenAnims : 1;                           		// 0x00B4 (0x0004) [0x0000000000000000] [0x00000008] 
	class AActor*                                      CustomActionTarget;                               		// 0x00B8 (0x0008) [0x0000000000000000]              
	int                                                LoopIndex;                                        		// 0x00C0 (0x0004) [0x0000000000000000]              
	float                                              LoopTime;                                         		// 0x00C4 (0x0004) [0x0000000000000000]              
	class USeqAct_PlayAgentAnimation*                  AnimSequence;                                     		// 0x00C8 (0x0008) [0x0000000000000000]              
	int                                                AnimationIndex;                                   		// 0x00D0 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2889 ];

		return pClassPointer;
	};

	void GetBehaviorString ( );
	void StopBehavior ( );
	void PlayAgentAnimationNow ( );
	void eventOnAnimEnd ( );
	void SetSequenceOutput ( );
	void eventFinishedTargetRotation ( );
	void InitBehavior ( );
};

UClass* UGameCrowdBehavior_PlayAnimation::pClassPointer = NULL;

// Class GameFramework.GameCrowdBehavior_RunFromPanic
// 0x0008 (0x00A4 - 0x009C)
class UGameCrowdBehavior_RunFromPanic : public UGameCrowdAgentBehavior
{
public:
	class AActor*                                      PanicFocus;                                       		// 0x009C (0x0008) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2891 ];

		return pClassPointer;
	};

	void GetBehaviorString ( );
	void AllowBehaviorAt ( );
	void AllowThisDestination ( );
	void GetBehaviorInstigator ( );
	void StopBehavior ( );
	void InitBehavior ( );
	void ActivatedBy ( );
};

UClass* UGameCrowdBehavior_RunFromPanic::pClassPointer = NULL;

// Class GameFramework.GameCrowdBehavior_WaitForGroup
// 0x0000 (0x009C - 0x009C)
class UGameCrowdBehavior_WaitForGroup : public UGameCrowdAgentBehavior
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2893 ];

		return pClassPointer;
	};

	void StopBehavior ( );
	void ShouldEndIdle ( );
	void GetBehaviorString ( );
	void InitBehavior ( );
};

UClass* UGameCrowdBehavior_WaitForGroup::pClassPointer = NULL;

// Class GameFramework.GameCrowdBehavior_WaitInQueue
// 0x000C (0x00A8 - 0x009C)
class UGameCrowdBehavior_WaitInQueue : public UGameCrowdAgentBehavior
{
public:
	DWORD                                              bStoppingBehavior : 1;                            		// 0x009C (0x0004) [0x0000000000000000] [0x00000001] 
	class AGameCrowdDestinationQueuePoint*             QueuePosition;                                    		// 0x00A0 (0x0008) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2895 ];

		return pClassPointer;
	};

	void StopBehavior ( );
	void ShouldEndIdle ( );
	void GetBehaviorString ( );
	void GetDestinationActor ( );
	void ChangingDestination ( );
	void HandleMovement ( );
};

UClass* UGameCrowdBehavior_WaitInQueue::pClassPointer = NULL;

// Class GameFramework.GameCrowdGroup
// 0x0010 (0x0070 - 0x0060)
class UGameCrowdGroup : public UObject
{
public:
	TArray< class AGameCrowdAgent* >                   Members;                                          		// 0x0060 (0x0010) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2897 ];

		return pClassPointer;
	};

	void UpdateDestinations ( );
	void RemoveMember ( );
	void AddMember ( );
};

UClass* UGameCrowdGroup::pClassPointer = NULL;

// Class GameFramework.GameCrowdInfoVolume
// 0x0010 (0x0290 - 0x0280)
class AGameCrowdInfoVolume : public AVolume
{
public:
	TArray< class AGameCrowdDestination* >             PotentialSpawnPoints;                             		// 0x0280 (0x0010) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2899 ];

		return pClassPointer;
	};

	void UnTouch ( );
	void Touch ( );
};

UClass* AGameCrowdInfoVolume::pClassPointer = NULL;

// Class GameFramework.GameCrowdInteractionPoint
// 0x000C (0x0250 - 0x0244)
class AGameCrowdInteractionPoint : public AActor
{
public:
	DWORD                                              bIsEnabled : 1;                                   		// 0x0244 (0x0004) [0x0000000000150000] [0x00000001] ( CPF_Travel | CPF_GlobalConfig )
	class UCylinderComponent*                          CylinderComponent;                                		// 0x0248 (0x0008) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2901 ];

		return pClassPointer;
	};

	void OnToggle ( );
};

UClass* AGameCrowdInteractionPoint::pClassPointer = NULL;

// Class GameFramework.GameCrowdBehaviorPoint
// 0x0018 (0x0268 - 0x0250)
class AGameCrowdBehaviorPoint : public AGameCrowdInteractionPoint
{
public:
	float                                              RadiusOfBehaviorEvent;                            		// 0x0250 (0x0004) [0x0000000000000000]              
	float                                              DurationOfBehaviorEvent;                          		// 0x0254 (0x0004) [0x0000000000000000]              
	unsigned char                                      EventType;                                        		// 0x0258 (0x0001) [0x0000000000000000]              
	DWORD                                              bRequireLOS : 1;                                  		// 0x025C (0x0004) [0x0000000000000000] [0x00000001] 
	class AActor*                                      Initiator;                                        		// 0x0260 (0x0008) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2903 ];

		return pClassPointer;
	};

	void eventTouch ( );
	void DestroySelf ( );
	void eventPostBeginPlay ( );
};

UClass* AGameCrowdBehaviorPoint::pClassPointer = NULL;

// Class GameFramework.GameCrowdDestination
// 0x00A8 (0x02F8 - 0x0250)
class AGameCrowdDestination : public AGameCrowdInteractionPoint
{
public:
	struct FPointer                                    VfTable_IEditorLinkSelectionInterface;            		// 0x0250 (0x0008) [0x0000000000000000]              
	DWORD                                              bKillWhenReached : 1;                             		// 0x0258 (0x0004) [0x0000000000000000] [0x00000001] 
	DWORD                                              bAllowAsPreviousDestination : 1;                  		// 0x0258 (0x0004) [0x0000000000000000] [0x00000002] 
	DWORD                                              bAvoidWhenPanicked : 1;                           		// 0x0258 (0x0004) [0x0000000000000000] [0x00000004] 
	DWORD                                              bSkipBehaviorIfPanicked : 1;                      		// 0x0258 (0x0004) [0x0000000000000000] [0x00000008] 
	DWORD                                              bFleeDestination : 1;                             		// 0x0258 (0x0004) [0x0000000000000000] [0x00000010] 
	DWORD                                              bMustReachExactly : 1;                            		// 0x0258 (0x0004) [0x0000000000000000] [0x00000020] 
	DWORD                                              bHasRestrictions : 1;                             		// 0x0258 (0x0004) [0x0000000000000000] [0x00000040] 
	DWORD                                              bAllowsSpawning : 1;                              		// 0x0258 (0x0004) [0x0000000000000000] [0x00000080] 
	DWORD                                              bAllowCloudSpawning : 1;                          		// 0x0258 (0x0004) [0x0000000000000000] [0x00000100] 
	DWORD                                              bAllowVisibleSpawning : 1;                        		// 0x0258 (0x0004) [0x0000000000000000] [0x00000200] 
	DWORD                                              bLineSpawner : 1;                                 		// 0x0258 (0x0004) [0x0000000000000000] [0x00000400] 
	DWORD                                              bSpawnAtEdge : 1;                                 		// 0x0258 (0x0004) [0x0000000000000000] [0x00000800] 
	DWORD                                              bSoftPerimeter : 1;                               		// 0x0258 (0x0004) [0x0000000000000000] [0x00001000] 
	DWORD                                              bIsVisible : 1;                                   		// 0x0258 (0x0004) [0x0000000000000000] [0x00002000] 
	DWORD                                              bWillBeVisible : 1;                               		// 0x0258 (0x0004) [0x0000000000000000] [0x00004000] 
	DWORD                                              bCanSpawnHereNow : 1;                             		// 0x0258 (0x0004) [0x0000000000000000] [0x00008000] 
	DWORD                                              bIsBeyondSpawnDistance : 1;                       		// 0x0258 (0x0004) [0x0000000000000000] [0x00010000] 
	DWORD                                              bAdjacentToVisibleNode : 1;                       		// 0x0258 (0x0004) [0x0000000000000000] [0x00020000] 
	DWORD                                              bHasNavigationMesh : 1;                           		// 0x0258 (0x0004) [0x0000000000000000] [0x00040000] 
	TArray< class AGameCrowdDestination* >             NextDestinations;                                 		// 0x025C (0x0010) [0x0000000000000000]              
	class AGameCrowdDestinationQueuePoint*             QueueHead;                                        		// 0x026C (0x0008) [0x0000000000000000]              
	int                                                Capacity;                                         		// 0x0274 (0x0004) [0x0000000000000000]              
	float                                              Frequency;                                        		// 0x0278 (0x0004) [0x0000000000000000]              
	int                                                CustomerCount;                                    		// 0x027C (0x0004) [0x0000000000000000]              
	TArray< class UClass* >                            SupportedAgentClasses;                            		// 0x0280 (0x0010) [0x0000000000000000]              
	TArray< class UObject* >                           SupportedArchetypes;                              		// 0x0290 (0x0010) [0x0000000000000000]              
	TArray< class UClass* >                            RestrictedAgentClasses;                           		// 0x02A0 (0x0010) [0x0000000000000000]              
	TArray< class UObject* >                           RestrictedArchetypes;                             		// 0x02B0 (0x0010) [0x0000000000000000]              
	float                                              ExactReachTolerance;                              		// 0x02C0 (0x0004) [0x0000000000000000]              
	struct FName                                       InteractionTag;                                   		// 0x02C4 (0x0008) [0x0000000000000000]              
	float                                              InteractionDelay;                                 		// 0x02CC (0x0004) [0x0000000000000000]              
	TArray< struct FBehaviorEntry >                    ReachedBehaviors;                                 		// 0x02D0 (0x0010) [0x0000000000000000]              
	class AGameCrowdAgent*                             AgentEnRoute;                                     		// 0x02E0 (0x0008) [0x0000000000000000]              
	float                                              Priority;                                         		// 0x02E8 (0x0004) [0x0000000000000000]              
	float                                              LastSpawnTime;                                    		// 0x02EC (0x0004) [0x0000000000000000]              
	class AGameCrowdPopulationManager*                 MyPopMgr;                                         		// 0x02F0 (0x0008) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2905 ];

		return pClassPointer;
	};

	void DrawDebug ( );
	void GetDestinationRadius ( );
	void PrioritizeSpawnPoint ( );
	void AnalyzeSpawnPoint ( );
	void GetSpawnPosition ( );
	void GetSpawnRadius ( );
	void eventAllowableDestinationFor ( );
	void AtCapacity ( );
	void eventIncrementCustomerCount ( );
	void eventDecrementCustomerCount ( );
	void PickNewDestinationFor ( );
	void eventReachedDestination ( );
	void Destroyed ( );
	void PostBeginPlay ( );
	void ReachedByAgent ( );
};

UClass* AGameCrowdDestination::pClassPointer = NULL;

// Class GameFramework.GameCrowdDestinationQueuePoint
// 0x0030 (0x0280 - 0x0250)
class AGameCrowdDestinationQueuePoint : public AGameCrowdInteractionPoint
{
public:
	class AGameCrowdDestinationQueuePoint*             NextQueuePosition;                                		// 0x0250 (0x0008) [0x0000000000000000]              
	class AGameCrowdInteractionPoint*                  PreviousQueuePosition;                            		// 0x0258 (0x0008) [0x0000000000000000]              
	class AGameCrowdAgent*                             QueuedAgent;                                      		// 0x0260 (0x0008) [0x0000000000000000]              
	class AGameCrowdDestination*                       QueueDestination;                                 		// 0x0268 (0x0008) [0x0000000000000000]              
	DWORD                                              bClearingQueue : 1;                               		// 0x0270 (0x0004) [0x0000000000000000] [0x00000001] 
	DWORD                                              bPendingAdvance : 1;                              		// 0x0270 (0x0004) [0x0000000000000000] [0x00000002] 
	float                                              AverageReactionTime;                              		// 0x0274 (0x0004) [0x0000000000000000]              
