/*
#############################################################################################
# Killing Floor 2 (1.8787) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: GameFramework_f_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function GameFramework.GameAIController.GetActionString
// [0x00020903] ( FUNC_Final | FUNC_Event )
struct AGameAIController_eventGetActionString_Parms
{
	// struct FString                                  ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000000000]              
	// struct FString                                  ActionStr;                                        		// 0x0010 (0x0010) [0x0000000000000000]              
	// class UGameAICommand*                           ActiveCmd;                                        		// 0x0020 (0x0008) [0x0000000000000000]              
};

// Function GameFramework.GameAIController.SetDesiredRotation
// [0x00024002] 
struct AGameAIController_execSetDesiredRotation_Parms
{
	// struct FRotator                                 TargetDesiredRotation;                            		// 0x0000 (0x000C) [0x0000000000000000]              
	// DWORD                                           InLockDesiredRotation : 1;                        		// 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           InUnlockWhenReached : 1;                          		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
	// float                                           InterpolationTime;                                		// 0x0014 (0x0004) [0x0000000000000000]              
};

// Function GameFramework.GameAIController.AILog_Internal
// [0x00024802] ( FUNC_Event )
struct AGameAIController_eventAILog_Internal_Parms
{
	// struct FString                                  LogText;                                          		// 0x0000 (0x0010) [0x0000000000000000]              
	// struct FName                                    LogCategory;                                      		// 0x0010 (0x0008) [0x0000000000000000]              
	// DWORD                                           bForce : 1;                                       		// 0x0018 (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           BugIt : 1;                                        		// 0x001C (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           bSkipExtraInfo : 1;                               		// 0x0020 (0x0004) [0x0000000000000000] [0x00000001] 
	// int                                             Idx;                                              		// 0x0024 (0x0004) [0x0000000000000000]              
	// struct FString                                  ActionStr;                                        		// 0x0028 (0x0010) [0x0000000000000000]              
	// struct FString                                  FinalStr;                                         		// 0x0038 (0x0010) [0x0000000000000000]              
	// struct FString                                  Filename;                                         		// 0x0048 (0x0010) [0x0000000000000000]              
	// class UGameAICommand*                           ActiveCommand;                                    		// 0x0058 (0x0008) [0x0000000000000000]              
	// int                                             FileNameLength;                                   		// 0x0060 (0x0004) [0x0000000000000000]              
	// class UEngine*                                  Eng;                                              		// 0x0064 (0x0008) [0x0000000000000000]              
};

// Function GameFramework.GameAIController.RecordDemoAILog
// [0x00080000] 
struct AGameAIController_execRecordDemoAILog_Parms
{
	// struct FString                                  LogText;                                          		// 0x0000 (0x0010) [0x0000000000000000]              
};

// Function GameFramework.GameAIController.Destroyed
// [0x00020802] ( FUNC_Event )
struct AGameAIController_eventDestroyed_Parms
{
};

// Function GameFramework.GameAIController.ReachedIntermediateMoveGoal
// [0x00020000] 
struct AGameAIController_execReachedIntermediateMoveGoal_Parms
{
};

// Function GameFramework.GameAIController.ReachedMoveGoal
// [0x00020000] 
struct AGameAIController_execReachedMoveGoal_Parms
{
};

// Function GameFramework.GameAIController.GetDestinationOffset
// [0x00020000] 
struct AGameAIController_execGetDestinationOffset_Parms
{
	// float                                           ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function GameFramework.GameAIController.GetAICommandInStack
// [0x00020400] ( FUNC_Native )
struct AGameAIController_execGetAICommandInStack_Parms
{
	// class UClass*                                   InClass;                                          		// 0x0000 (0x0008) [0x0000000000000000]              
	// class UGameAICommand*                           ReturnValue;                                      		// 0x0008 (0x0008) [0x0000000000000000]              
};

// Function GameFramework.GameAIController.FindCommandOfClass
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct AGameAIController_execFindCommandOfClass_Parms
{
	// class UClass*                                   SearchClass;                                      		// 0x0000 (0x0008) [0x0000000000000000]              
	// class UGameAICommand*                           ReturnValue;                                      		// 0x0008 (0x0008) [0x0000000000000000]              
};

// Function GameFramework.GameAIController.DumpCommandStack
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct AGameAIController_execDumpCommandStack_Parms
{
};

// Function GameFramework.GameAIController.CheckCommandCount
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct AGameAIController_execCheckCommandCount_Parms
{
};

// Function GameFramework.GameAIController.GetActiveCommand
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct AGameAIController_execGetActiveCommand_Parms
{
	// class UGameAICommand*                           ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function GameFramework.GameAIController.AbortCommand
// [0x00024400] ( FUNC_Native )
struct AGameAIController_execAbortCommand_Parms
{
	// class UGameAICommand*                           AbortCmd;                                         		// 0x0000 (0x0008) [0x0000000000000000]              
	// class UClass*                                   AbortClass;                                       		// 0x0008 (0x0008) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function GameFramework.GameAIController.PopCommand
// [0x00020400] ( FUNC_Native )
struct AGameAIController_execPopCommand_Parms
{
	// class UGameAICommand*                           ToBePoppedCommand;                                		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function GameFramework.GameAIController.PushCommand
// [0x00020400] ( FUNC_Native )
struct AGameAIController_execPushCommand_Parms
{
	// class UGameAICommand*                           NewCommand;                                       		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function GameFramework.GameAIController.AllCommands
// [0x00420405] ( FUNC_Final | FUNC_Native )
struct AGameAIController_execAllCommands_Parms
{
	// class UClass*                                   BaseClass;                                        		// 0x0000 (0x0008) [0x0000000000000000]              
	// class UGameAICommand*                           Cmd;                                              		// 0x0008 (0x0008) [0x0000000000000000]              
};

// Function GameFramework.GamePawn.ReattachMeshWithoutBeingSeen
// [0x00020102] 
struct AGamePawn_execReattachMeshWithoutBeingSeen_Parms
{
};

// Function GameFramework.GamePawn.ReattachMesh
// [0x00020102] 
struct AGamePawn_execReattachMesh_Parms
{
};

// Function GameFramework.GamePawn.UpdateShadowSettings
// [0x00020902] ( FUNC_Event )
struct AGamePawn_eventUpdateShadowSettings_Parms
{
	// DWORD                                           bInWantShadow : 1;                                		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           bNewCastShadow : 1;                               		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           bNewCastDynamicShadow : 1;                        		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function GameFramework.GameAICommand.HandlePathObstruction
// [0x00020002] 
struct UGameAICommand_execHandlePathObstruction_Parms
{
	// class AActor*                                   BlockedBy;                                        		// 0x0000 (0x0008) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function GameFramework.GameAICommand.MoveUnreachable
// [0x00020000] 
struct UGameAICommand_execMoveUnreachable_Parms
{
	// struct FVector                                  AttemptedDest;                                    		// 0x0000 (0x000C) [0x0000000000000000]              
	// class AActor*                                   AttemptedTarget;                                  		// 0x000C (0x0008) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function GameFramework.GameAICommand.NotifyNeedRepath
// [0x00020000] 
struct UGameAICommand_execNotifyNeedRepath_Parms
{
};

// Function GameFramework.GameAICommand.GetDebugVerboseText
// [0x00020800] ( FUNC_Event )
struct UGameAICommand_eventGetDebugVerboseText_Parms
{
	// struct FString                                  ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000000000]              
};

// Function GameFramework.GameAICommand.GetDebugOverheadText
// [0x00420000] 
struct UGameAICommand_execGetDebugOverheadText_Parms
{
	// class APlayerController*                        PC;                                               		// 0x0000 (0x0008) [0x0000000000000000]              
	// TArray< struct FString >                        OutText;                                          		// 0x0008 (0x0010) [0x0000000000000000]              
};

// Function GameFramework.GameAICommand.DrawDebug
// [0x00020800] ( FUNC_Event )
struct UGameAICommand_eventDrawDebug_Parms
{
	// class AHUD*                                     H;                                                		// 0x0000 (0x0008) [0x0000000000000000]              
	// struct FName                                    Category;                                         		// 0x0008 (0x0008) [0x0000000000000000]              
};

// Function GameFramework.GameAICommand.GetDumpString
// [0x00020802] ( FUNC_Event )
struct UGameAICommand_eventGetDumpString_Parms
{
	// struct FString                                  ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000000000]              
};

// Function GameFramework.GameAICommand.Resumed
// [0x00020002] 
struct UGameAICommand_execResumed_Parms
{
	// struct FName                                    OldCommandName;                                   		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function GameFramework.GameAICommand.Paused
// [0x00020002] 
struct UGameAICommand_execPaused_Parms
{
	// class UGameAICommand*                           NewCommand;                                       		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function GameFramework.GameAICommand.Popped
// [0x00020002] 
struct UGameAICommand_execPopped_Parms
{
};

// Function GameFramework.GameAICommand.Pushed
// [0x00020002] 
struct UGameAICommand_execPushed_Parms
{
};

// Function GameFramework.GameAICommand.PostPopped
// [0x00020000] 
struct UGameAICommand_execPostPopped_Parms
{
};

// Function GameFramework.GameAICommand.PrePushed
// [0x00020000] 
struct UGameAICommand_execPrePushed_Parms
{
	// class AGameAIController*                        AI;                                               		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function GameFramework.GameAICommand.AllowStateTransitionTo
// [0x00020002] 
struct UGameAICommand_execAllowStateTransitionTo_Parms
{
	// struct FName                                    StateName;                                        		// 0x0000 (0x0008) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function GameFramework.GameAICommand.AllowTransitionTo
// [0x00020002] 
struct UGameAICommand_execAllowTransitionTo_Parms
{
	// class UClass*                                   AttemptCommand;                                   		// 0x0000 (0x0008) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function GameFramework.GameAICommand.Tick
// [0x00020000] 
struct UGameAICommand_execTick_Parms
{
	// float                                           DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function GameFramework.GameAICommand.ShouldIgnoreNotifies
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UGameAICommand_execShouldIgnoreNotifies_Parms
{
	// DWORD                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function GameFramework.GameAICommand.InternalTick
// [0x00020803] ( FUNC_Final | FUNC_Event )
struct UGameAICommand_eventInternalTick_Parms
{
	// float                                           DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function GameFramework.GameAICommand.InternalResumed
// [0x00020803] ( FUNC_Final | FUNC_Event )
struct UGameAICommand_eventInternalResumed_Parms
{
	// struct FName                                    OldCommandName;                                   		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function GameFramework.GameAICommand.InternalPaused
// [0x00020803] ( FUNC_Final | FUNC_Event )
struct UGameAICommand_eventInternalPaused_Parms
{
	// class UGameAICommand*                           NewCommand;                                       		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function GameFramework.GameAICommand.InternalPopped
// [0x00020802] ( FUNC_Event )
struct UGameAICommand_eventInternalPopped_Parms
{
};

// Function GameFramework.GameAICommand.InternalPushed
// [0x00020803] ( FUNC_Final | FUNC_Event )
struct UGameAICommand_eventInternalPushed_Parms
{
};

// Function GameFramework.GameAICommand.InternalPrePushed
// [0x00020803] ( FUNC_Final | FUNC_Event )
struct UGameAICommand_eventInternalPrePushed_Parms
{
	// class AGameAIController*                        AI;                                               		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function GameFramework.GameAICommand.InitCommand
// [0x00022002] 
struct UGameAICommand_execInitCommand_Parms
{
	// class AGameAIController*                        AI;                                               		// 0x0000 (0x0008) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	// class UGameAICommand*                           Cmd;                                              		// 0x000C (0x0008) [0x0000000000000000]              
};

// Function GameFramework.GameAICommand.InitCommandUserActor
// [0x00022002] 
struct UGameAICommand_execInitCommandUserActor_Parms
{
	// class AGameAIController*                        AI;                                               		// 0x0000 (0x0008) [0x0000000000000000]              
	// class AActor*                                   UserActor;                                        		// 0x0008 (0x0008) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function GameFramework.GamePlayerController.ClientColorFade
// [0x010201C0] 
struct AGamePlayerController_execClientColorFade_Parms
{
	// struct FColor                                   FadeColor;                                        		// 0x0000 (0x0004) [0x0000000000000000]              
	// unsigned char                                   FromAlpha;                                        		// 0x0004 (0x0001) [0x0000000000000000]              
	// unsigned char                                   ToAlpha;                                          		// 0x0005 (0x0001) [0x0000000000000000]              
	// float                                           FadeTime;                                         		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function GameFramework.GamePlayerController.WarmupPause
// [0x00820802] ( FUNC_Event )
struct AGamePlayerController_eventWarmupPause_Parms
{
	// DWORD                                           bDesiredPauseState : 1;                           		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// struct FColor                                   FadeColor;                                        		// 0x0004 (0x0004) [0x0000000000000000]              
	// class APlayerController*                        PC;                                               		// 0x0008 (0x0008) [0x0000000000000000]              
	// struct FString                                  MovieName;                                        		// 0x0010 (0x0010) [0x0000000000000000]              
};

// Function GameFramework.GamePlayerController.CanUnpauseWarmup
// [0x00020002] 
struct AGamePlayerController_execCanUnpauseWarmup_Parms
{
	// DWORD                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function GameFramework.GamePlayerController.GetCurrentMovie
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct AGamePlayerController_execGetCurrentMovie_Parms
{
	// struct FString                                  MovieName;                                        		// 0x0000 (0x0010) [0x0000000000000000]              
};

// Function GameFramework.GamePlayerController.ClientStopMovie
// [0x01020DC1] ( FUNC_Final | FUNC_Event | FUNC_Native )
struct AGamePlayerController_eventClientStopMovie_Parms
{
	// float                                           DelayInSeconds;                                   		// 0x0000 (0x0004) [0x0000000000000000]              
	// DWORD                                           bAllowMovieToFinish : 1;                          		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           bForceStopNonSkippable : 1;                       		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           bForceStopLoadingMovie : 1;                       		// 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function GameFramework.GamePlayerController.ClientPlayMovie
// [0x01020DC1] ( FUNC_Final | FUNC_Event | FUNC_Native )
struct AGamePlayerController_eventClientPlayMovie_Parms
{
	// struct FString                                  MovieName;                                        		// 0x0000 (0x0010) [0x0000000000000000]              
	// int                                             InStartOfRenderingMovieFrame;                     		// 0x0010 (0x0004) [0x0000000000000000]              
	// int                                             InEndOfRenderingMovieFrame;                       		// 0x0014 (0x0004) [0x0000000000000000]              
	// DWORD                                           bRestrictPausing : 1;                             		// 0x0018 (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           bPlayOnceFromStream : 1;                          		// 0x001C (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           bOnlyBackButtonSkipsMovie : 1;                    		// 0x0020 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function GameFramework.GamePlayerController.KeepPlayingLoadingMovie
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct AGamePlayerController_execKeepPlayingLoadingMovie_Parms
{
};

// Function GameFramework.GamePlayerController.ShowLoadingMovie
// [0x00026401] ( FUNC_Final | FUNC_Native )
struct AGamePlayerController_execShowLoadingMovie_Parms
{
	// DWORD                                           bShowMovie : 1;                                   		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           bPauseAfterHide : 1;                              		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	// float                                           PauseDuration;                                    		// 0x0008 (0x0004) [0x0000000000000000]              
	// float                                           KeepPlayingDuration;                              		// 0x000C (0x0004) [0x0000000000000000]              
	// DWORD                                           bOverridePreviousDelays : 1;                      		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function GameFramework.GamePlayerController.SetSoundMode
// [0x00020102] 
struct AGamePlayerController_execSetSoundMode_Parms
{
	// struct FName                                    InSoundModeName;                                  		// 0x0000 (0x0008) [0x0000000000000000]              
	// class UAudioDevice*                             Audio;                                            		// 0x0008 (0x0008) [0x0000000000000000]              
	// DWORD                                           bSet : 1;                                         		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function GameFramework.GamePlayerController.DoForceFeedbackForScreenShake
// [0x00080102] 
struct AGamePlayerController_execDoForceFeedbackForScreenShake_Parms
{
	// class UCameraShake*                             ShakeData;                                        		// 0x0000 (0x0008) [0x0000000000000000]              
	// float                                           Scale;                                            		// 0x0008 (0x0004) [0x0000000000000000]              
	// int                                             ShakeLevel;                                       		// 0x000C (0x0004) [0x0000000000000000]              
	// float                                           RotMag;                                           		// 0x0010 (0x0004) [0x0000000000000000]              
	// float                                           LocMag;                                           		// 0x0014 (0x0004) [0x0000000000000000]              
	// float                                           FOVMag;                                           		// 0x0018 (0x0004) [0x0000000000000000]              
};

// Function GameFramework.GamePlayerController.NotifyCrowdAgentInRadius
// [0x00020800] ( FUNC_Event )
struct AGamePlayerController_eventNotifyCrowdAgentInRadius_Parms
{
	// class AGameCrowdAgent*                          Agent;                                            		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function GameFramework.GamePlayerController.NotifyCrowdAgentRefresh
// [0x00020800] ( FUNC_Event )
struct AGamePlayerController_eventNotifyCrowdAgentRefresh_Parms
{
};

// Function GameFramework.GamePlayerController.CrowdDebug
// [0x00020202] ( FUNC_Exec )
struct AGamePlayerController_execCrowdDebug_Parms
{
	// DWORD                                           bEnabled : 1;                                     		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// class AGameCrowdAgent*                          GCA;                                              		// 0x0004 (0x0008) [0x0000000000000000]              
	// int                                             I;                                                		// 0x000C (0x0004) [0x0000000000000000]              
	// int                                             AgentCount;                                       		// 0x0010 (0x0004) [0x0000000000000000]              
	// float                                           DebugRadius;                                      		// 0x0014 (0x0004) [0x0000000000000000]              
};

// Function GameFramework.GamePlayerController.GetUIPlayerIndex
// [0x00020400] ( FUNC_Native )
struct AGamePlayerController_execGetUIPlayerIndex_Parms
{
	// int                                             ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function GameFramework.GamePlayerController.OnToggleMouseCursor
// [0x00020002] 
struct AGamePlayerController_execOnToggleMouseCursor_Parms
{
	// class USeqAct_ToggleMouseCursor*                inAction;                                         		// 0x0000 (0x0008) [0x0000000000000000]              
	// class UGameViewportClient*                      GVC;                                              		// 0x0008 (0x0008) [0x0000000000000000]              
};

// Function GameFramework.GameCheatManager.OnRequestComplete
// [0x00020002] 
struct UGameCheatManager_execOnRequestComplete_Parms
{
	// class UHttpRequestInterface*                    OriginalRequest;                                  		// 0x0000 (0x0008) [0x0000000000000000]              
	// class UHttpResponseInterface*                   Response;                                         		// 0x0008 (0x0008) [0x0000000000000000]              
	// DWORD                                           bDidSucceed : 1;                                  		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
	// TArray< struct FString >                        Headers;                                          		// 0x0014 (0x0010) [0x0000000000000000]              
	// struct FString                                  Header;                                           		// 0x0024 (0x0010) [0x0000000000000000]              
	// struct FString                                  Payload;                                          		// 0x0034 (0x0010) [0x0000000000000000]              
	// int                                             PayloadIndex;                                     		// 0x0044 (0x0004) [0x0000000000000000]              
};

// Function GameFramework.GameCheatManager.TestHttp
// [0x00024202] ( FUNC_Exec )
struct UGameCheatManager_execTestHttp_Parms
{
	// struct FString                                  Verb;                                             		// 0x0000 (0x0010) [0x0000000000000000]              
	// struct FString                                  Payload;                                          		// 0x0010 (0x0010) [0x0000000000000000]              
	// struct FString                                  URL;                                              		// 0x0020 (0x0010) [0x0000000000000000]              
	// DWORD                                           bSendParallelRequest : 1;                         		// 0x0030 (0x0004) [0x0000000000000000] [0x00000001] 
	// class UHttpRequestInterface*                    R;                                                		// 0x0034 (0x0008) [0x0000000000000000]              
};

// Function GameFramework.GameCheatManager.EnableDebugCamera
// [0x00820002] 
struct UGameCheatManager_execEnableDebugCamera_Parms
{
	// DWORD                                           bEnableDebugText : 1;                             		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// class UPlayer*                                  P;                                                		// 0x0004 (0x0008) [0x0000000000000000]              
	// struct FVector                                  eyeLoc;                                           		// 0x000C (0x000C) [0x0000000000000000]              
	// struct FRotator                                 eyeRot;                                           		// 0x0018 (0x000C) [0x0000000000000000]              
	// float                                           CameraFOVAngle;                                   		// 0x0024 (0x0004) [0x0000000000000000]              
};

// Function GameFramework.GameCheatManager.TeleportPawnToCamera
// [0x00824202] ( FUNC_Exec )
struct UGameCheatManager_execTeleportPawnToCamera_Parms
{
	// DWORD                                           bToggleDebugCameraOff : 1;                        		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// class APlayerController*                        PC;                                               		// 0x0004 (0x0008) [0x0000000000000000]              
	// class ADebugCameraController*                   DCC;                                              		// 0x000C (0x0008) [0x0000000000000000]              
	// struct FVector                                  ViewLocation;                                     		// 0x0014 (0x000C) [0x0000000000000000]              
	// struct FRotator                                 ViewRotation;                                     		// 0x0020 (0x000C) [0x0000000000000000]              
};

// Function GameFramework.GameCheatManager.ToggleDebugCamera
// [0x00024202] ( FUNC_Exec )
struct UGameCheatManager_execToggleDebugCamera_Parms
{
	// DWORD                                           bDrawDebugText : 1;                               		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// class APlayerController*                        PC;                                               		// 0x0004 (0x0008) [0x0000000000000000]              
	// class ADebugCameraController*                   DCC;                                              		// 0x000C (0x0008) [0x0000000000000000]              
};

// Function GameFramework.GameCheatManager.PatchDebugCameraController
// [0x00020002] 
struct UGameCheatManager_execPatchDebugCameraController_Parms
{
	// class UClass*                                   TempCameraControllerClass;                        		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function GameFramework.GameCrowdAgent.InitDebugColor
// [0x00020102] 
struct AGameCrowdAgent_execInitDebugColor_Parms
{
};

// Function GameFramework.GameCrowdAgent.GetBehaviorString
// [0x00020002] 
struct AGameCrowdAgent_execGetBehaviorString_Parms
{
	// struct FString                                  ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000000000]              
	// struct FString                                  BehaviorString;                                   		// 0x0010 (0x0010) [0x0000000000000000]              
};

// Function GameFramework.GameCrowdAgent.GetDestString
// [0x00020002] 
struct AGameCrowdAgent_execGetDestString_Parms
{
	// struct FString                                  ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000000000]              
	// struct FString                                  DestString;                                       		// 0x0010 (0x0010) [0x0000000000000000]              
};

// Function GameFramework.GameCrowdAgent.PostRenderFor
// [0x00820902] ( FUNC_Event )
struct AGameCrowdAgent_eventPostRenderFor_Parms
{
	// class APlayerController*                        PC;                                               		// 0x0000 (0x0008) [0x0000000000000000]              
	// class UCanvas*                                  Canvas;                                           		// 0x0008 (0x0008) [0x0000000000000000]              
	// struct FVector                                  CameraPosition;                                   		// 0x0010 (0x000C) [0x0000000000000000]              
	// struct FVector                                  CameraDir;                                        		// 0x001C (0x000C) [0x0000000000000000]              
	// float                                           NameXL;                                           		// 0x0028 (0x0004) [0x0000000000000000]              
	// float                                           TextXL;                                           		// 0x002C (0x0004) [0x0000000000000000]              
	// float                                           BehavXL;                                          		// 0x0030 (0x0004) [0x0000000000000000]              
	// float                                           TextYL;                                           		// 0x0034 (0x0004) [0x0000000000000000]              
	// float                                           YL;                                               		// 0x0038 (0x0004) [0x0000000000000000]              
	// float                                           XL;                                               		// 0x003C (0x0004) [0x0000000000000000]              
	// struct FVector                                  ScreenLoc;                                        		// 0x0040 (0x000C) [0x0000000000000000]              
	// struct FString                                  ScreenName;                                       		// 0x004C (0x0010) [0x0000000000000000]              
	// struct FString                                  DestString;                                       		// 0x005C (0x0010) [0x0000000000000000]              
	// struct FString                                  BehaviorString;                                   		// 0x006C (0x0010) [0x0000000000000000]              
	// struct FFontRenderInfo                          FontInfo;                                         		// 0x007C (0x0028) [0x0000000000000000]              
};

// Function GameFramework.GameCrowdAgent.NativePostRenderFor
// [0x00020500] ( FUNC_Native )
struct AGameCrowdAgent_execNativePostRenderFor_Parms
{
	// class APlayerController*                        PC;                                               		// 0x0000 (0x0008) [0x0000000000000000]              
	// class UCanvas*                                  Canvas;                                           		// 0x0008 (0x0008) [0x0000000000000000]              
	// struct FVector                                  CameraPosition;                                   		// 0x0010 (0x000C) [0x0000000000000000]              
	// struct FVector                                  CameraDir;                                        		// 0x001C (0x000C) [0x0000000000000000]              
};

// Function GameFramework.GameCrowdAgent.GeneratePathToActor
// [0x00824802] ( FUNC_Event )
struct AGameCrowdAgent_eventGeneratePathToActor_Parms
{
	// class AActor*                                   Goal;                                             		// 0x0000 (0x0008) [0x0000000000000000]              
	// float                                           WithinDistance;                                   		// 0x0008 (0x0004) [0x0000000000000000]              
	// DWORD                                           bAllowPartialPath : 1;                            		// 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
	// struct FVector                                  ReturnValue;                                      		// 0x0010 (0x000C) [0x0000000000000000]              
	// struct FVector                                  NextDest;                                         		// 0x001C (0x000C) [0x0000000000000000]              
};

// Function GameFramework.GameCrowdAgent.InitNavigationHandle
// [0x00020802] ( FUNC_Event )
struct AGameCrowdAgent_eventInitNavigationHandle_Parms
{
};

// Function GameFramework.GameCrowdAgent.OverlappedActorEvent
// [0x00020800] ( FUNC_Event )
struct AGameCrowdAgent_eventOverlappedActorEvent_Parms
{
	// class AActor*                                   A;                                                		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function GameFramework.GameCrowdAgent.TakeDamage
// [0x00024002] 
struct AGameCrowdAgent_execTakeDamage_Parms
{
	// int                                             DamageAmount;                                     		// 0x0000 (0x0004) [0x0000000000000000]              
	// class AController*                              EventInstigator;                                  		// 0x0004 (0x0008) [0x0000000000000000]              
	// struct FVector                                  HitLocation;                                      		// 0x000C (0x000C) [0x0000000000000000]              
	// struct FVector                                  Momentum;                                         		// 0x0018 (0x000C) [0x0000000000000000]              
	// class UClass*                                   DamageType;                                       		// 0x0024 (0x0008) [0x0000000000000000]              
	// struct FTraceHitInfo                            HitInfo;                                          		// 0x002C (0x0028) [0x0000000000000000]              
	// class AActor*                                   DamageCauser;                                     		// 0x0054 (0x0008) [0x0000000000000000]              
};

// Function GameFramework.GameCrowdAgent.FireDeathEvent
// [0x00020902] ( FUNC_Event )
struct AGameCrowdAgent_eventFireDeathEvent_Parms
{
};

// Function GameFramework.GameCrowdAgent.PlayDeath
// [0x00020400] ( FUNC_Native )
struct AGameCrowdAgent_execPlayDeath_Parms
{
	// struct FVector                                  KillMomentum;                                     		// 0x0000 (0x000C) [0x0000000000000000]              
};

// Function GameFramework.GameCrowdAgent.UpdateIntermediatePoint
// [0x00024802] ( FUNC_Event )
struct AGameCrowdAgent_eventUpdateIntermediatePoint_Parms
{
	// class AActor*                                   DestinationActor;                                 		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function GameFramework.GameCrowdAgent.CalcCamera
// [0x00C20102] 
struct AGameCrowdAgent_execCalcCamera_Parms
{
	// float                                           fDeltaTime;                                       		// 0x0000 (0x0004) [0x0000000000000000]              
	// struct FVector                                  out_CamLoc;                                       		// 0x0004 (0x000C) [0x0000000000000000]              
	// struct FRotator                                 out_CamRot;                                       		// 0x0010 (0x000C) [0x0000000000000000]              
	// float                                           out_FOV;                                          		// 0x001C (0x0004) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0020 (0x0004) [0x0000000000000000] [0x00000001] 
	// struct FVector                                  HitNormal;                                        		// 0x0024 (0x000C) [0x0000000000000000]              
	// float                                           Radius;                                           		// 0x0030 (0x0004) [0x0000000000000000]              
};

// Function GameFramework.GameCrowdAgent.IsIdle
// [0x00020400] ( FUNC_Native )
struct AGameCrowdAgent_execIsIdle_Parms
{
	// DWORD                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function GameFramework.GameCrowdAgent.SetCurrentBehavior
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct AGameCrowdAgent_execSetCurrentBehavior_Parms
{
	// class UGameCrowdAgentBehavior*                  BehaviorArchetype;                                		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function GameFramework.GameCrowdAgent.StopBehavior
// [0x00020802] ( FUNC_Event )
struct AGameCrowdAgent_eventStopBehavior_Parms
{
};

// Function GameFramework.GameCrowdAgent.HandleBehaviorEvent
// [0x00020802] ( FUNC_Event )
struct AGameCrowdAgent_eventHandleBehaviorEvent_Parms
{
	// unsigned char                                   EventType;                                        		// 0x0000 (0x0001) [0x0000000000000000]              
	// class AActor*                                   InInstigator;                                     		// 0x0004 (0x0008) [0x0000000000000000]              
	// DWORD                                           bViralCause : 1;                                  		// 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           bPropagateViralFlag : 1;                          		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           bActivatedBehavior : 1;                           		// 0x0014 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function GameFramework.GameCrowdAgent.ActivateInstancedBehavior
// [0x00020002] 
struct AGameCrowdAgent_execActivateInstancedBehavior_Parms
{
	// class UGameCrowdAgentBehavior*                  NewBehaviorObject;                                		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function GameFramework.GameCrowdAgent.ActivateBehavior
// [0x00024802] ( FUNC_Event )
struct AGameCrowdAgent_eventActivateBehavior_Parms
{
	// class UGameCrowdAgentBehavior*                  NewBehaviorArchetype;                             		// 0x0000 (0x0008) [0x0000000000000000]              
	// class AActor*                                   LookAtActor;                                      		// 0x0008 (0x0008) [0x0000000000000000]              
};

// Function GameFramework.GameCrowdAgent.ResetSeePlayer
// [0x00020002] 
struct AGameCrowdAgent_execResetSeePlayer_Parms
{
};

// Function GameFramework.GameCrowdAgent.TryRandomBehavior
// [0x00020002] 
struct AGameCrowdAgent_execTryRandomBehavior_Parms
{
	// DWORD                                           bFoundBehavior : 1;                               		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// int                                             I;                                                		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function GameFramework.GameCrowdAgent.NotifySeePlayer
// [0x00020802] ( FUNC_Event )
struct AGameCrowdAgent_eventNotifySeePlayer_Parms
{
	// class APlayerController*                        PC;                                               		// 0x0000 (0x0008) [0x0000000000000000]              
	// DWORD                                           bFoundBehavior : 1;                               		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	// int                                             I;                                                		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function GameFramework.GameCrowdAgent.PlaySpawnBehavior
// [0x00020002] 
struct AGameCrowdAgent_execPlaySpawnBehavior_Parms
{
};

// Function GameFramework.GameCrowdAgent.HandlePotentialAgentEncounter
// [0x00020802] ( FUNC_Event )
struct AGameCrowdAgent_eventHandlePotentialAgentEncounter_Parms
{
};

// Function GameFramework.GameCrowdAgent.StopIdleAnimation
// [0x00020900] ( FUNC_Event )
struct AGameCrowdAgent_eventStopIdleAnimation_Parms
{
};

// Function GameFramework.GameCrowdAgent.PlayIdleAnimation
// [0x00020900] ( FUNC_Event )
struct AGameCrowdAgent_eventPlayIdleAnimation_Parms
{
};

// Function GameFramework.GameCrowdAgent.OnPlayAgentAnimation
// [0x00020102] 
struct AGameCrowdAgent_execOnPlayAgentAnimation_Parms
{
	// class USeqAct_PlayAgentAnimation*               Action;                                           		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function GameFramework.GameCrowdAgent.InitializeAgent
// [0x00C20102] 
struct AGameCrowdAgent_execInitializeAgent_Parms
{
	// class AActor*                                   SpawnLoc;                                         		// 0x0000 (0x0008) [0x0000000000000000]              
	// TArray< struct FCrowdSpawnerPlayerInfo >        PlayerInfo;                                       		// 0x0008 (0x0010) [0x0000000000000000]              
	// class AGameCrowdAgent*                          AgentTemplate;                                    		// 0x0018 (0x0008) [0x0000000000000000]              
	// class UGameCrowdGroup*                          NewGroup;                                         		// 0x0020 (0x0008) [0x0000000000000000]              
	// float                                           AgentWarmupTime;                                  		// 0x0028 (0x0004) [0x0000000000000000]              
	// DWORD                                           bWarmupPosition : 1;                              		// 0x002C (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           bCheckWarmupVisibility : 1;                       		// 0x0030 (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           bGroupDestination : 1;                            		// 0x0034 (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           bRealPreferVisible : 1;                           		// 0x0038 (0x0004) [0x0000000000000000] [0x00000001] 
	// class AGameCrowdDestination*                    SpawnDest;                                        		// 0x003C (0x0008) [0x0000000000000000]              
	// float                                           TryPct;                                           		// 0x0044 (0x0004) [0x0000000000000000]              
	// float                                           MaxSpawnDist;                                     		// 0x0048 (0x0004) [0x0000000000000000]              
	// float                                           DestDist;                                         		// 0x004C (0x0004) [0x0000000000000000]              
	// float                                           StartDist;                                        		// 0x0050 (0x0004) [0x0000000000000000]              
	// struct FVector                                  TryLoc;                                           		// 0x0054 (0x000C) [0x0000000000000000]              
	// class AActor*                                   HitActor;                                         		// 0x0060 (0x0008) [0x0000000000000000]              
	// struct FVector                                  HitLocation;                                      		// 0x0068 (0x000C) [0x0000000000000000]              
	// struct FVector                                  HitNormal;                                        		// 0x0074 (0x000C) [0x0000000000000000]              
	// struct FVector                                  NearestViewLocation;                              		// 0x0080 (0x000C) [0x0000000000000000]              
	// struct FVector                                  YAdjust;                                          		// 0x008C (0x000C) [0x0000000000000000]              
	// DWORD                                           bVisibleTryLoc : 1;                               		// 0x0098 (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           bFoundOption : 1;                                 		// 0x009C (0x0004) [0x0000000000000000] [0x00000001] 
	// int                                             CheckCnt;                                         		// 0x00A0 (0x0004) [0x0000000000000000]              
	// int                                             MaxCheckCnt;                                      		// 0x00A4 (0x0004) [0x0000000000000000]              
	// int                                             OptionIdx;                                        		// 0x00A8 (0x0004) [0x0000000000000000]              
	// TArray< struct FVector >                        TryOptions;                                       		// 0x00AC (0x0010) [0x0000000000000000]              
	// float                                           SpawnDestRadius;                                  		// 0x00BC (0x0004) [0x0000000000000000]              
	// float                                           TravelDestRadius;                                 		// 0x00C0 (0x0004) [0x0000000000000000]              
	// int                                             PlayerIdx;                                        		// 0x00C4 (0x0004) [0x0000000000000000]              
	// float                                           NearestViewDistSq;                                		// 0x00C8 (0x0004) [0x0000000000000000]              
	// float                                           ViewDistSq;                                       		// 0x00CC (0x0004) [0x0000000000000000]              
	// DWORD                                           bVisibleOption : 1;                               		// 0x00D0 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function GameFramework.GameCrowdAgent.GetAttemptedSpawnLocation
// [0x00820102] 
struct AGameCrowdAgent_execGetAttemptedSpawnLocation_Parms
{
	// float                                           Pct;                                              		// 0x0000 (0x0004) [0x0000000000000000]              
	// struct FVector                                  CurPos;                                           		// 0x0004 (0x000C) [0x0000000000000000]              
	// float                                           CurRadius;                                        		// 0x0010 (0x0004) [0x0000000000000000]              
	// struct FVector                                  DestPos;                                          		// 0x0014 (0x000C) [0x0000000000000000]              
	// float                                           DestRadius;                                       		// 0x0020 (0x0004) [0x0000000000000000]              
	// struct FVector                                  ReturnValue;                                      		// 0x0024 (0x000C) [0x0000000000000000]              
	// float                                           MaxLateralOffset;                                 		// 0x0030 (0x0004) [0x0000000000000000]              
	// float                                           LateralOffset;                                    		// 0x0034 (0x0004) [0x0000000000000000]              
	// struct FVector                                  LateralDir;                                       		// 0x0038 (0x000C) [0x0000000000000000]              
};

// Function GameFramework.GameCrowdAgent.SetLighting
// [0x00020102] 
struct AGameCrowdAgent_execSetLighting_Parms
{
	// DWORD                                           bEnableLightEnvironment : 1;                      		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// struct FLightingChannelContainer                AgentLightingChannel;                             		// 0x0004 (0x0004) [0x0000000000000000]              
	// DWORD                                           bCastShadows : 1;                                 		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function GameFramework.GameCrowdAgent.DisplayDebug
// [0x00420102] 
struct AGameCrowdAgent_execDisplayDebug_Parms
{
	// class AHUD*                                     HUD;                                              		// 0x0000 (0x0008) [0x0000000000000000]              
	// float                                           out_YL;                                           		// 0x0008 (0x0004) [0x0000000000000000]              
	// float                                           out_YPos;                                         		// 0x000C (0x0004) [0x0000000000000000]              
	// struct FString                                  T;                                                		// 0x0010 (0x0010) [0x0000000000000000]              
	// class UCanvas*                                  Canvas;                                           		// 0x0020 (0x0008) [0x0000000000000000]              
};

// Function GameFramework.GameCrowdAgent.Destroyed
// [0x00020102] 
struct AGameCrowdAgent_execDestroyed_Parms
{
};

// Function GameFramework.GameCrowdAgent.ResetPooledAgent
// [0x00020002] 
struct AGameCrowdAgent_execResetPooledAgent_Parms
{
};

// Function GameFramework.GameCrowdAgent.KillAgent
// [0x00020802] ( FUNC_Event )
struct AGameCrowdAgent_eventKillAgent_Parms
{
};

// Function GameFramework.GameCrowdAgent.PostBeginPlay
// [0x00820102] 
struct AGameCrowdAgent_execPostBeginPlay_Parms
{
	// struct FVector                                  AgentScale3D;                                     		// 0x0000 (0x000C) [0x0000000000000000]              
	// int                                             I;                                                		// 0x000C (0x0004) [0x0000000000000000]              
	// float                                           MaxSeePlayerDist;                                 		// 0x0010 (0x0004) [0x0000000000000000]              
};

// Function GameFramework.GameCrowdAgent.SetMaxSpeed
// [0x00020002] 
struct AGameCrowdAgent_execSetMaxSpeed_Parms
{
};

// Function GameFramework.GameCrowdAgent.SetCurrentDestination
// [0x00020802] ( FUNC_Event )
struct AGameCrowdAgent_eventSetCurrentDestination_Parms
{
	// class AGameCrowdDestination*                    NewDest;                                          		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function GameFramework.GameCrowdAgent.WaitForGroupMembers
// [0x00020802] ( FUNC_Event )
struct AGameCrowdAgent_eventWaitForGroupMembers_Parms
{
	// int                                             I;                                                		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function GameFramework.GameCrowdAgent.PickBehaviorFrom
// [0x00824002] 
struct AGameCrowdAgent_execPickBehaviorFrom_Parms
{
	// TArray< struct FBehaviorEntry >                 BehaviorList;                                     		// 0x0000 (0x0010) [0x0000000000000000]              
	// struct FVector                                  BestCameraLoc;                                    		// 0x0010 (0x000C) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x001C (0x0004) [0x0000000000000000] [0x00000001] 
	// struct FVector                                  CameraLoc;                                        		// 0x0020 (0x000C) [0x0000000000000000]              
	// struct FRotator                                 CameraRot;                                        		// 0x002C (0x000C) [0x0000000000000000]              
	// class APlayerController*                        PC;                                               		// 0x0038 (0x0008) [0x0000000000000000]              
	// float                                           BestDistSq;                                       		// 0x0040 (0x0004) [0x0000000000000000]              
	// float                                           NewDistSq;                                        		// 0x0044 (0x0004) [0x0000000000000000]              
	// int                                             I;                                                		// 0x0048 (0x0004) [0x0000000000000000]              
	// float                                           FreqSum;                                          		// 0x004C (0x0004) [0x0000000000000000]              
	// float                                           RandPick;                                         		// 0x0050 (0x0004) [0x0000000000000000]              
};

// Function GameFramework.GameCrowdAgent.IsPanicked
// [0x00020400] ( FUNC_Native )
struct AGameCrowdAgent_execIsPanicked_Parms
{
	// DWORD                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function GameFramework.GameCrowdAgent.FellOutOfWorld
// [0x00020902] ( FUNC_Event )
struct AGameCrowdAgent_eventFellOutOfWorld_Parms
{
	// class UClass*                                   dmgType;                                          		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function GameFramework.GameCrowdAgent.GetCollisionExtent
// [0x00020400] ( FUNC_Native )
struct AGameCrowdAgent_execGetCollisionExtent_Parms
{
	// struct FVector                                  ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000000000]              
};

// Function GameFramework.GameCrowdAgentSkeletal.CreateAttachments
// [0x00020102] 
struct AGameCrowdAgentSkeletal_execCreateAttachments_Parms
{
	// int                                             AttachIdx;                                        		// 0x0000 (0x0004) [0x0000000000000000]              
	// int                                             InfoIdx;                                          		// 0x0004 (0x0004) [0x0000000000000000]              
	// int                                             PickedInfoIdx;                                    		// 0x0008 (0x0004) [0x0000000000000000]              
	// float                                           ChanceTotal;                                      		// 0x000C (0x0004) [0x0000000000000000]              
	// float                                           RandVal;                                          		// 0x0010 (0x0004) [0x0000000000000000]              
