/*
#############################################################################################
# Killing Floor 2 (1.8787) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: IpDrv_f_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function IpDrv.InternetLink.ResolveFailed
// [0x00020800] ( FUNC_Event )
struct AInternetLink_eventResolveFailed_Parms
{
};

// Function IpDrv.InternetLink.Resolved
// [0x00020800] ( FUNC_Event )
struct AInternetLink_eventResolved_Parms
{
	// struct FIpAddr                                  Addr;                                             		// 0x0000 (0x0014) [0x0000000000000000]              
};

// Function IpDrv.InternetLink.GetLocalIP
// [0x00420400] ( FUNC_Native )
struct AInternetLink_execGetLocalIP_Parms
{
	// struct FIpAddr                                  Arg;                                              		// 0x0000 (0x0014) [0x0000000000000000]              
};

// Function IpDrv.InternetLink.StringToIpAddr
// [0x00420400] ( FUNC_Native )
struct AInternetLink_execStringToIpAddr_Parms
{
	// struct FString                                  Str;                                              		// 0x0000 (0x0010) [0x0000000000000000]              
	// struct FIpAddr                                  Addr;                                             		// 0x0010 (0x0014) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0024 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function IpDrv.InternetLink.IpAddrToString
// [0x00020400] ( FUNC_Native )
struct AInternetLink_execIpAddrToString_Parms
{
	// struct FIpAddr                                  Arg;                                              		// 0x0000 (0x0014) [0x0000000000000000]              
	// struct FString                                  ReturnValue;                                      		// 0x0014 (0x0010) [0x0000000000000000]              
};

// Function IpDrv.InternetLink.GetLastError
// [0x00020400] ( FUNC_Native )
struct AInternetLink_execGetLastError_Parms
{
	// int                                             ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function IpDrv.InternetLink.Resolve
// [0x00020400] ( FUNC_Native )
struct AInternetLink_execResolve_Parms
{
	// struct FString                                  Domain;                                           		// 0x0000 (0x0010) [0x0000000000000000]              
};

// Function IpDrv.InternetLink.ParseURL
// [0x00420400] ( FUNC_Native )
struct AInternetLink_execParseURL_Parms
{
	// struct FString                                  URL;                                              		// 0x0000 (0x0010) [0x0000000000000000]              
	// struct FString                                  Addr;                                             		// 0x0010 (0x0010) [0x0000000000000000]              
	// int                                             PortNum;                                          		// 0x0020 (0x0004) [0x0000000000000000]              
	// struct FString                                  LevelName;                                        		// 0x0024 (0x0010) [0x0000000000000000]              
	// struct FString                                  EntryName;                                        		// 0x0034 (0x0010) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0044 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function IpDrv.InternetLink.IsDataPending
// [0x00020400] ( FUNC_Native )
struct AInternetLink_execIsDataPending_Parms
{
	// DWORD                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function IpDrv.TcpLink.ReceivedBinary
// [0x00020800] ( FUNC_Event )
struct ATcpLink_eventReceivedBinary_Parms
{
	// int                                             Count;                                            		// 0x0000 (0x0004) [0x0000000000000000]              
	// unsigned char                                   B[ 0xFF ];                                        		// 0x0004 (0x00FF) [0x0000000000000000]              
};

// Function IpDrv.TcpLink.ReceivedLine
// [0x00020800] ( FUNC_Event )
struct ATcpLink_eventReceivedLine_Parms
{
	// struct FString                                  Line;                                             		// 0x0000 (0x0010) [0x0000000000000000]              
};

// Function IpDrv.TcpLink.ReceivedText
// [0x00020800] ( FUNC_Event )
struct ATcpLink_eventReceivedText_Parms
{
	// struct FString                                  Text;                                             		// 0x0000 (0x0010) [0x0000000000000000]              
};

// Function IpDrv.TcpLink.Closed
// [0x00020800] ( FUNC_Event )
struct ATcpLink_eventClosed_Parms
{
};

// Function IpDrv.TcpLink.Opened
// [0x00020800] ( FUNC_Event )
struct ATcpLink_eventOpened_Parms
{
};

// Function IpDrv.TcpLink.Accepted
// [0x00020800] ( FUNC_Event )
struct ATcpLink_eventAccepted_Parms
{
};

// Function IpDrv.TcpLink.ReadBinary
// [0x00420400] ( FUNC_Native )
struct ATcpLink_execReadBinary_Parms
{
	// int                                             Count;                                            		// 0x0000 (0x0004) [0x0000000000000000]              
	// unsigned char                                   B[ 0xFF ];                                        		// 0x0004 (0x00FF) [0x0000000000000000]              
	// int                                             ReturnValue;                                      		// 0x0104 (0x0004) [0x0000000000000000]              
};

// Function IpDrv.TcpLink.ReadText
// [0x00420400] ( FUNC_Native )
struct ATcpLink_execReadText_Parms
{
	// struct FString                                  Str;                                              		// 0x0000 (0x0010) [0x0000000000000000]              
	// int                                             ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000000]              
};

// Function IpDrv.TcpLink.SendBinary
// [0x00020400] ( FUNC_Native )
struct ATcpLink_execSendBinary_Parms
{
	// int                                             Count;                                            		// 0x0000 (0x0004) [0x0000000000000000]              
	// unsigned char                                   B[ 0xFF ];                                        		// 0x0004 (0x00FF) [0x0000000000000000]              
	// int                                             ReturnValue;                                      		// 0x0104 (0x0004) [0x0000000000000000]              
};

// Function IpDrv.TcpLink.SendText
// [0x00020400] ( FUNC_Native )
struct ATcpLink_execSendText_Parms
{
	// struct FString                                  Str;                                              		// 0x0000 (0x0010) [0x0000000000000000]              
	// int                                             ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000000]              
};

// Function IpDrv.TcpLink.IsConnected
// [0x00020400] ( FUNC_Native )
struct ATcpLink_execIsConnected_Parms
{
	// DWORD                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function IpDrv.TcpLink.Close
// [0x00020400] ( FUNC_Native )
struct ATcpLink_execClose_Parms
{
	// DWORD                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function IpDrv.TcpLink.Open
// [0x00020400] ( FUNC_Native )
struct ATcpLink_execOpen_Parms
{
	// struct FIpAddr                                  Addr;                                             		// 0x0000 (0x0014) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function IpDrv.TcpLink.Listen
// [0x00020400] ( FUNC_Native )
struct ATcpLink_execListen_Parms
{
	// DWORD                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function IpDrv.TcpLink.BindPort
// [0x00024400] ( FUNC_Native )
struct ATcpLink_execBindPort_Parms
{
	// int                                             PortNum;                                          		// 0x0000 (0x0004) [0x0000000000000000]              
	// DWORD                                           bUseNextAvailable : 1;                            		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	// int                                             ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function IpDrv.McpServiceBase.GetUserAuthURL
// [0x00020002] 
struct UMcpServiceBase_execGetUserAuthURL_Parms
{
	// struct FString                                  McpId;                                            		// 0x0000 (0x0010) [0x0000000000000000]              
	// struct FString                                  ReturnValue;                                      		// 0x0010 (0x0010) [0x0000000000000000]              
	// struct FString                                  AuthTicket;                                       		// 0x0020 (0x0010) [0x0000000000000000]              
};

// Function IpDrv.McpServiceBase.GetAppAccessURL
// [0x00020002] 
struct UMcpServiceBase_execGetAppAccessURL_Parms
{
	// struct FString                                  ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000000000]              
};

// Function IpDrv.McpServiceBase.GetBaseURL
// [0x00020002] 
struct UMcpServiceBase_execGetBaseURL_Parms
{
	// struct FString                                  ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000000000]              
};

// Function IpDrv.McpServiceBase.Init
// [0x00020802] ( FUNC_Event )
struct UMcpServiceBase_eventInit_Parms
{
	// class UClass*                                   McpConfigClass;                                   		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function IpDrv.OnlineEventsInterfaceMcp.UploadMatchmakingStats
// [0x00020400] ( FUNC_Native )
struct UOnlineEventsInterfaceMcp_execUploadMatchmakingStats_Parms
{
	// struct FUniqueNetId                             UniqueId;                                         		// 0x0000 (0x0008) [0x0000000000000000]              
	// class UOnlineMatchmakingStats*                  MMStats;                                          		// 0x0008 (0x0008) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function IpDrv.OnlineEventsInterfaceMcp.UpdatePlaylistPopulation
// [0x00020400] ( FUNC_Native )
struct UOnlineEventsInterfaceMcp_execUpdatePlaylistPopulation_Parms
{
	// int                                             PlaylistId;                                       		// 0x0000 (0x0004) [0x0000000000000000]              
	// int                                             NumPlayers;                                       		// 0x0004 (0x0004) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function IpDrv.OnlineEventsInterfaceMcp.UploadGameplayEventsData
// [0x00420400] ( FUNC_Native )
struct UOnlineEventsInterfaceMcp_execUploadGameplayEventsData_Parms
{
	// struct FUniqueNetId                             UniqueId;                                         		// 0x0000 (0x0008) [0x0000000000000000]              
	// TArray< unsigned char >                         Payload;                                          		// 0x0008 (0x0010) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0018 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function IpDrv.OnlineEventsInterfaceMcp.UploadPlayerData
// [0x00020400] ( FUNC_Native )
struct UOnlineEventsInterfaceMcp_execUploadPlayerData_Parms
{
	// struct FUniqueNetId                             UniqueId;                                         		// 0x0000 (0x0008) [0x0000000000000000]              
	// struct FString                                  PlayerNick;                                       		// 0x0008 (0x0010) [0x0000000000000000]              
	// class UOnlineProfileSettings*                   ProfileSettings;                                  		// 0x0018 (0x0008) [0x0000000000000000]              
	// class UOnlinePlayerStorage*                     PlayerStorage;                                    		// 0x0020 (0x0008) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0028 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function IpDrv.OnlineNewsInterfaceMcp.GetNews
// [0x00020002] 
struct UOnlineNewsInterfaceMcp_execGetNews_Parms
{
	// unsigned char                                   LocalUserNum;                                     		// 0x0000 (0x0001) [0x0000000000000000]              
	// unsigned char                                   NewsType;                                         		// 0x0001 (0x0001) [0x0000000000000000]              
	// struct FString                                  ReturnValue;                                      		// 0x0004 (0x0010) [0x0000000000000000]              
	// int                                             NewsIndex;                                        		// 0x0014 (0x0004) [0x0000000000000000]              
};

// Function IpDrv.OnlineNewsInterfaceMcp.ClearReadNewsCompletedDelegate
// [0x00020002] 
struct UOnlineNewsInterfaceMcp_execClearReadNewsCompletedDelegate_Parms
{
	// struct FScriptDelegate                          ReadGameNewsDelegate;                             		// 0x0000 (0x0010) [0x0000000000000000]              
	// int                                             RemoveIndex;                                      		// 0x0010 (0x0004) [0x0000000000000000]              
};

// Function IpDrv.OnlineNewsInterfaceMcp.AddReadNewsCompletedDelegate
// [0x00020002] 
struct UOnlineNewsInterfaceMcp_execAddReadNewsCompletedDelegate_Parms
{
	// struct FScriptDelegate                          ReadNewsDelegate;                                 		// 0x0000 (0x0010) [0x0000000000000000]              
};

// Function IpDrv.OnlineNewsInterfaceMcp.OnReadNewsCompleted
// [0x00120000] 
struct UOnlineNewsInterfaceMcp_execOnReadNewsCompleted_Parms
{
	// DWORD                                           bWasSuccessful : 1;                               		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// unsigned char                                   NewsType;                                         		// 0x0004 (0x0001) [0x0000000000000000]              
};

// Function IpDrv.OnlineNewsInterfaceMcp.ReadNews
// [0x00020400] ( FUNC_Native )
struct UOnlineNewsInterfaceMcp_execReadNews_Parms
{
	// unsigned char                                   LocalUserNum;                                     		// 0x0000 (0x0001) [0x0000000000000000]              
	// unsigned char                                   NewsType;                                         		// 0x0001 (0x0001) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function IpDrv.OnlineTitleFileDownloadBase.GetUrlForFile
// [0x00020400] ( FUNC_Native )
struct UOnlineTitleFileDownloadBase_execGetUrlForFile_Parms
{
	// struct FString                                  Filename;                                         		// 0x0000 (0x0010) [0x0000000000000000]              
	// struct FString                                  ReturnValue;                                      		// 0x0010 (0x0010) [0x0000000000000000]              
};

// Function IpDrv.OnlineTitleFileDownloadBase.ClearRequestTitleFileListCompleteDelegate
// [0x00020002] 
struct UOnlineTitleFileDownloadBase_execClearRequestTitleFileListCompleteDelegate_Parms
{
	// struct FScriptDelegate                          RequestTitleFileListDelegate;                     		// 0x0000 (0x0010) [0x0000000000000000]              
	// int                                             RemoveIndex;                                      		// 0x0010 (0x0004) [0x0000000000000000]              
};

// Function IpDrv.OnlineTitleFileDownloadBase.AddRequestTitleFileListCompleteDelegate
// [0x00020002] 
struct UOnlineTitleFileDownloadBase_execAddRequestTitleFileListCompleteDelegate_Parms
{
	// struct FScriptDelegate                          RequestTitleFileListDelegate;                     		// 0x0000 (0x0010) [0x0000000000000000]              
};

// Function IpDrv.OnlineTitleFileDownloadBase.OnRequestTitleFileListComplete
// [0x00120000] 
struct UOnlineTitleFileDownloadBase_execOnRequestTitleFileListComplete_Parms
{
	// DWORD                                           bWasSuccessful : 1;                               		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// TArray< struct FString >                        FilePaths;                                        		// 0x0004 (0x0010) [0x0000000000000000]              
};

// Function IpDrv.OnlineTitleFileDownloadBase.RequestTitleFileList
// [0x00020000] 
struct UOnlineTitleFileDownloadBase_execRequestTitleFileList_Parms
{
	// DWORD                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function IpDrv.OnlineTitleFileDownloadBase.ClearDownloadedFile
// [0x00020000] 
struct UOnlineTitleFileDownloadBase_execClearDownloadedFile_Parms
{
	// struct FString                                  Filename;                                         		// 0x0000 (0x0010) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function IpDrv.OnlineTitleFileDownloadBase.ClearDownloadedFiles
// [0x00020000] 
struct UOnlineTitleFileDownloadBase_execClearDownloadedFiles_Parms
{
	// DWORD                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function IpDrv.OnlineTitleFileDownloadBase.GetTitleFileState
// [0x00020000] 
struct UOnlineTitleFileDownloadBase_execGetTitleFileState_Parms
{
	// struct FString                                  Filename;                                         		// 0x0000 (0x0010) [0x0000000000000000]              
	// unsigned char                                   ReturnValue;                                      		// 0x0010 (0x0001) [0x0000000000000000]              
};

// Function IpDrv.OnlineTitleFileDownloadBase.GetTitleFileContents
// [0x00420000] 
struct UOnlineTitleFileDownloadBase_execGetTitleFileContents_Parms
{
	// struct FString                                  Filename;                                         		// 0x0000 (0x0010) [0x0000000000000000]              
	// TArray< unsigned char >                         FileContents;                                     		// 0x0010 (0x0010) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0020 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function IpDrv.OnlineTitleFileDownloadBase.ClearReadTitleFileCompleteDelegate
// [0x00020002] 
struct UOnlineTitleFileDownloadBase_execClearReadTitleFileCompleteDelegate_Parms
{
	// struct FScriptDelegate                          ReadTitleFileCompleteDelegate;                    		// 0x0000 (0x0010) [0x0000000000000000]              
	// int                                             RemoveIndex;                                      		// 0x0010 (0x0004) [0x0000000000000000]              
};

// Function IpDrv.OnlineTitleFileDownloadBase.AddReadTitleFileCompleteDelegate
// [0x00020002] 
struct UOnlineTitleFileDownloadBase_execAddReadTitleFileCompleteDelegate_Parms
{
	// struct FScriptDelegate                          ReadTitleFileCompleteDelegate;                    		// 0x0000 (0x0010) [0x0000000000000000]              
};

// Function IpDrv.OnlineTitleFileDownloadBase.ReadTitleFile
// [0x00024000] 
struct UOnlineTitleFileDownloadBase_execReadTitleFile_Parms
{
	// struct FString                                  FileToRead;                                       		// 0x0000 (0x0010) [0x0000000000000000]              
	// unsigned char                                   FileType;                                         		// 0x0010 (0x0001) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function IpDrv.OnlineTitleFileDownloadBase.OnReadTitleFileComplete
// [0x00120000] 
struct UOnlineTitleFileDownloadBase_execOnReadTitleFileComplete_Parms
{
	// DWORD                                           bWasSuccessful : 1;                               		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// struct FString                                  Filename;                                         		// 0x0004 (0x0010) [0x0000000000000000]              
};

// Function IpDrv.OnlineTitleFileDownloadMcp.ClearDownloadedFile
// [0x00020400] ( FUNC_Native )
struct UOnlineTitleFileDownloadMcp_execClearDownloadedFile_Parms
{
	// struct FString                                  Filename;                                         		// 0x0000 (0x0010) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function IpDrv.OnlineTitleFileDownloadMcp.ClearDownloadedFiles
// [0x00020400] ( FUNC_Native )
struct UOnlineTitleFileDownloadMcp_execClearDownloadedFiles_Parms
{
	// DWORD                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function IpDrv.OnlineTitleFileDownloadMcp.GetTitleFileState
// [0x00020002] 
struct UOnlineTitleFileDownloadMcp_execGetTitleFileState_Parms
{
	// struct FString                                  Filename;                                         		// 0x0000 (0x0010) [0x0000000000000000]              
	// unsigned char                                   ReturnValue;                                      		// 0x0010 (0x0001) [0x0000000000000000]              
	// int                                             FileIndex;                                        		// 0x0014 (0x0004) [0x0000000000000000]              
};

// Function IpDrv.OnlineTitleFileDownloadMcp.GetTitleFileContents
// [0x00420400] ( FUNC_Native )
struct UOnlineTitleFileDownloadMcp_execGetTitleFileContents_Parms
{
	// struct FString                                  Filename;                                         		// 0x0000 (0x0010) [0x0000000000000000]              
	// TArray< unsigned char >                         FileContents;                                     		// 0x0010 (0x0010) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0020 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function IpDrv.OnlineTitleFileDownloadMcp.ReadTitleFile
// [0x00024400] ( FUNC_Native )
struct UOnlineTitleFileDownloadMcp_execReadTitleFile_Parms
{
	// struct FString                                  FileToRead;                                       		// 0x0000 (0x0010) [0x0000000000000000]              
	// unsigned char                                   FileType;                                         		// 0x0010 (0x0001) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function IpDrv.OnlineTitleFileDownloadWeb.GetUrlForFile
// [0x00020002] 
struct UOnlineTitleFileDownloadWeb_execGetUrlForFile_Parms
{
	// struct FString                                  Filename;                                         		// 0x0000 (0x0010) [0x0000000000000000]              
	// struct FString                                  ReturnValue;                                      		// 0x0010 (0x0010) [0x0000000000000000]              
	// struct FString                                  URL;                                              		// 0x0020 (0x0010) [0x0000000000000000]              
};

// Function IpDrv.OnlineTitleFileDownloadWeb.OnFileListReceived
// [0x00020002] 
struct UOnlineTitleFileDownloadWeb_execOnFileListReceived_Parms
{
	// class UHttpRequestInterface*                    Request;                                          		// 0x0000 (0x0008) [0x0000000000000000]              
	// class UHttpResponseInterface*                   Response;                                         		// 0x0008 (0x0008) [0x0000000000000000]              
	// DWORD                                           bDidSucceed : 1;                                  		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
	// int                                             Index;                                            		// 0x0014 (0x0004) [0x0000000000000000]              
	// struct FScriptDelegate                          RequestTitleFileListDelegate;                     		// 0x0018 (0x0010) [0x0000000000000000]              
	// TArray< struct FString >                        ResponseStr;                                      		// 0x0028 (0x0010) [0x0000000000000000]              
	// DWORD                                           bSuccess : 1;                                     		// 0x0038 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function IpDrv.OnlineTitleFileDownloadWeb.RequestTitleFileList
// [0x00020002] 
struct UOnlineTitleFileDownloadWeb_execRequestTitleFileList_Parms
{
	// DWORD                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// class UHttpRequestInterface*                    HTTPRequest;                                      		// 0x0004 (0x0008) [0x0000000000000000]              
	// struct FString                                  URL;                                              		// 0x000C (0x0010) [0x0000000000000000]              
};

// Function IpDrv.OnlineTitleFileDownloadWeb.ClearDownloadedFile
// [0x00020400] ( FUNC_Native )
struct UOnlineTitleFileDownloadWeb_execClearDownloadedFile_Parms
{
	// struct FString                                  Filename;                                         		// 0x0000 (0x0010) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function IpDrv.OnlineTitleFileDownloadWeb.ClearDownloadedFiles
// [0x00020400] ( FUNC_Native )
struct UOnlineTitleFileDownloadWeb_execClearDownloadedFiles_Parms
{
	// DWORD                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function IpDrv.OnlineTitleFileDownloadWeb.GetTitleFileState
// [0x00020002] 
struct UOnlineTitleFileDownloadWeb_execGetTitleFileState_Parms
{
	// struct FString                                  Filename;                                         		// 0x0000 (0x0010) [0x0000000000000000]              
	// unsigned char                                   ReturnValue;                                      		// 0x0010 (0x0001) [0x0000000000000000]              
	// int                                             FileIndex;                                        		// 0x0014 (0x0004) [0x0000000000000000]              
};

// Function IpDrv.OnlineTitleFileDownloadWeb.GetTitleFileContents
// [0x00420400] ( FUNC_Native )
struct UOnlineTitleFileDownloadWeb_execGetTitleFileContents_Parms
{
	// struct FString                                  Filename;                                         		// 0x0000 (0x0010) [0x0000000000000000]              
	// TArray< unsigned char >                         FileContents;                                     		// 0x0010 (0x0010) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0020 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function IpDrv.OnlineTitleFileDownloadWeb.TriggerDelegates
// [0x00040401] ( FUNC_Final | FUNC_Native )
struct UOnlineTitleFileDownloadWeb_execTriggerDelegates_Parms
{
	// DWORD                                           bSuccess : 1;                                     		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// struct FString                                  FileRead;                                         		// 0x0004 (0x0010) [0x0000000000000000]              
};

// Function IpDrv.OnlineTitleFileDownloadWeb.OnFileDownloadComplete
// [0x00040003] ( FUNC_Final )
struct UOnlineTitleFileDownloadWeb_execOnFileDownloadComplete_Parms
{
	// class UHttpRequestInterface*                    Request;                                          		// 0x0000 (0x0008) [0x0000000000000000]              
	// class UHttpResponseInterface*                   Response;                                         		// 0x0008 (0x0008) [0x0000000000000000]              
	// DWORD                                           bDidSucceed : 1;                                  		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           bSuccess : 1;                                     		// 0x0014 (0x0004) [0x0000000000000000] [0x00000001] 
	// int                                             FileIndex;                                        		// 0x0018 (0x0004) [0x0000000000000000]              
	// int                                             Idx;                                              		// 0x001C (0x0004) [0x0000000000000000]              
	// struct FString                                  Filename;                                         		// 0x0020 (0x0010) [0x0000000000000000]              
	// TArray< unsigned char >                         BinaryData;                                       		// 0x0030 (0x0010) [0x0000000000000000]              
	// struct FString                                  FileCompressionTypeString;                        		// 0x0040 (0x0010) [0x0000000000000000]              
};

// Function IpDrv.OnlineTitleFileDownloadWeb.ReadTitleFile
// [0x00024002] 
struct UOnlineTitleFileDownloadWeb_execReadTitleFile_Parms
{
	// struct FString                                  FileToRead;                                       		// 0x0000 (0x0010) [0x0000000000000000]              
	// unsigned char                                   FileType;                                         		// 0x0010 (0x0001) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000000] [0x00000001] 
	// int                                             FileIndex;                                        		// 0x0018 (0x0004) [0x0000000000000000]              
	// int                                             Idx;                                              		// 0x001C (0x0004) [0x0000000000000000]              
	// struct FString                                  URL;                                              		// 0x0020 (0x0010) [0x0000000000000000]              
};

// Function IpDrv.OnlineTitleFileDownloadWeb.UncompressTitleFileContents
// [0x00420400] ( FUNC_Native )
struct UOnlineTitleFileDownloadWeb_execUncompressTitleFileContents_Parms
{
	// unsigned char                                   FileCompressionType;                              		// 0x0000 (0x0001) [0x0000000000000000]              
	// TArray< unsigned char >                         CompressedFileContents;                           		// 0x0004 (0x0010) [0x0000000000000000]              
	// TArray< unsigned char >                         UncompressedFileContents;                         		// 0x0014 (0x0010) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0024 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function IpDrv.TitleFileDownloadCache.DeleteTitleFile
// [0x00020400] ( FUNC_Native )
struct UTitleFileDownloadCache_execDeleteTitleFile_Parms
{
	// struct FString                                  Filename;                                         		// 0x0000 (0x0010) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function IpDrv.TitleFileDownloadCache.DeleteTitleFiles
// [0x00020400] ( FUNC_Native )
struct UTitleFileDownloadCache_execDeleteTitleFiles_Parms
{
	// float                                           MaxAgeSeconds;                                    		// 0x0000 (0x0004) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function IpDrv.TitleFileDownloadCache.ClearCachedFile
// [0x00020400] ( FUNC_Native )
struct UTitleFileDownloadCache_execClearCachedFile_Parms
{
	// struct FString                                  Filename;                                         		// 0x0000 (0x0010) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function IpDrv.TitleFileDownloadCache.ClearCachedFiles
// [0x00020400] ( FUNC_Native )
struct UTitleFileDownloadCache_execClearCachedFiles_Parms
{
	// DWORD                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function IpDrv.TitleFileDownloadCache.GetTitleFileLogicalName
// [0x00020400] ( FUNC_Native )
struct UTitleFileDownloadCache_execGetTitleFileLogicalName_Parms
{
	// struct FString                                  Filename;                                         		// 0x0000 (0x0010) [0x0000000000000000]              
	// struct FString                                  ReturnValue;                                      		// 0x0010 (0x0010) [0x0000000000000000]              
};

// Function IpDrv.TitleFileDownloadCache.GetTitleFileHash
// [0x00020400] ( FUNC_Native )
struct UTitleFileDownloadCache_execGetTitleFileHash_Parms
{
	// struct FString                                  Filename;                                         		// 0x0000 (0x0010) [0x0000000000000000]              
	// struct FString                                  ReturnValue;                                      		// 0x0010 (0x0010) [0x0000000000000000]              
};

// Function IpDrv.TitleFileDownloadCache.GetTitleFileState
// [0x00020400] ( FUNC_Native )
struct UTitleFileDownloadCache_execGetTitleFileState_Parms
{
	// struct FString                                  Filename;                                         		// 0x0000 (0x0010) [0x0000000000000000]              
	// unsigned char                                   ReturnValue;                                      		// 0x0010 (0x0001) [0x0000000000000000]              
};

// Function IpDrv.TitleFileDownloadCache.GetTitleFileContents
// [0x00420400] ( FUNC_Native )
struct UTitleFileDownloadCache_execGetTitleFileContents_Parms
{
	// struct FString                                  Filename;                                         		// 0x0000 (0x0010) [0x0000000000000000]              
	// TArray< unsigned char >                         FileContents;                                     		// 0x0010 (0x0010) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0020 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function IpDrv.TitleFileDownloadCache.ClearSaveTitleFileCompleteDelegate
// [0x00020002] 
struct UTitleFileDownloadCache_execClearSaveTitleFileCompleteDelegate_Parms
{
	// struct FScriptDelegate                          SaveCompleteDelegate;                             		// 0x0000 (0x0010) [0x0000000000000000]              
	// int                                             RemoveIndex;                                      		// 0x0010 (0x0004) [0x0000000000000000]              
};

// Function IpDrv.TitleFileDownloadCache.AddSaveTitleFileCompleteDelegate
// [0x00020002] 
struct UTitleFileDownloadCache_execAddSaveTitleFileCompleteDelegate_Parms
{
	// struct FScriptDelegate                          SaveCompleteDelegate;                             		// 0x0000 (0x0010) [0x0000000000000000]              
};

// Function IpDrv.TitleFileDownloadCache.OnSaveTitleFileComplete
// [0x00120000] 
struct UTitleFileDownloadCache_execOnSaveTitleFileComplete_Parms
{
	// DWORD                                           bWasSuccessful : 1;                               		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// struct FString                                  Filename;                                         		// 0x0004 (0x0010) [0x0000000000000000]              
};

// Function IpDrv.TitleFileDownloadCache.SaveTitleFile
// [0x00020400] ( FUNC_Native )
struct UTitleFileDownloadCache_execSaveTitleFile_Parms
{
	// struct FString                                  Filename;                                         		// 0x0000 (0x0010) [0x0000000000000000]              
	// struct FString                                  LogicalName;                                      		// 0x0010 (0x0010) [0x0000000000000000]              
	// TArray< unsigned char >                         FileContents;                                     		// 0x0020 (0x0010) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0030 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function IpDrv.TitleFileDownloadCache.ClearLoadTitleFileCompleteDelegate
// [0x00020002] 
struct UTitleFileDownloadCache_execClearLoadTitleFileCompleteDelegate_Parms
{
	// struct FScriptDelegate                          LoadCompleteDelegate;                             		// 0x0000 (0x0010) [0x0000000000000000]              
	// int                                             RemoveIndex;                                      		// 0x0010 (0x0004) [0x0000000000000000]              
};

// Function IpDrv.TitleFileDownloadCache.AddLoadTitleFileCompleteDelegate
// [0x00020002] 
struct UTitleFileDownloadCache_execAddLoadTitleFileCompleteDelegate_Parms
{
	// struct FScriptDelegate                          LoadCompleteDelegate;                             		// 0x0000 (0x0010) [0x0000000000000000]              
};

// Function IpDrv.TitleFileDownloadCache.OnLoadTitleFileComplete
// [0x00120000] 
struct UTitleFileDownloadCache_execOnLoadTitleFileComplete_Parms
{
	// DWORD                                           bWasSuccessful : 1;                               		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// struct FString                                  Filename;                                         		// 0x0004 (0x0010) [0x0000000000000000]              
};

// Function IpDrv.TitleFileDownloadCache.LoadTitleFile
// [0x00020400] ( FUNC_Native )
struct UTitleFileDownloadCache_execLoadTitleFile_Parms
{
	// struct FString                                  Filename;                                         		// 0x0000 (0x0010) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function IpDrv.McpMessageBase.CacheMessageContents
// [0x00420000] 
struct UMcpMessageBase_execCacheMessageContents_Parms
{
	// TArray< unsigned char >                         MessageContents;                                  		// 0x0000 (0x0010) [0x0000000000000000]              
	// struct FString                                  MessageId;                                        		// 0x0010 (0x0010) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0020 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function IpDrv.McpMessageBase.CacheMessage
// [0x00020000] 
struct UMcpMessageBase_execCacheMessage_Parms
{
	// struct FMcpMessage                              Message;                                          		// 0x0000 (0x0064) [0x0000000000000000]              
};

// Function IpDrv.McpMessageBase.GetMessageContents
// [0x00420000] 
struct UMcpMessageBase_execGetMessageContents_Parms
{
	// struct FString                                  MessageId;                                        		// 0x0000 (0x0010) [0x0000000000000000]              
	// TArray< unsigned char >                         MessageContents;                                  		// 0x0010 (0x0010) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0020 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function IpDrv.McpMessageBase.OnQueryMessageContentsComplete
// [0x00120000] 
struct UMcpMessageBase_execOnQueryMessageContentsComplete_Parms
{
	// struct FString                                  MessageId;                                        		// 0x0000 (0x0010) [0x0000000000000000]              
	// DWORD                                           bWasSuccessful : 1;                               		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
	// struct FString                                  Error;                                            		// 0x0014 (0x0010) [0x0000000000000000]              
};

// Function IpDrv.McpMessageBase.QueryMessageContents
// [0x00020000] 
struct UMcpMessageBase_execQueryMessageContents_Parms
{
	// struct FString                                  MessageId;                                        		// 0x0000 (0x0010) [0x0000000000000000]              
};

// Function IpDrv.McpMessageBase.GetMessageList
// [0x00420000] 
struct UMcpMessageBase_execGetMessageList_Parms
{
	// struct FString                                  ToUniqueUserId;                                   		// 0x0000 (0x0010) [0x0000000000000000]              
	// struct FMcpMessageList                          MessageList;                                      		// 0x0010 (0x0020) [0x0000000000000000]              
};

// Function IpDrv.McpMessageBase.OnQueryMessagesComplete
// [0x00120000] 
struct UMcpMessageBase_execOnQueryMessagesComplete_Parms
{
	// struct FString                                  UserId;                                           		// 0x0000 (0x0010) [0x0000000000000000]              
	// DWORD                                           bWasSuccessful : 1;                               		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
	// struct FString                                  Error;                                            		// 0x0014 (0x0010) [0x0000000000000000]              
};

// Function IpDrv.McpMessageBase.QueryMessages
// [0x00020000] 
struct UMcpMessageBase_execQueryMessages_Parms
{
	// struct FString                                  ToUniqueUserId;                                   		// 0x0000 (0x0010) [0x0000000000000000]              
};

// Function IpDrv.McpMessageBase.OnDeleteMessageComplete
// [0x00120000] 
struct UMcpMessageBase_execOnDeleteMessageComplete_Parms
{
	// struct FString                                  MessageId;                                        		// 0x0000 (0x0010) [0x0000000000000000]              
	// DWORD                                           bWasSuccessful : 1;                               		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
	// struct FString                                  Error;                                            		// 0x0014 (0x0010) [0x0000000000000000]              
};

// Function IpDrv.McpMessageBase.DeleteMessage
// [0x00020000] 
struct UMcpMessageBase_execDeleteMessage_Parms
{
	// struct FString                                  MessageId;                                        		// 0x0000 (0x0010) [0x0000000000000000]              
};

// Function IpDrv.McpMessageBase.OnCreateMessageComplete
// [0x00120000] 
struct UMcpMessageBase_execOnCreateMessageComplete_Parms
{
	// struct FMcpMessage                              Message;                                          		// 0x0000 (0x0064) [0x0000000000000000]              
	// DWORD                                           bWasSuccessful : 1;                               		// 0x0064 (0x0004) [0x0000000000000000] [0x00000001] 
	// struct FString                                  Error;                                            		// 0x0068 (0x0010) [0x0000000000000000]              
};

// Function IpDrv.McpMessageBase.CreateMessage
// [0x00420000] 
struct UMcpMessageBase_execCreateMessage_Parms
{
	// TArray< struct FString >                        ToUniqueUserIds;                                  		// 0x0000 (0x0010) [0x0000000000000000]              
	// struct FString                                  FromUniqueUserId;                                 		// 0x0010 (0x0010) [0x0000000000000000]              
	// struct FString                                  FromFriendlyName;                                 		// 0x0020 (0x0010) [0x0000000000000000]              
	// struct FString                                  MessageType;                                      		// 0x0030 (0x0010) [0x0000000000000000]              
	// struct FString                                  PushMessage;                                      		// 0x0040 (0x0010) [0x0000000000000000]              
	// struct FString                                  ValidUntil;                                       		// 0x0050 (0x0010) [0x0000000000000000]              
	// TArray< unsigned char >                         MessageContents;                                  		// 0x0060 (0x0010) [0x0000000000000000]              
};

// Function IpDrv.McpMessageBase.CreateInstance
// [0x00022003] ( FUNC_Final )
struct UMcpMessageBase_execCreateInstance_Parms
{
	// class UMcpMessageBase*                          ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000000]              
	// class UClass*                                   McpMessageBaseClass;                              		// 0x0008 (0x0008) [0x0000000000000000]              
	// class UMcpMessageBase*                          NewInstance;                                      		// 0x0010 (0x0008) [0x0000000000000000]              
};

// Function IpDrv.McpMessageManager.CacheMessageContents
// [0x00420002] 
struct UMcpMessageManager_execCacheMessageContents_Parms
{
	// TArray< unsigned char >                         MessageContents;                                  		// 0x0000 (0x0010) [0x0000000000000000]              
	// struct FString                                  MessageId;                                        		// 0x0010 (0x0010) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0020 (0x0004) [0x0000000000000000] [0x00000001] 
	// int                                             MessageContentsIndex;                             		// 0x0024 (0x0004) [0x0000000000000000]              
	// DWORD                                           bWasSuccessful : 1;                               		// 0x0028 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function IpDrv.McpMessageManager.GetMessageById
// [0x00420002] 
struct UMcpMessageManager_execGetMessageById_Parms
{
	// struct FString                                  MessageId;                                        		// 0x0000 (0x0010) [0x0000000000000000]              
	// struct FMcpMessage                              Message;                                          		// 0x0010 (0x0064) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0074 (0x0004) [0x0000000000000000] [0x00000001] 
	// int                                             MessageListsSize;                                 		// 0x0078 (0x0004) [0x0000000000000000]              
	// int                                             MessageListsItr;                                  		// 0x007C (0x0004) [0x0000000000000000]              
	// int                                             MessageItr;                                       		// 0x0080 (0x0004) [0x0000000000000000]              
};

// Function IpDrv.McpMessageManager.CacheMessage
// [0x00820002] 
struct UMcpMessageManager_execCacheMessage_Parms
{
	// struct FMcpMessage                              Message;                                          		// 0x0000 (0x0064) [0x0000000000000000]              
	// int                                             AddAt;                                            		// 0x0064 (0x0004) [0x0000000000000000]              
	// int                                             MessageIndex;                                     		// 0x0068 (0x0004) [0x0000000000000000]              
	// int                                             MessageListIndex;                                 		// 0x006C (0x0004) [0x0000000000000000]              
	// struct FMcpMessageList                          UserMessageList;                                  		// 0x0070 (0x0020) [0x0000000000000000]              
	// DWORD                                           bWasFound : 1;                                    		// 0x0090 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function IpDrv.McpMessageManager.GetMessageContents
// [0x00420002] 
struct UMcpMessageManager_execGetMessageContents_Parms
{
	// struct FString                                  MessageId;                                        		// 0x0000 (0x0010) [0x0000000000000000]              
	// TArray< unsigned char >                         MessageContents;                                  		// 0x0010 (0x0010) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0020 (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           bWasSuccessful : 1;                               		// 0x0024 (0x0004) [0x0000000000000000] [0x00000001] 
	// int                                             MessageContentsIndex;                             		// 0x0028 (0x0004) [0x0000000000000000]              
};

// Function IpDrv.McpMessageManager.OnQueryMessageContentsRequestComplete
// [0x00840003] ( FUNC_Final )
struct UMcpMessageManager_execOnQueryMessageContentsRequestComplete_Parms
{
	// class UHttpRequestInterface*                    OriginalRequest;                                  		// 0x0000 (0x0008) [0x0000000000000000]              
	// class UHttpResponseInterface*                   HttpResponse;                                     		// 0x0008 (0x0008) [0x0000000000000000]              
	// DWORD                                           bWasSuccessful : 1;                               		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
	// int                                             ResponseCode;                                     		// 0x0014 (0x0004) [0x0000000000000000]              
	// TArray< unsigned char >                         MessageContents;                                  		// 0x0018 (0x0010) [0x0000000000000000]              
	// struct FString                                  MessageId;                                        		// 0x0028 (0x0010) [0x0000000000000000]              
	// struct FMcpMessage                              Message;                                          		// 0x0038 (0x0064) [0x0000000000000000]              
};

// Function IpDrv.McpMessageManager.QueryMessageContents
// [0x00020002] 
struct UMcpMessageManager_execQueryMessageContents_Parms
{
	// struct FString                                  MessageId;                                        		// 0x0000 (0x0010) [0x0000000000000000]              
	// struct FString                                  URL;                                              		// 0x0010 (0x0010) [0x0000000000000000]              
	// class UHttpRequestInterface*                    QueryMessageContentsRequest;                      		// 0x0020 (0x0008) [0x0000000000000000]              
};

// Function IpDrv.McpMessageManager.GetMessageList
// [0x00420002] 
struct UMcpMessageManager_execGetMessageList_Parms
{
	// struct FString                                  ToUniqueUserId;                                   		// 0x0000 (0x0010) [0x0000000000000000]              
	// struct FMcpMessageList                          MessageList;                                      		// 0x0010 (0x0020) [0x0000000000000000]              
	// int                                             MessageListIndex;                                 		// 0x0030 (0x0004) [0x0000000000000000]              
};

// Function IpDrv.McpMessageManager.OnQueryMessagesRequestComplete
// [0x00840003] ( FUNC_Final )
struct UMcpMessageManager_execOnQueryMessagesRequestComplete_Parms
{
	// class UHttpRequestInterface*                    OriginalRequest;                                  		// 0x0000 (0x0008) [0x0000000000000000]              
	// class UHttpResponseInterface*                   HttpResponse;                                     		// 0x0008 (0x0008) [0x0000000000000000]              
	// DWORD                                           bWasSuccessful : 1;                               		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
	// int                                             ResponseCode;                                     		// 0x0014 (0x0004) [0x0000000000000000]              
	// struct FString                                  Error;                                            		// 0x0018 (0x0010) [0x0000000000000000]              
	// struct FString                                  JsonString;                                       		// 0x0028 (0x0010) [0x0000000000000000]              
	// class UJsonObject*                              ParsedJson;                                       		// 0x0038 (0x0008) [0x0000000000000000]              
	// int                                             JsonIndex;                                        		// 0x0040 (0x0004) [0x0000000000000000]              
	// struct FMcpMessage                              Message;                                          		// 0x0044 (0x0064) [0x0000000000000000]              
	// struct FString                                  MessageCompressionTypeString;                     		// 0x00A8 (0x0010) [0x0000000000000000]              
};

// Function IpDrv.McpMessageManager.QueryMessages
// [0x00020002] 
struct UMcpMessageManager_execQueryMessages_Parms
{
	// struct FString                                  ToUniqueUserId;                                   		// 0x0000 (0x0010) [0x0000000000000000]              
	// struct FString                                  URL;                                              		// 0x0010 (0x0010) [0x0000000000000000]              
	// class UHttpRequestInterface*                    QueryMessagesRequest;                             		// 0x0020 (0x0008) [0x0000000000000000]              
};

// Function IpDrv.McpMessageManager.OnDeleteMessageRequestComplete
// [0x00020002] 
struct UMcpMessageManager_execOnDeleteMessageRequestComplete_Parms
{
	// class UHttpRequestInterface*                    OriginalRequest;                                  		// 0x0000 (0x0008) [0x0000000000000000]              
	// class UHttpResponseInterface*                   HttpResponse;                                     		// 0x0008 (0x0008) [0x0000000000000000]              
	// DWORD                                           bWasSuccessful : 1;                               		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
	// int                                             ResponseCode;                                     		// 0x0014 (0x0004) [0x0000000000000000]              
	// struct FString                                  Content;                                          		// 0x0018 (0x0010) [0x0000000000000000]              
	// struct FString                                  MessageId;                                        		// 0x0028 (0x0010) [0x0000000000000000]              
};

// Function IpDrv.McpMessageManager.DeleteMessage
// [0x00020002] 
struct UMcpMessageManager_execDeleteMessage_Parms
{
	// struct FString                                  MessageId;                                        		// 0x0000 (0x0010) [0x0000000000000000]              
	// struct FString                                  URL;                                              		// 0x0010 (0x0010) [0x0000000000000000]              
	// class UHttpRequestInterface*                    DeleteMessageRequest;                             		// 0x0020 (0x0008) [0x0000000000000000]              
};

