/*
#############################################################################################
# Killing Floor 2 (1.8787) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: KFGame_f_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function KFGame.KFAnimNotify_AkEvent_IfActiveMGTarget.CanPlayAkEvent
// [0x00020902] ( FUNC_Event )
struct UKFAnimNotify_AkEvent_IfActiveMGTarget_eventCanPlayAkEvent_Parms
{
	// class AActor*                                   InOwner;                                          		// 0x0000 (0x0008) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function KFGame.KFCheatManager.ForceUpdateDiscordPresence
// [0x00020200] ( FUNC_Exec )
struct UKFCheatManager_execForceUpdateDiscordPresence_Parms
{
};

// Function KFGame.KFCheatManager.ActivateAllPickups
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execActivateAllPickups_Parms
{
	// int                                             I;                                                		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.ForceNextObjective
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execForceNextObjective_Parms
{
};

// Function KFGame.KFCheatManager.ForceOutbreakWave
// [0x00024202] ( FUNC_Exec )
struct UKFCheatManager_execForceOutbreakWave_Parms
{
	// int                                             OutbreakIdx;                                      		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.ForceSpecialWave
// [0x00024202] ( FUNC_Exec )
struct UKFCheatManager_execForceSpecialWave_Parms
{
	// struct FString                                  ZedTypeName;                                      		// 0x0000 (0x0010) [0x0000000000000000]              
	// int                                             AIType;                                           		// 0x0010 (0x0004) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.UpgradeWeapon
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execUpgradeWeapon_Parms
{
	// class AKFPawn*                                  MyPawn;                                           		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.SetMissionObjectiveVisible
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execSetMissionObjectiveVisible_Parms
{
	// DWORD                                           bVisible : 1;                                     		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// class APawn*                                    P;                                                		// 0x0004 (0x0008) [0x0000000000000000]              
	// class AKFPlayerController*                      KFPC;                                             		// 0x000C (0x0008) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.SetMissionFailState
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execSetMissionFailState_Parms
{
	// DWORD                                           bFailed : 1;                                      		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// class APawn*                                    P;                                                		// 0x0004 (0x0008) [0x0000000000000000]              
	// class AKFPlayerController*                      KFPC;                                             		// 0x000C (0x0008) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.SetMissionObjectiveActive
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execSetMissionObjectiveActive_Parms
{
	// DWORD                                           bActive : 1;                                      		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// class APawn*                                    P;                                                		// 0x0004 (0x0008) [0x0000000000000000]              
	// class AKFPlayerController*                      KFPC;                                             		// 0x000C (0x0008) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.SetMissionObjectiveProgress
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execSetMissionObjectiveProgress_Parms
{
	// float                                           ProgressValue;                                    		// 0x0000 (0x0004) [0x0000000000000000]              
	// class APawn*                                    P;                                                		// 0x0004 (0x0008) [0x0000000000000000]              
	// class AKFPlayerController*                      KFPC;                                             		// 0x000C (0x0008) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.LedRestoreLighting
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execLedRestoreLighting_Parms
{
	// class ULogitechLEDInterface*                    LogtitechLED;                                     		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.LedStopEffects
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execLedStopEffects_Parms
{
	// class ULogitechLEDInterface*                    LogtitechLED;                                     		// 0x0000 (0x0008) [0x0000000000000000]              
	// class URazerLEDInterface*                       RazerFXLED;                                       		// 0x0008 (0x0008) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.LEDPulseLighting
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execLEDPulseLighting_Parms
{
	// int                                             RedPercent;                                       		// 0x0000 (0x0004) [0x0000000000000000]              
	// int                                             GreenPercent;                                     		// 0x0004 (0x0004) [0x0000000000000000]              
	// int                                             BluePercent;                                      		// 0x0008 (0x0004) [0x0000000000000000]              
	// int                                             milliSecondsDuration;                             		// 0x000C (0x0004) [0x0000000000000000]              
	// int                                             milliSecondsInterval;                             		// 0x0010 (0x0004) [0x0000000000000000]              
	// class ULogitechLEDInterface*                    LogtitechLED;                                     		// 0x0014 (0x0008) [0x0000000000000000]              
	// class URazerLEDInterface*                       RazerFXLED;                                       		// 0x001C (0x0008) [0x0000000000000000]              
	// class UAlienFXLEDInterface*                     AlienFXLED;                                       		// 0x0024 (0x0008) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.LEDSetFlashingRBG
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execLEDSetFlashingRBG_Parms
{
	// int                                             RedPercent;                                       		// 0x0000 (0x0004) [0x0000000000000000]              
	// int                                             GreenPercent;                                     		// 0x0004 (0x0004) [0x0000000000000000]              
	// int                                             BluePercent;                                      		// 0x0008 (0x0004) [0x0000000000000000]              
	// int                                             milliSecondsDuration;                             		// 0x000C (0x0004) [0x0000000000000000]              
	// int                                             milliSecondsInterval;                             		// 0x0010 (0x0004) [0x0000000000000000]              
	// class AKFPlayerController*                      KFPC;                                             		// 0x0014 (0x0008) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.SetLEDRGB
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execSetLEDRGB_Parms
{
	// unsigned char                                   RedPercent;                                       		// 0x0000 (0x0001) [0x0000000000000000]              
	// unsigned char                                   GreenPercent;                                     		// 0x0001 (0x0001) [0x0000000000000000]              
	// unsigned char                                   BluePercent;                                      		// 0x0002 (0x0001) [0x0000000000000000]              
	// class ULogitechLEDInterface*                    LogtitechLED;                                     		// 0x0004 (0x0008) [0x0000000000000000]              
	// class URazerLEDInterface*                       RazerFXLED;                                       		// 0x000C (0x0008) [0x0000000000000000]              
	// class UAlienFXLEDInterface*                     AlienFXLED;                                       		// 0x0014 (0x0008) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.InitLEDEffects
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execInitLEDEffects_Parms
{
	// class ULogitechLEDInterface*                    LogtitechLED;                                     		// 0x0000 (0x0008) [0x0000000000000000]              
	// class URazerLEDInterface*                       RazerFXLED;                                       		// 0x0008 (0x0008) [0x0000000000000000]              
	// class UAlienFXLEDInterface*                     AlienFXLED;                                       		// 0x0010 (0x0008) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.ForceMixerScene
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execForceMixerScene_Parms
{
	// struct FString                                  VersionNumber;                                    		// 0x0000 (0x0010) [0x0000000000000000]              
	// struct FString                                  ShareCode;                                        		// 0x0010 (0x0010) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.TestMixerButton
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execTestMixerButton_Parms
{
	// struct FString                                  Button;                                           		// 0x0000 (0x0010) [0x0000000000000000]              
	// struct FString                                  MetaData;                                         		// 0x0010 (0x0010) [0x0000000000000000]              
	// int                                             Amount;                                           		// 0x0020 (0x0004) [0x0000000000000000]              
	// int                                             Cooldown;                                         		// 0x0024 (0x0004) [0x0000000000000000]              
	// TArray< struct FString >                        MetaKeys;                                         		// 0x0028 (0x0010) [0x0000000000000000]              
	// TArray< struct FString >                        MetaProps;                                        		// 0x0038 (0x0010) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.TestGaveAmmo
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execTestGaveAmmo_Parms
{
	// struct FString                                  UserName;                                         		// 0x0000 (0x0010) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.StopMixer
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execStopMixer_Parms
{
};

// Function KFGame.KFCheatManager.StartMixer
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execStartMixer_Parms
{
};

// Function KFGame.KFCheatManager.DebugSetSafeFrame
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execDebugSetSafeFrame_Parms
{
	// float                                           NewScale;                                         		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.DebugEndGameRewards
// [0x00024202] ( FUNC_Exec )
struct UKFCheatManager_execDebugEndGameRewards_Parms
{
	// float                                           GameplayTime;                                     		// 0x0000 (0x0004) [0x0000000000000000]              
	// DWORD                                           bFinal : 1;                                       		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	// class UJsonObject*                              Parms;                                            		// 0x0008 (0x0008) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.GetTitleDataValueForKey
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execGetTitleDataValueForKey_Parms
{
	// struct FString                                  Key;                                              		// 0x0000 (0x0010) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.OnTitleDataRead
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execOnTitleDataRead_Parms
{
};

// Function KFGame.KFCheatManager.ReadPlayfabTitleData
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execReadPlayfabTitleData_Parms
{
};

// Function KFGame.KFCheatManager.RefreshXboxInventory
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execRefreshXboxInventory_Parms
{
};

// Function KFGame.KFCheatManager.DumpStoreCatalog
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execDumpStoreCatalog_Parms
{
	// unsigned char                                   MediaType;                                        		// 0x0000 (0x0001) [0x0000000000000000]              
	// int                                             I;                                                		// 0x0004 (0x0004) [0x0000000000000000]              
	// int                                             J;                                                		// 0x0008 (0x0004) [0x0000000000000000]              
	// int                                             K;                                                		// 0x000C (0x0004) [0x0000000000000000]              
	// TArray< struct FMarketplaceProductDetails >     AvailableProducts;                                		// 0x0010 (0x0010) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.DumpFullCatalog
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execDumpFullCatalog_Parms
{
};

// Function KFGame.KFCheatManager.DumpSubscriptions
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execDumpSubscriptions_Parms
{
};

// Function KFGame.KFCheatManager.DumpConsumables
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execDumpConsumables_Parms
{
};

// Function KFGame.KFCheatManager.DumpDurables
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execDumpDurables_Parms
{
};

// Function KFGame.KFCheatManager.DumpApplicationProducts
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execDumpApplicationProducts_Parms
{
};

// Function KFGame.KFCheatManager.DumpGameProducts
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execDumpGameProducts_Parms
{
};

// Function KFGame.KFCheatManager.ShowXboxStoreUI
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execShowXboxStoreUI_Parms
{
};

// Function KFGame.KFCheatManager.ShowXboxProductDetails
// [0x00024202] ( FUNC_Exec )
struct UKFCheatManager_execShowXboxProductDetails_Parms
{
	// struct FString                                  ProductID;                                        		// 0x0000 (0x0010) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.DeleteXboxSaveData
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execDeleteXboxSaveData_Parms
{
};

// Function KFGame.KFCheatManager.TestTutorialRewards
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execTestTutorialRewards_Parms
{
};

// Function KFGame.KFCheatManager.DebugConsumeEntitlements
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execDebugConsumeEntitlements_Parms
{
};

// Function KFGame.KFCheatManager.DebugGrantItem
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execDebugGrantItem_Parms
{
	// struct FString                                  ItemId;                                           		// 0x0000 (0x0010) [0x0000000000000000]              
	// TArray< struct FString >                        ItemIds;                                          		// 0x0010 (0x0010) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.DebugRemoveCurrency
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execDebugRemoveCurrency_Parms
{
	// int                                             Amount;                                           		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.DebugAddCurrency
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execDebugAddCurrency_Parms
{
	// int                                             Amount;                                           		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.DebugRetrieveInternalData
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execDebugRetrieveInternalData_Parms
{
	// struct FString                                  InKey;                                            		// 0x0000 (0x0010) [0x0000000000000000]              
	// TArray< struct FString >                        Keys;                                             		// 0x0010 (0x0010) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.DebugUpdateServerData
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execDebugUpdateServerData_Parms
{
};

// Function KFGame.KFCheatManager.DebugUpdateInternalData
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execDebugUpdateInternalData_Parms
{
	// struct FString                                  InKey;                                            		// 0x0000 (0x0010) [0x0000000000000000]              
	// struct FString                                  InValue;                                          		// 0x0010 (0x0010) [0x0000000000000000]              
	// TArray< struct FString >                        Keys;                                             		// 0x0020 (0x0010) [0x0000000000000000]              
	// TArray< struct FString >                        Values;                                           		// 0x0030 (0x0010) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.DumpExchangeRules
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execDumpExchangeRules_Parms
{
	// int                                             I;                                                		// 0x0000 (0x0004) [0x0000000000000000]              
	// int                                             J;                                                		// 0x0004 (0x0004) [0x0000000000000000]              
	// class UOnlineSubsystem*                         OSS;                                              		// 0x0008 (0x0008) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.DumpInventory
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execDumpInventory_Parms
{
	// int                                             I;                                                		// 0x0000 (0x0004) [0x0000000000000000]              
	// class UOnlineSubsystem*                         OSS;                                              		// 0x0004 (0x0008) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.DumpItemDefinitions
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execDumpItemDefinitions_Parms
{
	// int                                             I;                                                		// 0x0000 (0x0004) [0x0000000000000000]              
	// class UOnlineSubsystem*                         OSS;                                              		// 0x0004 (0x0008) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.UnlockContainer
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execUnlockContainer_Parms
{
	// struct FString                                  ContainerItemID;                                  		// 0x0000 (0x0010) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.OnPlayfabInventoryReadComplete
// [0x00020002] 
struct UKFCheatManager_execOnPlayfabInventoryReadComplete_Parms
{
	// DWORD                                           bSuccessful : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function KFGame.KFCheatManager.ReadPFUserInventory
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execReadPFUserInventory_Parms
{
};

// Function KFGame.KFCheatManager.OnPlayfabStoreReadComplete
// [0x00020002] 
struct UKFCheatManager_execOnPlayfabStoreReadComplete_Parms
{
	// DWORD                                           bSuccessful : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function KFGame.KFCheatManager.ReadPFStoreData
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execReadPFStoreData_Parms
{
};

// Function KFGame.KFCheatManager.SetMatchmakingRegion
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execSetMatchmakingRegion_Parms
{
	// struct FString                                  InRegion;                                         		// 0x0000 (0x0010) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.OnServerStarted
// [0x00020002] 
struct UKFCheatManager_execOnServerStarted_Parms
{
	// DWORD                                           bWasSuccessful : 1;                               		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// struct FString                                  ServerLobbyId;                                    		// 0x0004 (0x0010) [0x0000000000000000]              
	// struct FString                                  ServerIP;                                         		// 0x0014 (0x0010) [0x0000000000000000]              
	// int                                             ServerPort;                                       		// 0x0024 (0x0004) [0x0000000000000000]              
	// struct FString                                  ServerTicket;                                     		// 0x0028 (0x0010) [0x0000000000000000]              
	// struct FString                                  OpenCommand;                                      		// 0x0038 (0x0010) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.StartupServer
// [0x00024202] ( FUNC_Exec )
struct UKFCheatManager_execStartupServer_Parms
{
	// struct FString                                  ServerCommandline;                                		// 0x0000 (0x0010) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.OnQueryServerInfoComplete
// [0x00020002] 
struct UKFCheatManager_execOnQueryServerInfoComplete_Parms
{
	// DWORD                                           bWasSuccessful : 1;                               		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// struct FString                                  LobbyId;                                          		// 0x0004 (0x0010) [0x0000000000000000]              
	// struct FString                                  ServerIP;                                         		// 0x0014 (0x0010) [0x0000000000000000]              
	// int                                             ServerPort;                                       		// 0x0024 (0x0004) [0x0000000000000000]              
	// struct FString                                  AuthTicket;                                       		// 0x0028 (0x0010) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.TestServerInfoQuery
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execTestServerInfoQuery_Parms
{
	// struct FString                                  LobbyId;                                          		// 0x0000 (0x0010) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.OnFindOnlinePlayfabGamesComplete
// [0x00020002] 
struct UKFCheatManager_execOnFindOnlinePlayfabGamesComplete_Parms
{
	// DWORD                                           bSuccess : 1;                                     		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// int                                             I;                                                		// 0x0004 (0x0004) [0x0000000000000000]              
	// class UKFDataStore_OnlineGameSearch*            SearchDataStore;                                  		// 0x0008 (0x0008) [0x0000000000000000]              
	// class UKFOnlineGameSettings*                    GS;                                               		// 0x0010 (0x0008) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.TestPlayfabGameSearch
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execTestPlayfabGameSearch_Parms
{
	// class UKFDataStore_OnlineGameSearch*            SearchDataStore;                                  		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.OnLoginComplete
// [0x00020002] 
struct UKFCheatManager_execOnLoginComplete_Parms
{
	// DWORD                                           bWasSuccessful : 1;                               		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// struct FString                                  SessionTicket;                                    		// 0x0004 (0x0010) [0x0000000000000000]              
	// struct FString                                  PlayfabId;                                        		// 0x0014 (0x0010) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.TestLogin
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execTestLogin_Parms
{
	// struct FString                                  InName;                                           		// 0x0000 (0x0010) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.LoginSelf
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execLoginSelf_Parms
{
};

// Function KFGame.KFCheatManager.Hats
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execHats_Parms
{
};

// Function KFGame.KFCheatManager.ShowPostRoundMenu
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execShowPostRoundMenu_Parms
{
	// class AKFPlayerController*                      KFPC;                                             		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.SpawnHumanPawnV
// [0x00824202] ( FUNC_Exec )
struct UKFCheatManager_execSpawnHumanPawnV_Parms
{
	// DWORD                                           bEnemy : 1;                                       		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           bUseGodMode : 1;                                  		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	// int                                             CharIndex;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
	// class AKFAIController*                          KFBot;                                            		// 0x000C (0x0008) [0x0000000000000000]              
	// class AKFPlayerReplicationInfo*                 KFPRI;                                            		// 0x0014 (0x0008) [0x0000000000000000]              
	// struct FVector                                  CamLoc;                                           		// 0x001C (0x000C) [0x0000000000000000]              
	// struct FRotator                                 CamRot;                                           		// 0x0028 (0x000C) [0x0000000000000000]              
	// class UClass*                                   PawnClass;                                        		// 0x0034 (0x0008) [0x0000000000000000]              
	// class AKFPawn_Human*                            KFPH;                                             		// 0x003C (0x0008) [0x0000000000000000]              
	// struct FVector                                  HitLocation;                                      		// 0x0044 (0x000C) [0x0000000000000000]              
	// struct FVector                                  HitNormal;                                        		// 0x0050 (0x000C) [0x0000000000000000]              
	// class AActor*                                   TraceOwner;                                       		// 0x005C (0x0008) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.TestGrapple
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execTestGrapple_Parms
{
	// class AKFPawn_Monster*                          P;                                                		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.DemiGod
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execDemiGod_Parms
{
};

// Function KFGame.KFCheatManager.SetWeaponSkin
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execSetWeaponSkin_Parms
{
	// int                                             MaterialIndex;                                    		// 0x0000 (0x0004) [0x0000000000000000]              
	// struct FString                                  MaterialName;                                     		// 0x0004 (0x0010) [0x0000000000000000]              
	// class UMaterialInterface*                       NewMat;                                           		// 0x0014 (0x0008) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.WeaponGotoState
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execWeaponGotoState_Parms
{
	// struct FName                                    StateName;                                        		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.RespawnSpectators
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execRespawnSpectators_Parms
{
};

// Function KFGame.KFCheatManager.LogServerMovementVars
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execLogServerMovementVars_Parms
{
};

// Function KFGame.KFCheatManager.ToggleVisibilityView
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execToggleVisibilityView_Parms
{
	// class AActor*                                   A;                                                		// 0x0000 (0x0008) [0x0000000000000000]              
	// class AStaticMeshActor*                         SM;                                               		// 0x0008 (0x0008) [0x0000000000000000]              
	// class UStaticMeshComponent*                     SMC;                                              		// 0x0010 (0x0008) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.ToggleRelevancyView
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execToggleRelevancyView_Parms
{
	// class AActor*                                   A;                                                		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.LogStatValue
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execLogStatValue_Parms
{
	// int                                             StatId;                                           		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.LogItemPickups
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execLogItemPickups_Parms
{
	// class AKFGameInfo*                              KFGI;                                             		// 0x0000 (0x0008) [0x0000000000000000]              
	// float                                           NumTotalItemPickups;                              		// 0x0008 (0x0004) [0x0000000000000000]              
	// float                                           NumActiveItemPickups;                             		// 0x000C (0x0004) [0x0000000000000000]              
	// float                                           NumSleepingItemPickups;                           		// 0x0010 (0x0004) [0x0000000000000000]              
	// float                                           NumDisabledItemPickups;                           		// 0x0014 (0x0004) [0x0000000000000000]              
	// int                                             I;                                                		// 0x0018 (0x0004) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.LogAmmoPickups
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execLogAmmoPickups_Parms
{
	// class AKFGameInfo*                              KFGI;                                             		// 0x0000 (0x0008) [0x0000000000000000]              
	// float                                           NumTotalAmmoPickups;                              		// 0x0008 (0x0004) [0x0000000000000000]              
	// float                                           NumActiveAmmoPickups;                             		// 0x000C (0x0004) [0x0000000000000000]              
	// float                                           NumSleepingAmmoPickups;                           		// 0x0010 (0x0004) [0x0000000000000000]              
	// float                                           NumDisabledAmmoPickups;                           		// 0x0014 (0x0004) [0x0000000000000000]              
	// int                                             I;                                                		// 0x0018 (0x0004) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.ShowKFGameVersion
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execShowKFGameVersion_Parms
{
};

// Function KFGame.KFCheatManager.DBJump
// [0x00820202] ( FUNC_Exec )
struct UKFCheatManager_execDBJump_Parms
{
	// struct FVector                                  UsedKickMomentum;                                 		// 0x0000 (0x000C) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.ClearFakeDramaEvent
// [0x00020102] 
struct UKFCheatManager_execClearFakeDramaEvent_Parms
{
};

// Function KFGame.KFCheatManager.FakeDramaEvent
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execFakeDramaEvent_Parms
{
};

// Function KFGame.KFCheatManager.ZedTimeTest
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execZedTimeTest_Parms
{
	// float                                           NewCustomTimeDilation;                            		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.TestFalloffDamage
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execTestFalloffDamage_Parms
{
	// float                                           Distance;                                         		// 0x0000 (0x0004) [0x0000000000000000]              
	// float                                           MaxRadius;                                        		// 0x0004 (0x0004) [0x0000000000000000]              
	// float                                           FalloffExponent;                                  		// 0x0008 (0x0004) [0x0000000000000000]              
	// float                                           DamageScale;                                      		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.GetCurrentPerkXP
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execGetCurrentPerkXP_Parms
{
};

// Function KFGame.KFCheatManager.ShowLevelUpPopUp
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execShowLevelUpPopUp_Parms
{
	// DWORD                                           bTierUnlock : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// class AKFPlayerController*                      KFPC;                                             		// 0x0004 (0x0008) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.TestGameSearch
// [0x00024202] ( FUNC_Exec )
struct UKFCheatManager_execTestGameSearch_Parms
{
	// DWORD                                           bSearchLan : 1;                                   		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// class UKFDataStore_OnlineGameSearch*            SearchDataStore;                                  		// 0x0004 (0x0008) [0x0000000000000000]              
	// class UDataStoreClient*                         DataStoreManager;                                 		// 0x000C (0x0008) [0x0000000000000000]              
	// DWORD                                           succeed : 1;                                      		// 0x0014 (0x0004) [0x0000000000000000] [0x00000001] 
	// class UOnlineGameSearch*                        GameSearch;                                       		// 0x0018 (0x0008) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.Chris
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execChris_Parms
{
};

// Function KFGame.KFCheatManager.ShowMeleeCollision
// [0x00024202] ( FUNC_Exec )
struct UKFCheatManager_execShowMeleeCollision_Parms
{
	// DWORD                                           bEnable : 1;                                      		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function KFGame.KFCheatManager.LaunchChunks
// [0x00820202] ( FUNC_Exec )
struct UKFCheatManager_execLaunchChunks_Parms
{
	// int                                             NumChunks;                                        		// 0x0000 (0x0004) [0x0000000000000000]              
	// DWORD                                           bNoSpread : 1;                                    		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	// struct FVector                                  SpawnPos;                                         		// 0x0008 (0x000C) [0x0000000000000000]              
	// struct FVector                                  BaseChunkDir;                                     		// 0x0014 (0x000C) [0x0000000000000000]              
	// struct FRotator                                 Rot;                                              		// 0x0020 (0x000C) [0x0000000000000000]              
	// int                                             I;                                                		// 0x002C (0x0004) [0x0000000000000000]              
	// class AProjectile*                              NewChunk;                                         		// 0x0030 (0x0008) [0x0000000000000000]              
	// struct FVector                                  ViewLocation;                                     		// 0x0038 (0x000C) [0x0000000000000000]              
	// struct FRotator                                 ViewRotation;                                     		// 0x0044 (0x000C) [0x0000000000000000]              
	// class AKFPerk*                                  MyPerk;                                           		// 0x0050 (0x0008) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.SetNadeRadiusDebug
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execSetNadeRadiusDebug_Parms
{
	// DWORD                                           bShowRadius : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function KFGame.KFCheatManager.TurnOnAIArenaLight
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execTurnOnAIArenaLight_Parms
{
	// class APointLightToggleable*                    PLT;                                              		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.ConvertFOV
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execConvertFOV_Parms
{
	// float                                           InFOV;                                            		// 0x0000 (0x0004) [0x0000000000000000]              
	// float                                           AspectRatio;                                      		// 0x0004 (0x0004) [0x0000000000000000]              
	// float                                           OriginalAspectRatio;                              		// 0x0008 (0x0004) [0x0000000000000000]              
	// float                                           NewFOV;                                           		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.SetLivingPlayers
// [0x00024202] ( FUNC_Exec )
struct UKFCheatManager_execSetLivingPlayers_Parms
{
	// unsigned char                                   NewLivingPlayers;                                 		// 0x0000 (0x0001) [0x0000000000000000]              
	// DWORD                                           bSoloMode : 1;                                    		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	// class AKFGameInfo*                              KFGI;                                             		// 0x0008 (0x0008) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.ToggleAIDefaultsLog
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execToggleAIDefaultsLog_Parms
{
	// class AKFGameInfo*                              KFGI;                                             		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.DisableAtkAnimDifficultyScaling
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execDisableAtkAnimDifficultyScaling_Parms
{
};

// Function KFGame.KFCheatManager.EnableAtkAnimDifficultyScaling
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execEnableAtkAnimDifficultyScaling_Parms
{
};

// Function KFGame.KFCheatManager.CameraPuke
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execCameraPuke_Parms
{
};

// Function KFGame.KFCheatManager.HeadShotPing
// [0x00020200] ( FUNC_Exec )
struct UKFCheatManager_execHeadShotPing_Parms
{
	// DWORD                                           Value : 1;                                        		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function KFGame.KFCheatManager.CameraBlood
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execCameraBlood_Parms
{
};

// Function KFGame.KFCheatManager.EndRound
// [0x00024202] ( FUNC_Exec )
struct UKFCheatManager_execEndRound_Parms
{
	// DWORD                                           bSkipResults : 1;                                 		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function KFGame.KFCheatManager.ClearCorpses
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execClearCorpses_Parms
{
	// int                                             I;                                                		// 0x0000 (0x0004) [0x0000000000000000]              
	// class AKFGoreManager*                           GoreManager;                                      		// 0x0004 (0x0008) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.ClearSplatters
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execClearSplatters_Parms
{
	// class AKFGoreManager*                           GoreManager;                                      		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.DoSplatterFire
// [0x00820002] 
struct UKFCheatManager_execDoSplatterFire_Parms
{
	// class AKFGoreManager*                           GoreManager;                                      		// 0x0000 (0x0008) [0x0000000000000000]              
	// struct FVector                                  StartTrace;                                       		// 0x0008 (0x000C) [0x0000000000000000]              
	// struct FVector                                  TraceDir;                                         		// 0x0014 (0x000C) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.StopSplatterFire
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execStopSplatterFire_Parms
{
};

// Function KFGame.KFCheatManager.SplatterFire
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execSplatterFire_Parms
{
};

// Function KFGame.KFCheatManager.ToggleSplatterGun
// [0x00820202] ( FUNC_Exec )
struct UKFCheatManager_execToggleSplatterGun_Parms
{
	// struct FKeyBind                                 TempKeyBind;                                      		// 0x0000 (0x001C) [0x0000000000000000]              
	// class UKFPlayerInput*                           KFInput;                                          		// 0x001C (0x0008) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.SetDebugSceneView
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execSetDebugSceneView_Parms
{
};

// Function KFGame.KFCheatManager.SetDebugSceneViewMode
// [0x00020002] 
struct UKFCheatManager_execSetDebugSceneViewMode_Parms
{
	// unsigned char                                   NewViewMode;                                      		// 0x0000 (0x0001) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.PauseDebugSceneUpdate
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execPauseDebugSceneUpdate_Parms
{
};

// Function KFGame.KFCheatManager.ToggleDebugSceneOrbit
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execToggleDebugSceneOrbit_Parms
{
};

// Function KFGame.KFCheatManager.DestroyDebugScene
// [0x00020002] 
struct UKFCheatManager_execDestroyDebugScene_Parms
{
};

// Function KFGame.KFCheatManager.FocusOff
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execFocusOff_Parms
{
};

// Function KFGame.KFCheatManager.AISetFocus
// [0x00024202] ( FUNC_Exec )
struct UKFCheatManager_execAISetFocus_Parms
{
	// DWORD                                           bFocusOnMe : 1;                                   		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           bSetFocalPoint : 1;                               		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           bSetDesiredRot : 1;                               		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           bLockDesiredRot : 1;                              		// 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
	// class AKFAIController*                          KFAIC;                                            		// 0x0010 (0x0008) [0x0000000000000000]              
	// struct FString                                  msg;                                              		// 0x0018 (0x0010) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.AILockDesiredRotation
// [0x00024202] ( FUNC_Exec )
struct UKFCheatManager_execAILockDesiredRotation_Parms
{
	// DWORD                                           bLock : 1;                                        		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// class AKFAIController*                          KFAIC;                                            		// 0x0004 (0x0008) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.AIUnlockDesiredRotation
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execAIUnlockDesiredRotation_Parms
{
	// class AKFAIController*                          KFAIC;                                            		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.AIClearFocus
// [0x00024202] ( FUNC_Exec )
struct UKFCheatManager_execAIClearFocus_Parms
{
	// DWORD                                           bResetDesiredRot : 1;                             		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           bResetFocus : 1;                                  		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           bResetFocalPoint : 1;                             		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	// class AKFAIController*                          KFAIC;                                            		// 0x000C (0x0008) [0x0000000000000000]              
	// struct FString                                  msg;                                              		// 0x0014 (0x0010) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.AISetFocalPoint
// [0x00024202] ( FUNC_Exec )
struct UKFCheatManager_execAISetFocalPoint_Parms
{
	// DWORD                                           bClear : 1;                                       		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// class AKFAIController*                          KFAIC;                                            		// 0x0004 (0x0008) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.ResetDoors
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execResetDoors_Parms
{
	// class AKFDoorActor*                             KFDA;                                             		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.ResetLevel
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execResetLevel_Parms
{
};

// Function KFGame.KFCheatManager.DestroyDoors
// [0x00024202] ( FUNC_Exec )
struct UKFCheatManager_execDestroyDoors_Parms
{
	// unsigned char                                   Reverse;                                          		// 0x0000 (0x0001) [0x0000000000000000]              
	// class AKFDoorActor*                             KFDA;                                             		// 0x0004 (0x0008) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.WeldDoors
// [0x00024202] ( FUNC_Exec )
struct UKFCheatManager_execWeldDoors_Parms
{
	// int                                             inNewIntegrity;                                   		// 0x0000 (0x0004) [0x0000000000000000]              
	// class AKFDoorActor*                             KFDA;                                             		// 0x0004 (0x0008) [0x0000000000000000]              
	// int                                             NewIntegrity;                                     		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.InitDebugScene
// [0x00024002] 
struct UKFCheatManager_execInitDebugScene_Parms
{
	// class AActor*                                   ActorToWatch;                                     		// 0x0000 (0x0008) [0x0000000000000000]              
	// DWORD                                           bTextOnly : 1;                                    		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	// class AKFPlayerController*                      KFPC;                                             		// 0x000C (0x0008) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.FocusOn
// [0x00024202] ( FUNC_Exec )
struct UKFCheatManager_execFocusOn_Parms
{
	// class UClass*                                   FocusClass;                                       		// 0x0000 (0x0008) [0x0000000000000000]              
	// DWORD                                           bTextOnly : 1;                                    		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	// class AActor*                                   PotentialFocusActor;                              		// 0x000C (0x0008) [0x0000000000000000]              
	// class AActor*                                   FirstActor;                                       		// 0x0014 (0x0008) [0x0000000000000000]              
	// DWORD                                           bFound : 1;                                       		// 0x001C (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function KFGame.KFCheatManager.FocusOnZed
// [0x00024202] ( FUNC_Exec )
struct UKFCheatManager_execFocusOnZed_Parms
{
	// DWORD                                           bTextOnly : 1;                                    		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// class UClass*                                   FocusClass;                                       		// 0x0004 (0x0008) [0x0000000000000000]              
	// class AActor*                                   PotentialFocusActor;                              		// 0x000C (0x0008) [0x0000000000000000]              
	// class AActor*                                   FirstActor;                                       		// 0x0014 (0x0008) [0x0000000000000000]              
	// DWORD                                           bFound : 1;                                       		// 0x001C (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function KFGame.KFCheatManager.SpawnBloatTest
// [0x00024202] ( FUNC_Exec )
struct UKFCheatManager_execSpawnBloatTest_Parms
{
	// int                                             SpawnAmount;                                      		// 0x0000 (0x0004) [0x0000000000000000]              
	// DWORD                                           bSimSpawn : 1;                                    		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           bSpawnZeds : 1;                                   		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	// class AKFSpawnVolume*                           SpawnVolume;                                      		// 0x000C (0x0008) [0x0000000000000000]              
	// TArray< class UClass* >                         FakeSpawnList;                                    		// 0x0014 (0x0010) [0x0000000000000000]              
	// int                                             I;                                                		// 0x0024 (0x0004) [0x0000000000000000]              
	// class UClass*                                   TempPawn;                                         		// 0x0028 (0x0008) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.SpawnTest
// [0x00024202] ( FUNC_Exec )
struct UKFCheatManager_execSpawnTest_Parms
{
	// int                                             SpawnAmount;                                      		// 0x0000 (0x0004) [0x0000000000000000]              
	// DWORD                                           bSimSpawn : 1;                                    		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           bSpawnZeds : 1;                                   		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	// class AKFSpawnVolume*                           SpawnVolume;                                      		// 0x000C (0x0008) [0x0000000000000000]              
	// TArray< class UClass* >                         FakeSpawnList;                                    		// 0x0014 (0x0010) [0x0000000000000000]              
	// int                                             I;                                                		// 0x0024 (0x0004) [0x0000000000000000]              
	// class UClass*                                   TempPawn;                                         		// 0x0028 (0x0008) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.SetSpawnVolumeMinDebug
// [0x00020202] ( FUNC_Exec )
struct UKFCheatManager_execSetSpawnVolumeMinDebug_Parms
{
	// DWORD                                           bNewMinDebug : 1;                                 		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// class AKFSpawnVolume*                           SpawnVolume;                                      		// 0x0004 (0x0008) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.SetSpawnVolumeDebug
// [0x00024202] ( FUNC_Exec )
struct UKFCheatManager_execSetSpawnVolumeDebug_Parms
{
	// DWORD                                           bSpawnDebug : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           bDebugRating : 1;                                 		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           bDebugVisibility : 1;                             		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	// class AKFSpawnVolume*                           SpawnVolume;                                      		// 0x000C (0x0008) [0x0000000000000000]              
	// class AKFSpawner*                               Spawner;                                          		// 0x0014 (0x0008) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.TestSpawnVolume
// [0x00024202] ( FUNC_Exec )
struct UKFCheatManager_execTestSpawnVolume_Parms
{
	// int                                             SpawnAmount;                                      		// 0x0000 (0x0004) [0x0000000000000000]              
	// DWORD                                           bCrawlersOnly : 1;                                		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           bBloatsOnly : 1;                                  		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	// class AKFSpawnVolume*                           SpawnVolume;                                      		// 0x000C (0x0008) [0x0000000000000000]              
	// class AKFSpawnVolume*                           ClosestSpawnVolume;                               		// 0x0014 (0x0008) [0x0000000000000000]              
	// TArray< class UClass* >                         FakeSpawnList;                                    		// 0x001C (0x0010) [0x0000000000000000]              
	// int                                             I;                                                		// 0x002C (0x0004) [0x0000000000000000]              
	// class UClass*                                   TempPawn;                                         		// 0x0030 (0x0008) [0x0000000000000000]              
};

// Function KFGame.KFCheatManager.TestPortalActive
// [0x00024202] ( FUNC_Exec )
struct UKFCheatManager_execTestPortalActive_Parms
{
	// struct FString                                  ZedName;                                          		// 0x0000 (0x0010) [0x0000000000000000]              
