/*
#############################################################################################
# Killing Floor 2 (1.8787) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: kfgamecontent_f_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function kfgamecontent.KFAIController_ZedPatriarch.DrawDebug
// [0x00020102] 
struct AKFAIController_ZedPatriarch_execDrawDebug_Parms
{
	// class AKFHUDBase*                               HUD;                                              		// 0x0000 (0x0008) [0x0000000000000000]              
	// struct FName                                    Category;                                         		// 0x0008 (0x0008) [0x0000000000000000]              
	// class UCanvas*                                  C;                                                		// 0x0010 (0x0008) [0x0000000000000000]              
};

// Function kfgamecontent.KFAIController_ZedPatriarch.PlayDamagePlayerDialog
// [0x00020000] 
struct AKFAIController_ZedPatriarch_execPlayDamagePlayerDialog_Parms
{
	// class UClass*                                   dmgType;                                          		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function kfgamecontent.KFAIController_ZedPatriarch.EnterZedVictoryState
// [0x00020002] 
struct AKFAIController_ZedPatriarch_execEnterZedVictoryState_Parms
{
};

// Function kfgamecontent.KFAIController_ZedPatriarch.ForceHeal
// [0x00020002] 
struct AKFAIController_ZedPatriarch_execForceHeal_Parms
{
};

// Function kfgamecontent.KFAIController_ZedPatriarch.NotifyFleeFinished
// [0x00024002] 
struct AKFAIController_ZedPatriarch_execNotifyFleeFinished_Parms
{
	// DWORD                                           bAcquireNewEnemy : 1;                             		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function kfgamecontent.KFAIController_ZedPatriarch.Flee
// [0x00020002] 
struct AKFAIController_ZedPatriarch_execFlee_Parms
{
	// class AActor*                                   FleeFromTarget;                                   		// 0x0000 (0x0008) [0x0000000000000000]              
	// float                                           FleeDuration;                                     		// 0x0008 (0x0004) [0x0000000000000000]              
	// class UAICommand_SpecialMove*                   AICSM;                                            		// 0x000C (0x0008) [0x0000000000000000]              
};

// Function kfgamecontent.KFAIController_ZedPatriarch.DoFleeFrom
// [0x00024002] 
struct AKFAIController_ZedPatriarch_execDoFleeFrom_Parms
{
	// class AActor*                                   FleeFrom;                                         		// 0x0000 (0x0008) [0x0000000000000000]              
	// float                                           FleeDuration;                                     		// 0x0008 (0x0004) [0x0000000000000000]              
	// float                                           FleeDistance;                                     		// 0x000C (0x0004) [0x0000000000000000]              
	// DWORD                                           bShouldStopAtGoal : 1;                            		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           bFromFear : 1;                                    		// 0x0014 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function kfgamecontent.KFAIController_ZedPatriarch.DoHeavyZedBump
// [0x00020002] 
struct AKFAIController_ZedPatriarch_execDoHeavyZedBump_Parms
{
	// class AActor*                                   Other;                                            		// 0x0000 (0x0008) [0x0000000000000000]              
	// struct FVector                                  HitNormal;                                        		// 0x0008 (0x000C) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000000] [0x00000001] 
	// int                                             BumpEffectDamage;                                 		// 0x0018 (0x0004) [0x0000000000000000]              
	// class AKFPawn_Monster*                          BumpedMonster;                                    		// 0x001C (0x0008) [0x0000000000000000]              
};

// Function kfgamecontent.KFAIController_ZedPatriarch.DoHeavyBump
// [0x00020002] 
struct AKFAIController_ZedPatriarch_execDoHeavyBump_Parms
{
	// class AActor*                                   Other;                                            		// 0x0000 (0x0008) [0x0000000000000000]              
	// struct FVector                                  HitNormal;                                        		// 0x0008 (0x000C) [0x0000000000000000]              
	// class AKFPawn_Human*                            KFPH;                                             		// 0x0014 (0x0008) [0x0000000000000000]              
};

// Function kfgamecontent.KFAIController_ZedPatriarch.Timer_SearchForChargeObstructions
// [0x00020002] 
struct AKFAIController_ZedPatriarch_execTimer_SearchForChargeObstructions_Parms
{
	// class AKFPawn*                                  ObstructingEnemy;                                 		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function kfgamecontent.KFAIController_ZedPatriarch.Timer_SearchForFleeObstructions
// [0x00020002] 
struct AKFAIController_ZedPatriarch_execTimer_SearchForFleeObstructions_Parms
{
	// class AKFPawn*                                  ObstructingEnemy;                                 		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function kfgamecontent.KFAIController_ZedPatriarch.NextBattlePhase
// [0x00020002] 
struct AKFAIController_ZedPatriarch_execNextBattlePhase_Parms
{
};

// Function kfgamecontent.KFAIController_ZedPatriarch.Timer_StopSummoningZeds
// [0x00020002] 
struct AKFAIController_ZedPatriarch_execTimer_StopSummoningZeds_Parms
{
};

// Function kfgamecontent.KFAIController_ZedPatriarch.AmIAllowedToSuicideWhenStuck
// [0x00020002] 
struct AKFAIController_ZedPatriarch_execAmIAllowedToSuicideWhenStuck_Parms
{
	// DWORD                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function kfgamecontent.KFAIController_ZedPatriarch.Timer_RageTimeOut
// [0x00020002] 
struct AKFAIController_ZedPatriarch_execTimer_RageTimeOut_Parms
{
};

// Function kfgamecontent.KFAIController_ZedPatriarch.UpdateRageState
// [0x00020002] 
struct AKFAIController_ZedPatriarch_execUpdateRageState_Parms
{
	// float                                           DistSq;                                           		// 0x0000 (0x0004) [0x0000000000000000]              
	// float                                           BestDistSq;                                       		// 0x0004 (0x0004) [0x0000000000000000]              
	// class AKFPawn*                                  KFP;                                              		// 0x0008 (0x0008) [0x0000000000000000]              
	// class AKFPawn*                                  BestTarget;                                       		// 0x0010 (0x0008) [0x0000000000000000]              
	// int                                             I;                                                		// 0x0018 (0x0004) [0x0000000000000000]              
};

// Function kfgamecontent.KFAIController_ZedPatriarch.StartPaternalInstinct
// [0x00020002] 
struct AKFAIController_ZedPatriarch_execStartPaternalInstinct_Parms
{
};

// Function kfgamecontent.KFAIController_ZedPatriarch.NotifyTakeHit
// [0x00820002] 
struct AKFAIController_ZedPatriarch_execNotifyTakeHit_Parms
{
	// class AController*                              InstigatedBy;                                     		// 0x0000 (0x0008) [0x0000000000000000]              
	// struct FVector                                  HitLocation;                                      		// 0x0008 (0x000C) [0x0000000000000000]              
	// int                                             Damage;                                           		// 0x0014 (0x0004) [0x0000000000000000]              
	// class UClass*                                   DamageType;                                       		// 0x0018 (0x0008) [0x0000000000000000]              
	// struct FVector                                  Momentum;                                         		// 0x0020 (0x000C) [0x0000000000000000]              
	// class AKFPawn*                                  EnemyPawn;                                        		// 0x002C (0x0008) [0x0000000000000000]              
	// int                                             EnemyIndex;                                       		// 0x0034 (0x0004) [0x0000000000000000]              
	// int                                             pawnDmg;                                          		// 0x0038 (0x0004) [0x0000000000000000]              
	// struct FVector                                  pawnRotToVec;                                     		// 0x003C (0x000C) [0x0000000000000000]              
};

// Function kfgamecontent.KFAIController_ZedPatriarch.NotifyKilled
// [0x00020002] 
struct AKFAIController_ZedPatriarch_execNotifyKilled_Parms
{
	// class AController*                              Killer;                                           		// 0x0000 (0x0008) [0x0000000000000000]              
	// class AController*                              Killed;                                           		// 0x0008 (0x0008) [0x0000000000000000]              
	// class APawn*                                    KilledPawn;                                       		// 0x0010 (0x0008) [0x0000000000000000]              
	// class UClass*                                   DamageType;                                       		// 0x0018 (0x0008) [0x0000000000000000]              
};

// Function kfgamecontent.KFAIController_ZedPatriarch.NotifyMeleeDamageDealt
// [0x00020002] 
struct AKFAIController_ZedPatriarch_execNotifyMeleeDamageDealt_Parms
{
};

// Function kfgamecontent.KFAIController_ZedPatriarch.NotifySpecialMoveEnded
// [0x00020002] 
struct AKFAIController_ZedPatriarch_execNotifySpecialMoveEnded_Parms
{
	// class UKFSpecialMove*                           SM;                                               		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function kfgamecontent.KFAIController_ZedPatriarch.NotifyCommandFinished
// [0x00020002] 
struct AKFAIController_ZedPatriarch_execNotifyCommandFinished_Parms
{
	// class UAICommand*                               FinishedCommand;                                  		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function kfgamecontent.KFAIController_ZedPatriarch.NotifyAttackActor
// [0x00020000] 
struct AKFAIController_ZedPatriarch_execNotifyAttackActor_Parms
{
	// class AActor*                                   A;                                                		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function kfgamecontent.KFAIController_ZedPatriarch.DoorFinished
// [0x00020002] 
struct AKFAIController_ZedPatriarch_execDoorFinished_Parms
{
	// DWORD                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           bSuperFinished : 1;                               		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function kfgamecontent.KFAIController_ZedPatriarch.NotifyAttackDoor
// [0x00020002] 
struct AKFAIController_ZedPatriarch_execNotifyAttackDoor_Parms
{
	// class AKFDoorActor*                             door;                                             		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function kfgamecontent.KFAIController_ZedPatriarch.SomeEnemiesAreHidden
// [0x00020002] 
struct AKFAIController_ZedPatriarch_execSomeEnemiesAreHidden_Parms
{
	// DWORD                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// class AKFPawn*                                  KFP;                                              		// 0x0004 (0x0008) [0x0000000000000000]              
	// float                                           TargetDist;                                       		// 0x000C (0x0004) [0x0000000000000000]              
	// int                                             I;                                                		// 0x0010 (0x0004) [0x0000000000000000]              
	// int                                             NumValidHiddenEnemies;                            		// 0x0014 (0x0004) [0x0000000000000000]              
};

// Function kfgamecontent.KFAIController_ZedPatriarch.IsCeilingClear
// [0x00820002] 
struct AKFAIController_ZedPatriarch_execIsCeilingClear_Parms
{
	// DWORD                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// struct FVector                                  TraceStart;                                       		// 0x0004 (0x000C) [0x0000000000000000]              
	// struct FVector                                  TraceEnd;                                         		// 0x0010 (0x000C) [0x0000000000000000]              
	// struct FVector                                  Extent;                                           		// 0x001C (0x000C) [0x0000000000000000]              
};

// Function kfgamecontent.KFAIController_ZedPatriarch.CanSetSprinting
// [0x00020002] 
struct AKFAIController_ZedPatriarch_execCanSetSprinting_Parms
{
	// DWORD                                           bNewSprintStatus : 1;                             		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function kfgamecontent.KFAIController_ZedPatriarch.ShouldSprint
// [0x00020002] 
struct AKFAIController_ZedPatriarch_execShouldSprint_Parms
{
	// DWORD                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function kfgamecontent.KFAIController_ZedPatriarch.EvaluateSprinting
// [0x00020002] 
struct AKFAIController_ZedPatriarch_execEvaluateSprinting_Parms
{
};

// Function kfgamecontent.KFAIController_ZedPatriarch.DoStrike
// [0x00020002] 
struct AKFAIController_ZedPatriarch_execDoStrike_Parms
{
	// struct FName                                    AttackName;                                       		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function kfgamecontent.KFAIController_ZedPatriarch.GetAdjustedAimFor
// [0x00020002] 
struct AKFAIController_ZedPatriarch_execGetAdjustedAimFor_Parms
{
	// class AWeapon*                                  W;                                                		// 0x0000 (0x0008) [0x0000000000000000]              
	// struct FVector                                  StartFireLoc;                                     		// 0x0008 (0x000C) [0x0000000000000000]              
	// struct FRotator                                 ReturnValue;                                      		// 0x0014 (0x000C) [0x0000000000000000]              
};

// Function kfgamecontent.KFAIController_ZedPatriarch.IsWeaponArmClear
// [0x00820002] 
struct AKFAIController_ZedPatriarch_execIsWeaponArmClear_Parms
{
	// struct FVector                                  EndTrace;                                         		// 0x0000 (0x000C) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
	// struct FVector                                  StartTrace;                                       		// 0x0010 (0x000C) [0x0000000000000000]              
};

// Function kfgamecontent.KFAIController_ZedPatriarch.EvaluateAttacks
// [0x00020002] 
struct AKFAIController_ZedPatriarch_execEvaluateAttacks_Parms
{
	// float                                           DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000000]              
	// DWORD                                           bCanFireMinigun : 1;                              		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           bCanFireMissile : 1;                              		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           bCanFireMortar : 1;                               		// 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           bShouldFireMortar : 1;                            		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           bShouldFireMissile : 1;                           		// 0x0014 (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           bMortarBarrage : 1;                               		// 0x0018 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function kfgamecontent.KFAIController_ZedPatriarch.UpdateRecentlySeenEnemyList
// [0x00020002] 
struct AKFAIController_ZedPatriarch_execUpdateRecentlySeenEnemyList_Parms
{
	// int                                             I;                                                		// 0x0000 (0x0004) [0x0000000000000000]              
	// DWORD                                           bWantsNewEnemy : 1;                               		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function kfgamecontent.KFAIController_ZedPatriarch.SeePlayer
// [0x00820802] ( FUNC_Event )
struct AKFAIController_ZedPatriarch_eventSeePlayer_Parms
{
	// class APawn*                                    Seen;                                             		// 0x0000 (0x0008) [0x0000000000000000]              
	// int                                             EnemyListIndex;                                   		// 0x0008 (0x0004) [0x0000000000000000]              
	// int                                             HiddenEnemyIndex;                                 		// 0x000C (0x0004) [0x0000000000000000]              
	// struct FPatriarch_TrackedEnemyInfo              NewTrackedEnemy;                                  		// 0x0010 (0x0020) [0x0000000000000000]              
	// class AKFPawn*                                  KFP;                                              		// 0x0030 (0x0008) [0x0000000000000000]              
};

// Function kfgamecontent.KFAIController_ZedPatriarch.Tick
// [0x00020102] 
struct AKFAIController_ZedPatriarch_execTick_Parms
{
	// float                                           DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function kfgamecontent.KFAIController_ZedPatriarch.SetBestTarget
// [0x00C24002] 
struct AKFAIController_ZedPatriarch_execSetBestTarget_Parms
{
	// TArray< class AKFPawn* >                        RecentTargets;                                    		// 0x0000 (0x0010) [0x0000000000000000]              
	// float                                           MinDistSQ;                                        		// 0x0010 (0x0004) [0x0000000000000000]              
	// float                                           MaxDistSQ;                                        		// 0x0014 (0x0004) [0x0000000000000000]              
	// float                                           ClampFOV;                                         		// 0x0018 (0x0004) [0x0000000000000000]              
	// DWORD                                           bPreferFurtherTargets : 1;                        		// 0x001C (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           bIsWeaponAttack : 1;                              		// 0x0020 (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           ReturnValue : 1;                                  		// 0x0024 (0x0004) [0x0000000000000000] [0x00000001] 
	// class AKFPawn_Human*                            KFPH;                                             		// 0x0028 (0x0008) [0x0000000000000000]              
	// class AKFPawn*                                  KFP;                                              		// 0x0030 (0x0008) [0x0000000000000000]              
	// class AKFPawn*                                  BestTarget;                                       		// 0x0038 (0x0008) [0x0000000000000000]              
	// int                                             I;                                                		// 0x0040 (0x0004) [0x0000000000000000]              
	// int                                             FoundIndex;                                       		// 0x0044 (0x0004) [0x0000000000000000]              
	// int                                             BestIndex;                                        		// 0x0048 (0x0004) [0x0000000000000000]              
	// float                                           TempRating;                                       		// 0x004C (0x0004) [0x0000000000000000]              
	// float                                           BestRating;                                       		// 0x0050 (0x0004) [0x0000000000000000]              
	// struct FVector                                  TempDist;                                         		// 0x0054 (0x000C) [0x0000000000000000]              
};

// Function kfgamecontent.KFAIController_ZedPatriarch.ChangeEnemy
// [0x00024802] ( FUNC_Event )
struct AKFAIController_ZedPatriarch_eventChangeEnemy_Parms
{
	// class APawn*                                    NewEnemy;                                         		// 0x0000 (0x0008) [0x0000000000000000]              
	// DWORD                                           bCanTaunt : 1;                                    		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	// class APawn*                                    OldEnemy;                                         		// 0x000C (0x0008) [0x0000000000000000]              
};

// Function kfgamecontent.KFAIController_ZedPatriarch.ForceSetEnemy
// [0x00020002] 
struct AKFAIController_ZedPatriarch_execForceSetEnemy_Parms
{
	// class APawn*                                    NewEnemy;                                         		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function kfgamecontent.KFAIController_ZedPatriarch.SetEnemy
// [0x00020802] ( FUNC_Event )
struct AKFAIController_ZedPatriarch_eventSetEnemy_Parms
{
	// class APawn*                                    NewEnemy;                                         		// 0x0000 (0x0008) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function kfgamecontent.KFAIController_ZedPatriarch.FindNewEnemy
// [0x00020802] ( FUNC_Event )
struct AKFAIController_ZedPatriarch_eventFindNewEnemy_Parms
{
	// DWORD                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function kfgamecontent.KFAIController_ZedPatriarch.GetAggroRating
// [0x00020002] 
struct AKFAIController_ZedPatriarch_execGetAggroRating_Parms
{
	// class AKFPawn*                                  KFP;                                              		// 0x0000 (0x0008) [0x0000000000000000]              
	// float                                           ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000000]              
	// int                                             EnemyIndex;                                       		// 0x000C (0x0004) [0x0000000000000000]              
	// float                                           AggroDmg;                                         		// 0x0010 (0x0004) [0x0000000000000000]              
};

// Function kfgamecontent.KFAIController_ZedPatriarch.CanSwitchEnemies
// [0x00020002] 
struct AKFAIController_ZedPatriarch_execCanSwitchEnemies_Parms
{
	// DWORD                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function kfgamecontent.KFAIController_ZedPatriarch.IsAggroEnemySwitchAllowed
// [0x00020002] 
struct AKFAIController_ZedPatriarch_execIsAggroEnemySwitchAllowed_Parms
{
	// DWORD                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function kfgamecontent.KFAIController_ZedPatriarch.Destroyed
// [0x00020902] ( FUNC_Event )
struct AKFAIController_ZedPatriarch_eventDestroyed_Parms
{
};

// Function kfgamecontent.KFAIController_ZedPatriarch.PawnDied
// [0x00020002] 
struct AKFAIController_ZedPatriarch_execPawnDied_Parms
{
	// class APawn*                                    inPawn;                                           		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function kfgamecontent.KFAIController_ZedPatriarch.Possess
// [0x00020802] ( FUNC_Event )
struct AKFAIController_ZedPatriarch_eventPossess_Parms
{
	// class APawn*                                    inPawn;                                           		// 0x0000 (0x0008) [0x0000000000000000]              
	// DWORD                                           bVehicleTransition : 1;                           		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function kfgamecontent.AICommand_FleshpoundKing_ChestBeamAttack.Popped
// [0x00020002] 
struct UAICommand_FleshpoundKing_ChestBeamAttack_execPopped_Parms
{
};

// Function kfgamecontent.AICommand_FleshpoundKing_ChestBeamAttack.Pushed
// [0x00020002] 
struct UAICommand_FleshpoundKing_ChestBeamAttack_execPushed_Parms
{
};

// Function kfgamecontent.AICommand_FleshpoundKing_ChestBeamAttack.ChestBeamAttack
// [0x00022002] 
struct UAICommand_FleshpoundKing_ChestBeamAttack_execChestBeamAttack_Parms
{
	// class AKFAIController_ZedFleshpoundKing*        AI;                                               		// 0x0000 (0x0008) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	// class UAICommand_FleshpoundKing_ChestBeamAttack* Cmd;                                              		// 0x000C (0x0008) [0x0000000000000000]              
};

// Function kfgamecontent.KFAIController_ZedFleshpoundKing.ForceTargetChange
// [0x00020002] 
struct AKFAIController_ZedFleshpoundKing_execForceTargetChange_Parms
{
	// class APawn*                                    NewEnemy;                                         		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function kfgamecontent.KFAIController_ZedFleshpoundKing.ChangeEnemy
// [0x00024802] ( FUNC_Event )
struct AKFAIController_ZedFleshpoundKing_eventChangeEnemy_Parms
{
	// class APawn*                                    NewEnemy;                                         		// 0x0000 (0x0008) [0x0000000000000000]              
	// DWORD                                           bCanTaunt : 1;                                    		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function kfgamecontent.KFAIController_ZedFleshpoundKing.SetEnemy
// [0x00020802] ( FUNC_Event )
struct AKFAIController_ZedFleshpoundKing_eventSetEnemy_Parms
{
	// class APawn*                                    NewEnemy;                                         		// 0x0000 (0x0008) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function kfgamecontent.KFAIController_ZedFleshpoundKing.FindNewEnemy
// [0x00020802] ( FUNC_Event )
struct AKFAIController_ZedFleshpoundKing_eventFindNewEnemy_Parms
{
	// DWORD                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function kfgamecontent.KFAIController_ZedFleshpoundKing.CanSwitchEnemies
// [0x00020002] 
struct AKFAIController_ZedFleshpoundKing_execCanSwitchEnemies_Parms
{
	// DWORD                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function kfgamecontent.KFAIController_ZedFleshpoundKing.NotifySpecialMoveEnded
// [0x00020002] 
struct AKFAIController_ZedFleshpoundKing_execNotifySpecialMoveEnded_Parms
{
	// class UKFSpecialMove*                           SM;                                               		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function kfgamecontent.KFAIController_ZedFleshpoundKing.TransitionToPhase
// [0x00020002] 
struct AKFAIController_ZedFleshpoundKing_execTransitionToPhase_Parms
{
	// int                                             NewPhase;                                         		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function kfgamecontent.KFAIController_ZedFleshpoundKing.NotifyTakeHit
// [0x00020002] 
struct AKFAIController_ZedFleshpoundKing_execNotifyTakeHit_Parms
{
	// class AController*                              InstigatedBy;                                     		// 0x0000 (0x0008) [0x0000000000000000]              
	// struct FVector                                  HitLocation;                                      		// 0x0008 (0x000C) [0x0000000000000000]              
	// int                                             Damage;                                           		// 0x0014 (0x0004) [0x0000000000000000]              
	// class UClass*                                   DamageType;                                       		// 0x0018 (0x0008) [0x0000000000000000]              
	// struct FVector                                  Momentum;                                         		// 0x0020 (0x000C) [0x0000000000000000]              
	// float                                           CurrentHealth;                                    		// 0x002C (0x0004) [0x0000000000000000]              
};

// Function kfgamecontent.KFAIController_ZedFleshpoundKing.CheckForBeamAttack
// [0x00820002] 
struct AKFAIController_ZedFleshpoundKing_execCheckForBeamAttack_Parms
{
	// class APawn*                                    P;                                                		// 0x0000 (0x0008) [0x0000000000000000]              
	// class APawn*                                    BestTarget;                                       		// 0x0008 (0x0008) [0x0000000000000000]              
	// float                                           MaxBeamTargetDistSQ;                              		// 0x0010 (0x0004) [0x0000000000000000]              
	// float                                           Dist;                                             		// 0x0014 (0x0004) [0x0000000000000000]              
	// float                                           DotAngle;                                         		// 0x0018 (0x0004) [0x0000000000000000]              
	// float                                           Rating;                                           		// 0x001C (0x0004) [0x0000000000000000]              
	// float                                           BestRating;                                       		// 0x0020 (0x0004) [0x0000000000000000]              
	// struct FVector                                  Projection;                                       		// 0x0024 (0x000C) [0x0000000000000000]              
	// struct FVector                                  PawnDir;                                          		// 0x0030 (0x000C) [0x0000000000000000]              
};

// Function kfgamecontent.KFAIController_ZedFleshpoundKing.Tick
// [0x00020902] ( FUNC_Event )
struct AKFAIController_ZedFleshpoundKing_eventTick_Parms
{
	// float                                           DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function kfgamecontent.KFAIController_ZedFleshpoundKing.SeePlayer
// [0x00020802] ( FUNC_Event )
struct AKFAIController_ZedFleshpoundKing_eventSeePlayer_Parms
{
	// class APawn*                                    Seen;                                             		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function kfgamecontent.KFAIController_ZedFleshpoundKing.Possess
// [0x00020802] ( FUNC_Event )
struct AKFAIController_ZedFleshpoundKing_eventPossess_Parms
{
	// class APawn*                                    inPawn;                                           		// 0x0000 (0x0008) [0x0000000000000000]              
	// DWORD                                           bVehicleTransition : 1;                           		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	// class AKFGameReplicationInfo*                   KFGRI;                                            		// 0x000C (0x0008) [0x0000000000000000]              
};

// Function kfgamecontent.KFDifficulty_FleshpoundKing.GetChestBeamCooldownTime
// [0x00022002] 
struct UKFDifficulty_FleshpoundKing_execGetChestBeamCooldownTime_Parms
{
	// class AKFGameReplicationInfo*                   KFGRI;                                            		// 0x0000 (0x0008) [0x0000000000000000]              
	// float                                           ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function kfgamecontent.AICommand_Husk_Suicide.GetSpecialMove
// [0x00020000] 
struct UAICommand_Husk_Suicide_execGetSpecialMove_Parms
{
	// unsigned char                                   ReturnValue;                                      		// 0x0000 (0x0001) [0x0000000000000000]              
};

// Function kfgamecontent.AICommand_Husk_Suicide.Popped
// [0x00020002] 
struct UAICommand_Husk_Suicide_execPopped_Parms
{
};

// Function kfgamecontent.AICommand_Husk_Suicide.Paused
// [0x00020002] 
struct UAICommand_Husk_Suicide_execPaused_Parms
{
	// class UGameAICommand*                           NewCommand;                                       		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function kfgamecontent.AICommand_Husk_Suicide.Resumed
// [0x00020002] 
struct UAICommand_Husk_Suicide_execResumed_Parms
{
	// struct FName                                    OldCommandName;                                   		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function kfgamecontent.AICommand_Husk_Suicide.Pushed
// [0x00020002] 
struct UAICommand_Husk_Suicide_execPushed_Parms
{
};

// Function kfgamecontent.AICommand_Husk_Suicide.Suicide
// [0x00022002] 
struct UAICommand_Husk_Suicide_execSuicide_Parms
{
	// class AKFAIController_ZedHusk*                  AI;                                               		// 0x0000 (0x0008) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	// class UAICommand_Husk_Suicide*                  Cmd;                                              		// 0x000C (0x0008) [0x0000000000000000]              
};

// Function kfgamecontent.KFAIController_ZedHusk.DebugAimError
// [0x00820002] 
struct AKFAIController_ZedHusk_execDebugAimError_Parms
{
	// int                                             I;                                                		// 0x0000 (0x0004) [0x0000000000000000]              
	// class AKFDebugLines*                            KFDL;                                             		// 0x0004 (0x0008) [0x0000000000000000]              
	// struct FVector                                  SocketLocation;                                   		// 0x000C (0x000C) [0x0000000000000000]              
	// struct FVector                                  DirToEnemy;                                       		// 0x0018 (0x000C) [0x0000000000000000]              
	// struct FRotator                                 SocketRotation;                                   		// 0x0024 (0x000C) [0x0000000000000000]              
};

// Function kfgamecontent.KFAIController_ZedHusk.ShootFireball
// [0x00820002] 
struct AKFAIController_ZedHusk_execShootFireball_Parms
{
	// class UClass*                                   FireballClass;                                    		// 0x0000 (0x0008) [0x0000000000000000]              
	// struct FVector                                  FireballOffset;                                   		// 0x0008 (0x000C) [0x0000000000000000]              
	// struct FVector                                  SocketLocation;                                   		// 0x0014 (0x000C) [0x0000000000000000]              
	// struct FVector                                  DirToEnemy;                                       		// 0x0020 (0x000C) [0x0000000000000000]              
	// struct FVector                                  HitLocation;                                      		// 0x002C (0x000C) [0x0000000000000000]              
	// struct FVector                                  HitNormal;                                        		// 0x0038 (0x000C) [0x0000000000000000]              
	// class AKFProj_Husk_Fireball*                    MyFireball;                                       		// 0x0044 (0x0008) [0x0000000000000000]              
	// class AActor*                                   HitActor;                                         		// 0x004C (0x0008) [0x0000000000000000]              
	// struct FVector                                  AimLocation;                                      		// 0x0054 (0x000C) [0x0000000000000000]              
	// struct FVector                                  GroundAimLocation;                                		// 0x0060 (0x000C) [0x0000000000000000]              
	// float                                           SplashAimChance;                                  		// 0x006C (0x0004) [0x0000000000000000]              
	// struct FVector                                  randVectorDraw;                                   		// 0x0070 (0x000C) [0x0000000000000000]              
	// float                                           randDraw;                                         		// 0x007C (0x0004) [0x0000000000000000]              
	// struct FVector                                  displacementToHitLoc;                             		// 0x0080 (0x000C) [0x0000000000000000]              
	// float                                           distanceToHitLoc;                                 		// 0x008C (0x0004) [0x0000000000000000]              
	// class AKFPawn_ZedHusk*                          MyHuskPawn;                                       		// 0x0090 (0x0008) [0x0000000000000000]              
};

// Function kfgamecontent.KFAIController_ZedHusk.DoStrike
// [0x00020002] 
struct AKFAIController_ZedHusk_execDoStrike_Parms
{
};

// Function kfgamecontent.KFAIController_ZedHusk.ShouldSprint
// [0x00020002] 
struct AKFAIController_ZedHusk_execShouldSprint_Parms
{
	// DWORD                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function kfgamecontent.KFAIController_ZedHusk.SetEnemy
// [0x00020802] ( FUNC_Event )
struct AKFAIController_ZedHusk_eventSetEnemy_Parms
{
	// class APawn*                                    NewEnemy;                                         		// 0x0000 (0x0008) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function kfgamecontent.KFAIController_ZedHusk.CanDoFireball
// [0x00020002] 
struct AKFAIController_ZedHusk_execCanDoFireball_Parms
{
	// float                                           DistToTargetSq;                                   		// 0x0000 (0x0004) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function kfgamecontent.KFAIController_ZedHusk.CanDoFlamethrower
// [0x00020002] 
struct AKFAIController_ZedHusk_execCanDoFlamethrower_Parms
{
	// float                                           DistToTargetSq;                                   		// 0x0000 (0x0004) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function kfgamecontent.KFAIController_ZedHusk.CanDoSuicide
// [0x00020002] 
struct AKFAIController_ZedHusk_execCanDoSuicide_Parms
{
	// float                                           DistToTargetSq;                                   		// 0x0000 (0x0004) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function kfgamecontent.KFAIController_ZedHusk.IsSuicidal
// [0x00020002] 
struct AKFAIController_ZedHusk_execIsSuicidal_Parms
{
	// DWORD                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function kfgamecontent.KFAIController_ZedHusk.Tick
// [0x00020102] 
struct AKFAIController_ZedHusk_execTick_Parms
{
	// float                                           DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000000]              
	// float                                           DistToTargetSq;                                   		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function kfgamecontent.KFAIController_ZedHusk.PostBeginPlay
// [0x00020802] ( FUNC_Event )
struct AKFAIController_ZedHusk_eventPostBeginPlay_Parms
{
	// class AKFGameInfo*                              KFGI;                                             		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function kfgamecontent.KFAIController_ZedHusk.Possess
// [0x00020802] ( FUNC_Event )
struct AKFAIController_ZedHusk_eventPossess_Parms
{
	// class APawn*                                    inPawn;                                           		// 0x0000 (0x0008) [0x0000000000000000]              
	// DWORD                                           bVehicleTransition : 1;                           		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function kfgamecontent.KFAIController_ZedHusk.IsNearDoor
// [0x00020002] 
struct AKFAIController_ZedHusk_execIsNearDoor_Parms
{
	// DWORD                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function kfgamecontent.AICommand_HuskFireBallAttack.HandleAICommandSpecialAction
// [0x00020802] ( FUNC_Event )
struct UAICommand_HuskFireBallAttack_eventHandleAICommandSpecialAction_Parms
{
};

// Function kfgamecontent.AICommand_HuskFireBallAttack.Popped
// [0x00020002] 
struct UAICommand_HuskFireBallAttack_execPopped_Parms
{
};

// Function kfgamecontent.AICommand_HuskFireBallAttack.Pushed
// [0x00020002] 
struct UAICommand_HuskFireBallAttack_execPushed_Parms
{
};

// Function kfgamecontent.AICommand_HuskFireBallAttack.FireBallAttack
// [0x00022002] 
struct UAICommand_HuskFireBallAttack_execFireBallAttack_Parms
{
	// class AKFAIController_ZedHusk*                  AI;                                               		// 0x0000 (0x0008) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	// class UAICommand_HuskFireBallAttack*            Cmd;                                              		// 0x000C (0x0008) [0x0000000000000000]              
};

// Function kfgamecontent.KFSM_Husk_FireBallAttack.CanOverrideMoveWith
// [0x00020002] 
struct UKFSM_Husk_FireBallAttack_execCanOverrideMoveWith_Parms
{
	// struct FName                                    NewMove;                                          		// 0x0000 (0x0008) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function kfgamecontent.KFSM_Husk_FireBallAttack.SpecialMoveEnded
// [0x00020002] 
struct UKFSM_Husk_FireBallAttack_execSpecialMoveEnded_Parms
{
	// struct FName                                    PrevMove;                                         		// 0x0000 (0x0008) [0x0000000000000000]              
	// struct FName                                    NextMove;                                         		// 0x0008 (0x0008) [0x0000000000000000]              
};

// Function kfgamecontent.KFSM_Husk_FireBallAttack.NotifyFireballFired
// [0x00020002] 
struct UKFSM_Husk_FireBallAttack_execNotifyFireballFired_Parms
{
};

// Function kfgamecontent.KFSM_Husk_FireBallAttack.PlayAnimation
// [0x00020002] 
struct UKFSM_Husk_FireBallAttack_execPlayAnimation_Parms
{
	// int                                             AnimNum;                                          		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function kfgamecontent.KFSM_Husk_FireBallAttack.SpecialMoveStarted
// [0x00020002] 
struct UKFSM_Husk_FireBallAttack_execSpecialMoveStarted_Parms
{
	// DWORD                                           bForced : 1;                                      		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// struct FName                                    PrevMove;                                         		// 0x0004 (0x0008) [0x0000000000000000]              
};

// Function kfgamecontent.KFSM_Husk_FireBallAttack.GetFireOffset
// [0x00020002] 
struct UKFSM_Husk_FireBallAttack_execGetFireOffset_Parms
{
	// struct FVector                                  ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000000000]              
};

// Function kfgamecontent.KFSM_Husk_FireBallAttack.InternalCanDoSpecialMove
// [0x00080002] 
struct UKFSM_Husk_FireBallAttack_execInternalCanDoSpecialMove_Parms
{
	// DWORD                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function kfgamecontent.KFSM_Husk_FireBallAttack.PackFlagsBase
// [0x00022002] 
struct UKFSM_Husk_FireBallAttack_execPackFlagsBase_Parms
{
	// class AKFPawn*                                  P;                                                		// 0x0000 (0x0008) [0x0000000000000000]              
	// unsigned char                                   ReturnValue;                                      		// 0x0008 (0x0001) [0x0000000000000000]              
};

// Function kfgamecontent.AICommand_HuskFlameThrowerAttack.Popped
// [0x00020002] 
struct UAICommand_HuskFlameThrowerAttack_execPopped_Parms
{
};

// Function kfgamecontent.AICommand_HuskFlameThrowerAttack.Pushed
// [0x00020002] 
struct UAICommand_HuskFlameThrowerAttack_execPushed_Parms
{
};

// Function kfgamecontent.AICommand_HuskFlameThrowerAttack.FlameThrowerAttack
// [0x00022002] 
struct UAICommand_HuskFlameThrowerAttack_execFlameThrowerAttack_Parms
{
	// class AKFAIController_ZedHusk*                  AI;                                               		// 0x0000 (0x0008) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	// class UAICommand_HuskFlameThrowerAttack*        Cmd;                                              		// 0x000C (0x0008) [0x0000000000000000]              
};

// Function kfgamecontent.AICommand_Patriarch_Grab.Popped
// [0x00020002] 
struct UAICommand_Patriarch_Grab_execPopped_Parms
{
};

// Function kfgamecontent.AICommand_Patriarch_Grab.Pushed
// [0x00020002] 
struct UAICommand_Patriarch_Grab_execPushed_Parms
{
};

// Function kfgamecontent.AICommand_Patriarch_Grab.TentacleGrab
// [0x00022002] 
struct UAICommand_Patriarch_Grab_execTentacleGrab_Parms
{
	// class AKFAIController_ZedPatriarch*             AI;                                               		// 0x0000 (0x0008) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	// class UAICommand_Patriarch_Grab*                Cmd;                                              		// 0x000C (0x0008) [0x0000000000000000]              
};

// Function kfgamecontent.KFPawn_ZedPatriarch.PlayBossMusic
// [0x00020002] 
struct AKFPawn_ZedPatriarch_execPlayBossMusic_Parms
{
};

// Function kfgamecontent.KFPawn_ZedPatriarch.Timer_TickPatriarchDialog
// [0x00020002] 
struct AKFPawn_ZedPatriarch_execTimer_TickPatriarchDialog_Parms
{
};

// Function kfgamecontent.KFPawn_ZedPatriarch.PlayGrabbedPlayerDialog
// [0x00020002] 
struct AKFPawn_ZedPatriarch_execPlayGrabbedPlayerDialog_Parms
{
	// class AKFPawn_Human*                            Target;                                           		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function kfgamecontent.KFPawn_ZedPatriarch.PlayMinigunAttackDialog
// [0x00020002] 
struct AKFPawn_ZedPatriarch_execPlayMinigunAttackDialog_Parms
{
};

// Function kfgamecontent.KFPawn_ZedPatriarch.PlayMinigunWarnDialog
// [0x00020002] 
struct AKFPawn_ZedPatriarch_execPlayMinigunWarnDialog_Parms
{
};

// Function kfgamecontent.KFPawn_ZedPatriarch.PlayStealthSoundLoopEnd
// [0x00020102] 
struct AKFPawn_ZedPatriarch_execPlayStealthSoundLoopEnd_Parms
{
};

// Function kfgamecontent.KFPawn_ZedPatriarch.PlayStealthSoundLoop
// [0x00020102] 
struct AKFPawn_ZedPatriarch_execPlayStealthSoundLoop_Parms
{
};

// Function kfgamecontent.KFPawn_ZedPatriarch.GetSpotterDialogID
// [0x00020002] 
struct AKFPawn_ZedPatriarch_execGetSpotterDialogID_Parms
{
	// int                                             ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function kfgamecontent.KFPawn_ZedPatriarch.SetWeaponAmbientSound
// [0x00024102] 
struct AKFPawn_ZedPatriarch_execSetWeaponAmbientSound_Parms
{
	// class UAkEvent*                                 NewAmbientSound;                                  		// 0x0000 (0x0008) [0x0000000000000000]              
	// class UAkEvent*                                 FirstPersonAmbientSound;                          		// 0x0008 (0x0008) [0x0000000000000000]              
};

// Function kfgamecontent.KFPawn_ZedPatriarch.PlayFootStepSound
// [0x00020902] ( FUNC_Event )
struct AKFPawn_ZedPatriarch_eventPlayFootStepSound_Parms
{
	// int                                             FootDown;                                         		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function kfgamecontent.KFPawn_ZedPatriarch.CauseHeadTrauma
// [0x00024002] 
struct AKFPawn_ZedPatriarch_execCauseHeadTrauma_Parms
{
	// float                                           BleedOutTime;                                     		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function kfgamecontent.KFPawn_ZedPatriarch.TerminateEffectsOnDeath
// [0x00020102] 
struct AKFPawn_ZedPatriarch_execTerminateEffectsOnDeath_Parms
{
};

// Function kfgamecontent.KFPawn_ZedPatriarch.PlayDying
// [0x00020102] 
struct AKFPawn_ZedPatriarch_execPlayDying_Parms
{
	// class UClass*                                   DamageType;                                       		// 0x0000 (0x0008) [0x0000000000000000]              
	// struct FVector                                  HitLoc;                                           		// 0x0008 (0x000C) [0x0000000000000000]              
	// int                                             I;                                                		// 0x0014 (0x0004) [0x0000000000000000]              
};

// Function kfgamecontent.KFPawn_ZedPatriarch.CanInjureHitZone
// [0x00020002] 
struct AKFPawn_ZedPatriarch_execCanInjureHitZone_Parms
{
	// class UClass*                                   DamageType;                                       		// 0x0000 (0x0008) [0x0000000000000000]              
	// int                                             HitZoneIdx;                                       		// 0x0008 (0x0004) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
	// class UClass*                                   KFDmgType;                                        		// 0x0010 (0x0008) [0x0000000000000000]              
	// struct FName                                    HitZoneName;                                      		// 0x0018 (0x0008) [0x0000000000000000]              
};

// Function kfgamecontent.KFPawn_ZedPatriarch.GetHitZoneSkinTypeEffects
// [0x00020102] 
struct AKFPawn_ZedPatriarch_execGetHitZoneSkinTypeEffects_Parms
{
	// int                                             HitZoneIdx;                                       		// 0x0000 (0x0004) [0x0000000000000000]              
	// class UKFSkinTypeEffects*                       ReturnValue;                                      		// 0x0004 (0x0008) [0x0000000000000000]              
};

// Function kfgamecontent.KFPawn_ZedPatriarch.PlayTakeHitEffects
// [0x00024102] 
struct AKFPawn_ZedPatriarch_execPlayTakeHitEffects_Parms
{
	// struct FVector                                  HitDirection;                                     		// 0x0000 (0x000C) [0x0000000000000000]              
	// struct FVector                                  HitLocation;                                      		// 0x000C (0x000C) [0x0000000000000000]              
	// DWORD                                           bUseHitImpulse : 1;                               		// 0x0018 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function kfgamecontent.KFPawn_ZedPatriarch.SetDamageFXActive
// [0x00020102] 
struct AKFPawn_ZedPatriarch_execSetDamageFXActive_Parms
{
	// DWORD                                           bEnable : 1;                                      		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function kfgamecontent.KFPawn_ZedPatriarch.UpdateBattlePhaseFX
// [0x00020102] 
struct AKFPawn_ZedPatriarch_execUpdateBattlePhaseFX_Parms
{
};

// Function kfgamecontent.KFPawn_ZedPatriarch.UpdateBattlePhaseLights
// [0x00820102] 
struct AKFPawn_ZedPatriarch_execUpdateBattlePhaseLights_Parms
{
	// struct FLinearColor                             LinearBoilColor;                                  		// 0x0000 (0x0010) [0x0000000000000000]              
	// struct FColor                                   BoilColor;                                        		// 0x0010 (0x0004) [0x0000000000000000]              
	// unsigned char                                   BattlePhaseArrayNum;                              		// 0x0014 (0x0001) [0x0000000000000000]              
};

// Function kfgamecontent.KFPawn_ZedPatriarch.UpdateBattlePhaseMaterials
// [0x00020102] 
struct AKFPawn_ZedPatriarch_execUpdateBattlePhaseMaterials_Parms
{
};

// Function kfgamecontent.KFPawn_ZedPatriarch.DoCloakFX
// [0x00020102] 
struct AKFPawn_ZedPatriarch_execDoCloakFX_Parms
{
	// class UParticleSystemComponent*                 CloakPSC;                                         		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function kfgamecontent.KFPawn_ZedPatriarch.UpdateGameplayMICParams
// [0x00020102] 
struct AKFPawn_ZedPatriarch_execUpdateGameplayMICParams_Parms
{
	// int                                             I;                                                		// 0x0000 (0x0004) [0x0000000000000000]              
	// DWORD                                           bIsSpotted : 1;                                   		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           bWasCloaked : 1;                                  		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function kfgamecontent.KFPawn_ZedPatriarch.CallOutCloakingExpired
// [0x00020002] 
struct AKFPawn_ZedPatriarch_execCallOutCloakingExpired_Parms
{
};

// Function kfgamecontent.KFPawn_ZedPatriarch.CallOutCloaking
// [0x00024002] 
struct AKFPawn_ZedPatriarch_execCallOutCloaking_Parms
{
	// class AKFPlayerController*                      CallOutController;                                		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function kfgamecontent.KFPawn_ZedPatriarch.UpdateSpottedStatus
// [0x00020902] ( FUNC_Event )
struct AKFPawn_ZedPatriarch_eventUpdateSpottedStatus_Parms
{
	// DWORD                                           bOldSpottedByLP : 1;                              		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// class AKFPlayerController*                      LocalPC;                                          		// 0x0004 (0x0008) [0x0000000000000000]              
	// class AKFPerk*                                  LocalPerk;                                        		// 0x000C (0x0008) [0x0000000000000000]              
	// float                                           DistanceSq;                                       		// 0x0014 (0x0004) [0x0000000000000000]              
	// float                                           Range;                                            		// 0x0018 (0x0004) [0x0000000000000000]              
};

// Function kfgamecontent.KFPawn_ZedPatriarch.CausePanicWander
// [0x00020002] 
struct AKFPawn_ZedPatriarch_execCausePanicWander_Parms
{
