/*
#############################################################################################
# Killing Floor 2 (1.8787) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: kfgamecontent_classes.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/

#define CONST_MaxPhases                                          4
#define CONST_ObjectiveChance                                    0.5f
#define CONST_MAX_ACTIVE_PUKE_MINES                              30
#define CONST_FriendlyZedInfoShowDistanceSQ                      562000
#define CONST_BackpackZoneIndex                                  3
#define CONST_MINMINEFLOORZ                                      0.8f
#define CONST_EquipGunsAnim                                      'Equip_Gun'

#define CONST_CrouchThrowAnim                                    'C4_Throw_CH'
#define CONST_DetonateAnim                                       'Shoot'
#define CONST_CrouchDetonateAnim                                 'CH_Shoot'
#define CONST_DETONATE_FIREMODE                                  5

/*
# ========================================================================================= #
# Enums
# ========================================================================================= #
*/

// Enum kfgamecontent.KFGameInfo_Survival.EWaveEndCondition
/*enum EWaveEndCondition
{
	WEC_WaveWon                                        = 0,
	WEC_TeamWipedOut                                   = 1,
	WEC_GameWon                                        = 2,
	WEC_MAX                                            = 3
};*/

// Enum kfgamecontent.KFGameInfo_WeeklySurvival.BeefcakeType
/*enum BeefcakeType
{
	EBT_Damage                                         = 0,
	EBT_Rally                                          = 1,
	EBT_Scream                                         = 2,
	EBT_StalkerPoison                                  = 3,
	EBT_MAX                                            = 4
};*/

// Enum kfgamecontent.KFGameInfo_WeeklySurvival.PickupResetTime
/*enum PickupResetTime
{
	PRS_Wave                                           = 0,
	PRS_Trader                                         = 1,
	PRS_WaveAndTrader                                  = 2,
	PRS_Never                                          = 3,
	PRS_MAX                                            = 4
};*/

// Enum kfgamecontent.KFMG_BloatDunk.eBloatGameState
/*enum eBloatGameState
{
	BGS_Off                                            = 0,
	BGS_On                                             = 1,
	BGS_Victory                                        = 2,
	BGS_Defeat                                         = 3,
	BGS_MAX                                            = 4
};*/

// Enum kfgamecontent.KFMG_RiggedTargetGame.eAnimationState
/*enum eAnimationState
{
	EAS_Closed                                         = 0,
	EAS_Open                                           = 1,
	EAS_Active                                         = 2,
	EAS_Idle                                           = 3,
	EAS_Close                                          = 4,
	EAS_MAX                                            = 5
};*/

// Enum kfgamecontent.KFProj_Thrown_C4.EImpactResult
/*enum EImpactResult
{
	EIR_None                                           = 0,
	EIR_Stick                                          = 1,
	EIR_Bounce                                         = 2,
	EIR_MAX                                            = 3
};*/


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class kfgamecontent.AICommand_Base_Patriarch
// 0x0000 (0x00E8 - 0x00E8)
class UAICommand_Base_Patriarch : public UAICommand_Base_Boss
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 110573 ];

		return pClassPointer;
	};

};

UClass* UAICommand_Base_Patriarch::pClassPointer = NULL;

// Class kfgamecontent.KFAIController_ZedPatriarch
// 0x0110 (0x0BD4 - 0x0AC4)
class AKFAIController_ZedPatriarch : public AKFAIController_ZedBoss
{
public:
	class AKFPawn_ZedPatriarch*                        MyPatPawn;                                        		// 0x0AC4 (0x0008) [0x0000000000000000]              
	DWORD                                              bCanEvaluateAttacks : 1;                          		// 0x0ACC (0x0004) [0x0000000000000000] [0x00000001] 
	DWORD                                              bDoingChargeAttack : 1;                           		// 0x0ACC (0x0004) [0x0000000000000000] [0x00000002] 
	DWORD                                              bWantsToCharge : 1;                               		// 0x0ACC (0x0004) [0x0000000000000000] [0x00000004] 
	DWORD                                              bHadMinigunAttack : 1;                            		// 0x0ACC (0x0004) [0x0000000000000000] [0x00000008] 
	DWORD                                              bSprintUntilAttack : 1;                           		// 0x0ACC (0x0004) [0x0000000000000000] [0x00000010] 
	DWORD                                              bRaging : 1;                                      		// 0x0ACC (0x0004) [0x0000000000000000] [0x00000020] 
	DWORD                                              bRagedThisPhase : 1;                              		// 0x0ACC (0x0004) [0x0000000000000000] [0x00000040] 
	DWORD                                              bWantsToFlee : 1;                                 		// 0x0ACC (0x0004) [0x0000000000000000] [0x00000080] 
	DWORD                                              bFleeing : 1;                                     		// 0x0ACC (0x0004) [0x0000000000000000] [0x00000100] 
	DWORD                                              bFleeInterrupted : 1;                             		// 0x0ACC (0x0004) [0x0000000000000000] [0x00000200] 
	float                                              LostSightSprintDelay;                             		// 0x0AD0 (0x0004) [0x0000000000000000]              
	float                                              AggroFalloffWaitTime;                             		// 0x0AD4 (0x0004) [0x0000000000000000]              
	float                                              AggroFalloffPerSecond;                            		// 0x0AD8 (0x0004) [0x0000000000000000]              
	float                                              VisibleAggroDmgThreshold;                         		// 0x0ADC (0x0004) [0x0000000000000000]              
	float                                              HiddenAggroDmgThreshold;                          		// 0x0AE0 (0x0004) [0x0000000000000000]              
	TArray< struct FPatriarch_TrackedEnemyInfo >       RecentlySeenEnemyList;                            		// 0x0AE4 (0x0010) [0x0000000000000000]              
	TArray< struct FPatriarch_TrackedEnemyInfo >       HiddenEnemies;                                    		// 0x0AF4 (0x0010) [0x0000000000000000]              
	TArray< class AKFPawn* >                           LastMinigunEnemies;                               		// 0x0B04 (0x0010) [0x0000000000000000]              
	float                                              MinMinigunRangeSQ;                                		// 0x0B14 (0x0004) [0x0000000000000000]              
	float                                              MaxMinigunRangeSQ;                                		// 0x0B18 (0x0004) [0x0000000000000000]              
	float                                              MaxFanFireRangeSQ;                                		// 0x0B1C (0x0004) [0x0000000000000000]              
	TArray< class AKFPawn* >                           LastChargedPlayers;                               		// 0x0B20 (0x0010) [0x0000000000000000]              
	float                                              MinChargeRangeSQ;                                 		// 0x0B30 (0x0004) [0x0000000000000000]              
	float                                              LastChargeAttackTime;                             		// 0x0B34 (0x0004) [0x0000000000000000]              
	class APawn*                                       CachedChargeTarget;                               		// 0x0B38 (0x0008) [0x0000000000000000]              
	TArray< class AKFPawn* >                           LastGrabbedPlayers;                               		// 0x0B40 (0x0010) [0x0000000000000000]              
	float                                              LastGrabAttackTime;                               		// 0x0B50 (0x0004) [0x0000000000000000]              
	float                                              MinTentacleRangeSQ;                               		// 0x0B54 (0x0004) [0x0000000000000000]              
	TArray< class AKFPawn* >                           LastMissileEnemies;                               		// 0x0B58 (0x0010) [0x0000000000000000]              
	float                                              LastMissileAttackTime;                            		// 0x0B68 (0x0004) [0x0000000000000000]              
	float                                              MinMissileRangeSQ;                                		// 0x0B6C (0x0004) [0x0000000000000000]              
	float                                              MaxMissileRangeSQ;                                		// 0x0B70 (0x0004) [0x0000000000000000]              
	float                                              LastMortarAttackTime;                             		// 0x0B74 (0x0004) [0x0000000000000000]              
	float                                              LastSuccessfulAttackTime;                         		// 0x0B78 (0x0004) [0x0000000000000000]              
	float                                              RecentSeenEnemyListUpdateInterval;                		// 0x0B7C (0x0004) [0x0000000000000000]              
	float                                              LastRecentSeenEnemyListUpdateTime;                		// 0x0B80 (0x0004) [0x0000000000000000]              
	float                                              LastAttackMoveFinishTime;                         		// 0x0B84 (0x0004) [0x0000000000000000]              
	float                                              NextAttackCheckTime;                              		// 0x0B88 (0x0004) [0x0000000000000000]              
	float                                              LastSprintTime;                                   		// 0x0B8C (0x0004) [0x0000000000000000]              
	float                                              LastRetargetTime;                                 		// 0x0B90 (0x0004) [0x0000000000000000]              
	float                                              RetargetWaitTime;                                 		// 0x0B94 (0x0004) [0x0000000000000000]              
	int                                                MaxRageAttacks;                                   		// 0x0B98 (0x0004) [0x0000000000000000]              
	int                                                RageAttackCount;                                  		// 0x0B9C (0x0004) [0x0000000000000000]              
	float                                              MaxRageRangeSQ;                                   		// 0x0BA0 (0x0004) [0x0000000000000000]              
	float                                              RageTimeOut;                                      		// 0x0BA4 (0x0004) [0x0000000000000000]              
	TArray< class AKFPawn* >                           RageAttackedTargets;                              		// 0x0BA8 (0x0010) [0x0000000000000000]              
	int                                                HumanBumpDamage;                                  		// 0x0BB8 (0x0004) [0x0000000000000000]              
	int                                                HumanBumpMomentum;                                		// 0x0BBC (0x0004) [0x0000000000000000]              
	float                                              FleeHealthThreshold;                              		// 0x0BC0 (0x0004) [0x0000000000000000]              
	float                                              MaxFleeDuration;                                  		// 0x0BC4 (0x0004) [0x0000000000000000]              
	float                                              MaxFleeDistance;                                  		// 0x0BC8 (0x0004) [0x0000000000000000]              
	float                                              FleeStartTime;                                    		// 0x0BCC (0x0004) [0x0000000000000000]              
	float                                              TotalFleeTime;                                    		// 0x0BD0 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 110579 ];

		return pClassPointer;
	};

	void DrawDebug ( );
	void PlayDamagePlayerDialog ( );
	void EnterZedVictoryState ( );
	void ForceHeal ( );
	void NotifyFleeFinished ( );
	void Flee ( );
	void DoFleeFrom ( );
	void DoHeavyZedBump ( );
	void DoHeavyBump ( );
	void Timer_SearchForChargeObstructions ( );
	void Timer_SearchForFleeObstructions ( );
	void NextBattlePhase ( );
	void Timer_StopSummoningZeds ( );
	void AmIAllowedToSuicideWhenStuck ( );
	void Timer_RageTimeOut ( );
	void UpdateRageState ( );
	void StartPaternalInstinct ( );
	void NotifyTakeHit ( );
	void NotifyKilled ( );
	void NotifyMeleeDamageDealt ( );
	void NotifySpecialMoveEnded ( );
	void NotifyCommandFinished ( );
	void NotifyAttackActor ( );
	void DoorFinished ( );
	void NotifyAttackDoor ( );
	void SomeEnemiesAreHidden ( );
	void IsCeilingClear ( );
	void CanSetSprinting ( );
	void ShouldSprint ( );
	void EvaluateSprinting ( );
	void DoStrike ( );
	void GetAdjustedAimFor ( );
	void IsWeaponArmClear ( );
	void EvaluateAttacks ( );
	void UpdateRecentlySeenEnemyList ( );
	void eventSeePlayer ( );
	void Tick ( );
	void SetBestTarget ( );
	void eventChangeEnemy ( );
	void ForceSetEnemy ( );
	void eventSetEnemy ( );
	void eventFindNewEnemy ( );
	void GetAggroRating ( );
	void CanSwitchEnemies ( );
	void IsAggroEnemySwitchAllowed ( );
	void eventDestroyed ( );
	void PawnDied ( );
	void eventPossess ( );
};

UClass* AKFAIController_ZedPatriarch::pClassPointer = NULL;

// Class kfgamecontent.AICommand_FleshpoundKing_ChestBeamAttack
// 0x0000 (0x00F4 - 0x00F4)
class UAICommand_FleshpoundKing_ChestBeamAttack : public UAICommand_SpecialMove
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 110584 ];

		return pClassPointer;
	};

	void Popped ( );
	void Pushed ( );
	void ChestBeamAttack ( );
};

UClass* UAICommand_FleshpoundKing_ChestBeamAttack::pClassPointer = NULL;

// Class kfgamecontent.KFAIController_ZedFleshpoundKing
// 0x0038 (0x0B48 - 0x0B10)
class AKFAIController_ZedFleshpoundKing : public AKFAIController_ZedFleshpound
{
public:
	class AKFPawn_ZedFleshpoundKing*                   MyPawn;                                           		// 0x0B10 (0x0008) [0x0000000000000000]              
	float                                              NextBeamCheckTime;                                		// 0x0B18 (0x0004) [0x0000000000000000]              
	float                                              LastBeamTickTime;                                 		// 0x0B1C (0x0004) [0x0000000000000000]              
	struct FVector2D                                   BeamAttackWaitTimeRange;                          		// 0x0B20 (0x0008) [0x0000000000000000]              
	float                                              MinChestBeamTargetAngle;                          		// 0x0B28 (0x0004) [0x0000000000000000]              
	float                                              MaxChestBeamHeightOffset;                         		// 0x0B2C (0x0004) [0x0000000000000000]              
	int                                                CurrentPhase;                                     		// 0x0B30 (0x0004) [0x0000000000000000]              
	float                                              PhaseThresholds[ 0x4 ];                           		// 0x0B34 (0x0010) [0x0000000000000000]              
	int                                                ChestBeamMinPhase;                                		// 0x0B44 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 110596 ];

		return pClassPointer;
	};

	void ForceTargetChange ( );
	void eventChangeEnemy ( );
	void eventSetEnemy ( );
	void eventFindNewEnemy ( );
	void CanSwitchEnemies ( );
	void NotifySpecialMoveEnded ( );
	void TransitionToPhase ( );
	void NotifyTakeHit ( );
	void CheckForBeamAttack ( );
	void eventTick ( );
	void eventSeePlayer ( );
	void eventPossess ( );
};

UClass* AKFAIController_ZedFleshpoundKing::pClassPointer = NULL;

// Class kfgamecontent.KFDifficulty_FleshpoundKing
// 0x0010 (0x0290 - 0x0280)
class UKFDifficulty_FleshpoundKing : public UKFMonsterDifficultyInfo
{
public:
	TArray< float >                                    ChestBeamCooldowns;                               		// 0x0280 (0x0010) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 110598 ];

		return pClassPointer;
	};

	void GetChestBeamCooldownTime ( );
};

UClass* UKFDifficulty_FleshpoundKing::pClassPointer = NULL;

// Class kfgamecontent.AICommand_Husk_Suicide
// 0x0000 (0x00F4 - 0x00F4)
class UAICommand_Husk_Suicide : public UAICommand_SpecialMove
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 110602 ];

		return pClassPointer;
	};

	void GetSpecialMove ( );
	void Popped ( );
	void Paused ( );
	void Resumed ( );
	void Pushed ( );
	void Suicide ( );
};

UClass* UAICommand_Husk_Suicide::pClassPointer = NULL;

// Class kfgamecontent.KFAIController_ZedHusk
// 0x007C (0x0B3C - 0x0AC0)
class AKFAIController_ZedHusk : public AKFAIController_Monster
{
public:
	DWORD                                              bBaseCommandInitialized : 1;                      		// 0x0AC0 (0x0004) [0x0000000000000000] [0x00000001] 
	DWORD                                              bCanUseFlameThrower : 1;                          		// 0x0AC0 (0x0004) [0x0000000000000000] [0x00000002] 
	DWORD                                              bDebugAimError : 1;                               		// 0x0AC0 (0x0004) [0x0000000000000000] [0x00000004] 
	DWORD                                              bCanLeadTarget : 1;                               		// 0x0AC0 (0x0004) [0x0000000000000000] [0x00000008] 
	float                                              MinDistanceToSuicide;                             		// 0x0AC4 (0x0004) [0x0000000000000000]              
	float                                              RequiredHealthPercentForSuicide;                  		// 0x0AC8 (0x0004) [0x0000000000000000]              
	struct FVector                                     LastEnemySeenPosition;                            		// 0x0ACC (0x000C) [0x0000000000000000]              
	float                                              LastFireBallTime;                                 		// 0x0AD8 (0x0004) [0x0000000000000000]              
	float                                              LastFlameThrowerTime;                             		// 0x0ADC (0x0004) [0x0000000000000000]              
	float                                              BaseTimeBetweenFireBalls;                         		// 0x0AE0 (0x0004) [0x0000000000000000]              
	float                                              TimeBetweenFireBalls;                             		// 0x0AE4 (0x0004) [0x0000000000000000]              
	float                                              TimeBetweenFlameThrower;                          		// 0x0AE8 (0x0004) [0x0000000000000000]              
	float                                              FireballRandomizedValue;                          		// 0x0AEC (0x0004) [0x0000000000000000]              
	int                                                MaxDistanceForFlameThrower;                       		// 0x0AF0 (0x0004) [0x0000000000000000]              
	int                                                MinDistanceForFireBall;                           		// 0x0AF4 (0x0004) [0x0000000000000000]              
	int                                                MaxDistanceForFireBall;                           		// 0x0AF8 (0x0004) [0x0000000000000000]              
	float                                              LastCheckSpecialMoveTime;                         		// 0x0AFC (0x0004) [0x0000000000000000]              
	float                                              CheckSpecialMoveTime;                             		// 0x0B00 (0x0004) [0x0000000000000000]              
	struct FName                                       FireballSocketName;                               		// 0x0B04 (0x0008) [0x0000000000000000]              
	float                                              FireballAimError;                                 		// 0x0B0C (0x0004) [0x0000000000000000]              
	float                                              FireballLeadTargetAimError;                       		// 0x0B10 (0x0004) [0x0000000000000000]              
	float                                              FireballSpeed;                                    		// 0x0B14 (0x0004) [0x0000000000000000]              
	float                                              SplashAimChanceNormal;                            		// 0x0B18 (0x0004) [0x0000000000000000]              
	float                                              SplashAimChanceHard;                              		// 0x0B1C (0x0004) [0x0000000000000000]              
	float                                              SplashAimChanceSuicidal;                          		// 0x0B20 (0x0004) [0x0000000000000000]              
	float                                              SplashAimChanceHellOnEarth;                       		// 0x0B24 (0x0004) [0x0000000000000000]              
	float                                              FireballFireIntervalNormal;                       		// 0x0B28 (0x0004) [0x0000000000000000]              
	float                                              FireballFireIntervalHard;                         		// 0x0B2C (0x0004) [0x0000000000000000]              
	float                                              FireballFireIntervalSuicidal;                     		// 0x0B30 (0x0004) [0x0000000000000000]              
	float                                              FireballFireIntervalHellOnEarth;                  		// 0x0B34 (0x0004) [0x0000000000000000]              
	float                                              LowIntensityAttackScaleOfFireballInterval;        		// 0x0B38 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 110622 ];

		return pClassPointer;
	};

	void DebugAimError ( );
	void ShootFireball ( );
	void DoStrike ( );
	void ShouldSprint ( );
	void eventSetEnemy ( );
	void CanDoFireball ( );
	void CanDoFlamethrower ( );
	void CanDoSuicide ( );
	void IsSuicidal ( );
	void Tick ( );
	void eventPostBeginPlay ( );
	void eventPossess ( );
	void IsNearDoor ( );
};

UClass* AKFAIController_ZedHusk::pClassPointer = NULL;

// Class kfgamecontent.AICommand_HuskFireBallAttack
// 0x0010 (0x0104 - 0x00F4)
class UAICommand_HuskFireBallAttack : public UAICommand_SpecialMove
{
public:
	struct FVector                                     LastKnownEnemyLocation;                           		// 0x00F4 (0x000C) [0x0000000000000000]              
	float                                              LastEnemyLocationCheckTime;                       		// 0x0100 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 110624 ];

		return pClassPointer;
	};

	void eventHandleAICommandSpecialAction ( );
	void Popped ( );
	void Pushed ( );
	void FireBallAttack ( );
};

UClass* UAICommand_HuskFireBallAttack::pClassPointer = NULL;

// Class kfgamecontent.KFSM_Husk_FireBallAttack
// 0x002C (0x017C - 0x0150)
class UKFSM_Husk_FireBallAttack : public UKFSM_PlaySingleAnim
{
public:
	TArray< struct FName >                             AnimNames;                                        		// 0x0150 (0x0010) [0x0000000000000000]              
	TArray< struct FVector >                           FireOffsets;                                      		// 0x0160 (0x0010) [0x0000000000000000]              
	struct FVector                                     FireOffset;                                       		// 0x0170 (0x000C) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 110641 ];

		return pClassPointer;
	};

	void CanOverrideMoveWith ( );
	void SpecialMoveEnded ( );
	void NotifyFireballFired ( );
	void PlayAnimation ( );
	void SpecialMoveStarted ( );
	void GetFireOffset ( );
	void InternalCanDoSpecialMove ( );
	void PackFlagsBase ( );
};

UClass* UKFSM_Husk_FireBallAttack::pClassPointer = NULL;

// Class kfgamecontent.AICommand_HuskFlameThrowerAttack
// 0x0000 (0x00F4 - 0x00F4)
class UAICommand_HuskFlameThrowerAttack : public UAICommand_SpecialMove
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 110646 ];

		return pClassPointer;
	};

	void Popped ( );
	void Pushed ( );
	void FlameThrowerAttack ( );
};

UClass* UAICommand_HuskFlameThrowerAttack::pClassPointer = NULL;

// Class kfgamecontent.AICommand_Patriarch_Grab
// 0x0000 (0x00F4 - 0x00F4)
class UAICommand_Patriarch_Grab : public UAICommand_SpecialMove
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 110662 ];

		return pClassPointer;
	};

	void Popped ( );
	void Pushed ( );
	void TentacleGrab ( );
};

UClass* UAICommand_Patriarch_Grab::pClassPointer = NULL;

// Class kfgamecontent.KFPawn_ZedPatriarch
// 0x02C8 (0x1138 - 0x0E70)
class AKFPawn_ZedPatriarch : public AKFPawn_MonsterBoss
{
public:
	class UAkEvent*                                    AmbientBreathingEvent;                            		// 0x0E70 (0x0008) [0x0000000000000000]              
	class UAkEvent*                                    LowHealthAmbientBreathingEvent;                   		// 0x0E78 (0x0008) [0x0000000000000000]              
	class UAkComponent*                                CloakedAkComponent;                               		// 0x0E80 (0x0008) [0x0000000000000000]              
	class UAkEvent*                                    CloakedLoop;                                      		// 0x0E88 (0x0008) [0x0000000000000000]              
	class UAkEvent*                                    CloakedLoopEnd;                                   		// 0x0E90 (0x0008) [0x0000000000000000]              
	class UMaterialInstanceConstant*                   BodyMaterial;                                     		// 0x0E98 (0x0008) [0x0000000000000000]              
	class UMaterialInstanceConstant*                   BodyAltMaterial;                                  		// 0x0EA0 (0x0008) [0x0000000000000000]              
	class UMaterialInstanceConstant*                   SpottedMaterial;                                  		// 0x0EA8 (0x0008) [0x0000000000000000]              
	class UMaterialInstanceConstant*                   CloakedBodyMaterial;                              		// 0x0EB0 (0x0008) [0x0000000000000000]              
	class UMaterialInstanceConstant*                   CloakedBodyAltMaterial;                           		// 0x0EB8 (0x0008) [0x0000000000000000]              
	class UKFSkelControl_SpinBone*                     BarrelSpinSkelCtrl;                               		// 0x0EC0 (0x0008) [0x0000000000000000]              
	class USkelControlLookAt*                          GunTrackingSkelCtrl;                              		// 0x0EC8 (0x0008) [0x0000000000000000]              
	TArray< class UStaticMeshComponent* >              HealingSyringeMeshes;                             		// 0x0ED0 (0x0010) [0x0000000000000000]              
	TArray< class UMaterialInstanceConstant* >         HealingSyringeMICs;                               		// 0x0EE0 (0x0010) [0x0000000000000000]              
	int                                                CurrentSyringeMeshNum;                            		// 0x0EF0 (0x0004) [0x0000000000000000]              
	int                                                ActiveSyringe;                                    		// 0x0EF4 (0x0004) [0x0000000000000000]              
	float                                              SyringeInjectTimeDuration;                        		// 0x0EF8 (0x0004) [0x0000000000000000]              
	float                                              SyringeInjectTimeRemaining;                       		// 0x0EFC (0x0004) [0x0000000000000000]              
	struct FLinearColor                                MechColors[ 0x4 ];                                		// 0x0F00 (0x0040) [0x0000000000000000]              
	struct FLinearColor                                DeadMechColor;                                    		// 0x0F40 (0x0010) [0x0000000000000000]              
	struct FLinearColor                                BoilColors[ 0x4 ];                                		// 0x0F50 (0x0040) [0x0000000000000000]              
	struct FLinearColor                                DeadBoilColor;                                    		// 0x0F90 (0x0010) [0x0000000000000000]              
	DWORD                                              bPulseBoils : 1;                                  		// 0x0FA0 (0x0004) [0x0000000000000000] [0x00000001] 
	DWORD                                              bSprayingFire : 1;                                		// 0x0FA0 (0x0004) [0x0000000000000000] [0x00000002] 
	DWORD                                              bSpinBarrels : 1;                                 		// 0x0FA0 (0x0004) [0x0000000000000000] [0x00000004] 
	DWORD                                              bUseServerSideGunTracking : 1;                    		// 0x0FA0 (0x0004) [0x0000000000000000] [0x00000008] 
	DWORD                                              bGunTracking : 1;                                 		// 0x0FA0 (0x0004) [0x0000000000000000] [0x00000010] 
	DWORD                                              bInFleeAndHealMode : 1;                           		// 0x0FA0 (0x0004) [0x00000000006A0000] [0x00000020] ( CPF_EditConst | CPF_Component | CPF_NeedCtorLink )
	DWORD                                              bHealedThisPhase : 1;                             		// 0x0FA0 (0x0004) [0x0000000000000000] [0x00000040] 
	float                                              BoilPulseRate;                                    		// 0x0FA4 (0x0004) [0x0000000000000000]              
	float                                              BoilPulseAccum;                                   		// 0x0FA8 (0x0004) [0x0000000000000000]              
	float                                              BoilLightBrightness[ 0x4 ];                       		// 0x0FAC (0x0010) [0x0000000000000000]              
	struct FName                                       BoilLightSocketName;                              		// 0x0FBC (0x0008) [0x0000000000000000]              
	class UPointLightComponent*                        BoilLightComponent;                               		// 0x0FC4 (0x0008) [0x0000000000000000]              
	class UParticleSystem*                             CloakFX;                                          		// 0x0FCC (0x0008) [0x0000000000000000]              
	struct FName                                       CloakFXSocketName;                                		// 0x0FD4 (0x0008) [0x0000000000000000]              
	float                                              CloakShimmerAmount;                               		// 0x0FDC (0x0004) [0x0000000000000000]              
	float                                              LastCloakShimmerTime;                             		// 0x0FE0 (0x0004) [0x0000000000000000]              
	struct FName                                       BattleDamageFXSocketName_LeftHip;                 		// 0x0FE4 (0x0008) [0x0000000000000000]              
	struct FName                                       BattleDamageFXSocketName_LeftKnee;                		// 0x0FEC (0x0008) [0x0000000000000000]              
	struct FName                                       BattleDamageFXSocketName_LeftFoot;                		// 0x0FF4 (0x0008) [0x0000000000000000]              
	struct FName                                       BattleDamageFXSocketName_LeftArm;                 		// 0x0FFC (0x0008) [0x0000000000000000]              
	struct FName                                       BattleDamageFXSocketName_Weapon;                  		// 0x1004 (0x0008) [0x0000000000000000]              
	struct FName                                       BattleDamageFXSocketName_LowerSpike;              		// 0x100C (0x0008) [0x0000000000000000]              
	struct FName                                       BattleDamageFXSocketName_UpperSpike;              		// 0x1014 (0x0008) [0x0000000000000000]              
	struct FName                                       BattleDamageFXSocketName_BackSpike;               		// 0x101C (0x0008) [0x0000000000000000]              
	class UParticleSystemComponent*                    BattleDamagePSC_LeftHip;                          		// 0x1024 (0x0008) [0x0000000000000000]              
	class UParticleSystemComponent*                    BattleDamagePSC_LeftKnee;                         		// 0x102C (0x0008) [0x0000000000000000]              
	class UParticleSystemComponent*                    BattleDamagePSC_LeftFoot;                         		// 0x1034 (0x0008) [0x0000000000000000]              
	class UParticleSystemComponent*                    BattleDamagePSC_LeftArm;                          		// 0x103C (0x0008) [0x0000000000000000]              
	class UParticleSystemComponent*                    BattleDamagePSC_Weapon;                           		// 0x1044 (0x0008) [0x0000000000000000]              
	class UParticleSystemComponent*                    BattleDamagePSC_LowerSpike;                       		// 0x104C (0x0008) [0x0000000000000000]              
	class UParticleSystemComponent*                    BattleDamagePSC_UpperSpike;                       		// 0x1054 (0x0008) [0x0000000000000000]              
	class UParticleSystemComponent*                    BattleDamagePSC_BackSpike;                        		// 0x105C (0x0008) [0x0000000000000000]              
	class UParticleSystem*                             BattleDamageFX_Sparks_LowDmg;                     		// 0x1064 (0x0008) [0x0000000000000000]              
	class UParticleSystem*                             BattleDamageFX_Sparks_MidDmg;                     		// 0x106C (0x0008) [0x0000000000000000]              
	class UParticleSystem*                             BattleDamageFX_Sparks_HighDmg;                    		// 0x1074 (0x0008) [0x0000000000000000]              
	class UParticleSystem*                             BattleDamageFX_Tentacle_LowDmg;                   		// 0x107C (0x0008) [0x0000000000000000]              
	class UParticleSystem*                             BattleDamageFX_Tentacle_MidDmg;                   		// 0x1084 (0x0008) [0x0000000000000000]              
	class UParticleSystem*                             BattleDamageFX_Tentacle_HighDmg;                  		// 0x108C (0x0008) [0x0000000000000000]              
	class UParticleSystem*                             BattleDamageFX_Smoke_HighDmg;                     		// 0x1094 (0x0008) [0x0000000000000000]              
	float                                              TickDialogInterval;                               		// 0x109C (0x0004) [0x0000000000000000]              
	float                                              FootstepCameraShakePitchAmplitude;                		// 0x10A0 (0x0004) [0x0000000000000000]              
	float                                              FootstepCameraShakeRollAmplitude;                 		// 0x10A4 (0x0004) [0x0000000000000000]              
	int                                                LastFXBattlePhase;                                		// 0x10A8 (0x0004) [0x0000000000000000]              
	TArray< struct FPatriarchBattlePhaseInfo >         BattlePhases;                                     		// 0x10AC (0x0010) [0x0000000000000000]              
	float                                              SprintCooldownTime;                               		// 0x10BC (0x0004) [0x0000000000000000]              
	float                                              TentacleGrabCooldownTime;                         		// 0x10C0 (0x0004) [0x0000000000000000]              
	float                                              MissileAttackCooldownTime;                        		// 0x10C4 (0x0004) [0x0000000000000000]              
	float                                              MortarAttackCooldownTime;                         		// 0x10C8 (0x0004) [0x0000000000000000]              
	float                                              ChargeAttackCooldownTime;                         		// 0x10CC (0x0004) [0x0000000000000000]              
	float                                              MinigunAttackCooldownTime;                        		// 0x10D0 (0x0004) [0x0000000000000000]              
	int                                                MaxRageAttacks;                                   		// 0x10D4 (0x0004) [0x0000000000000000]              
	int                                                TentacleDamage;                                   		// 0x10D8 (0x0004) [0x0000000000000000]              
	class UClass*                                      TentacleDamageType;                               		// 0x10DC (0x0008) [0x0000000000000000]              
	class UClass*                                      HeavyBumpDamageType;                              		// 0x10E4 (0x0008) [0x0000000000000000]              
	float                                              BarrelSpinSpeed;                                  		// 0x10EC (0x0004) [0x0000000000000000]              
	class AActor*                                      GunTarget;                                        		// 0x10F0 (0x0008) [0x00000000006B0000]              ( CPF_Travel | CPF_EditConst | CPF_Component | CPF_NeedCtorLink )
	class UClass*                                      MissileProjectileClass;                           		// 0x10F8 (0x0008) [0x0000000000000000]              
	class UClass*                                      MortarProjectileClass;                            		// 0x1100 (0x0008) [0x0000000000000000]              
	TArray< struct FPatriarch_MortarTarget >           MortarTargets;                                    		// 0x1108 (0x0010) [0x0000000000000000]              
	float                                              MinMortarRangeSQ;                                 		// 0x1118 (0x0004) [0x0000000000000000]              
	float                                              MaxMortarRangeSQ;                                 		// 0x111C (0x0004) [0x0000000000000000]              
	float                                              FleeSprintSpeedModifier;                          		// 0x1120 (0x0004) [0x0000000000000000]              
	float                                              CloakPercent;                                     		// 0x1124 (0x0004) [0x0000000000000000]              
	float                                              CloakSpeed;                                       		// 0x1128 (0x0004) [0x0000000000000000]              
	float                                              DeCloakSpeed;                                     		// 0x112C (0x0004) [0x0000000000000000]              
	int                                                NumFleeAndHealEnemyBumps;                         		// 0x1130 (0x0004) [0x0000000000000000]              
	float                                              LastFleeAndHealEnemyBumpTime;                     		// 0x1134 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 110676 ];

		return pClassPointer;
	};

	void PlayBossMusic ( );
	void Timer_TickPatriarchDialog ( );
	void PlayGrabbedPlayerDialog ( );
	void PlayMinigunAttackDialog ( );
	void PlayMinigunWarnDialog ( );
	void PlayStealthSoundLoopEnd ( );
	void PlayStealthSoundLoop ( );
	void GetSpotterDialogID ( );
	void SetWeaponAmbientSound ( );
	void eventPlayFootStepSound ( );
	void CauseHeadTrauma ( );
	void TerminateEffectsOnDeath ( );
	void PlayDying ( );
	void CanInjureHitZone ( );
	void GetHitZoneSkinTypeEffects ( );
	void PlayTakeHitEffects ( );
	void SetDamageFXActive ( );
	void UpdateBattlePhaseFX ( );
	void UpdateBattlePhaseLights ( );
	void UpdateBattlePhaseMaterials ( );
	void DoCloakFX ( );
	void UpdateGameplayMICParams ( );
	void CallOutCloakingExpired ( );
	void CallOutCloaking ( );
	void eventUpdateSpottedStatus ( );
	void CausePanicWander ( );
	void OnStackingAfflictionChanged ( );
	void ClientCloakingStateUpdated ( );
	void SetCloaked ( );
	void eventNotifyGoreMeshActive ( );
	void UpdateHealingSyringeTransparency ( );
	void GetMinCloakPct ( );
	void UpdateGunTrackingSkelCtrl ( );
	void eventTick ( );
	void GetMortarAimDirAndTargetLoc ( );
	void GetMortarTarget ( );
	void ClearMortarTargets ( );
	void PreMortarAttack ( );
	void CollectMortarTargets ( );
	void GetMortarClass ( );
	void GetMissileAimDirAndTargetLoc ( );
	void GetMissileClass ( );
	void GetAdjustedAimFor ( );
	void eventGetWeaponStartTraceLocation ( );
	void SetGunTracking ( );
	void SpinMinigunBarrels ( );
	void CanMoveWhenMinigunning ( );
	void CanBlock ( );
	void CanDoMortarBarrage ( );
	void CanMortarAttack ( );
	void CanMissileAttack ( );
	void CanTentacleGrab ( );
	void CanChargeAttack ( );
	void StartWeaponCooldown ( );
	void SetPhaseCooldowns ( );
	void OnBattlePhaseChanged ( );
	void IncrementBattlePhase ( );
	void DesireSprintingInThisPhase ( );
	void FleeAndHealBump ( );
	void eventBump ( );
	void BreakOffSyringe ( );
	void ANIMNOTIFY_SpawnedKActor ( );
	void ANIMNOTIFY_GrabSyringe ( );
	void CanSummonChildren ( );
	void SummonChildren ( );
	void SetFleeAndHealMode ( );
	void GetBumpAttackDamageType ( );
	void PossessedBy ( );
	void eventPostInitAnimTree ( );
	void SetCharacterArch ( );
	void eventPostBeginPlay ( );
	void eventReplicatedEvent ( );
};

UClass* AKFPawn_ZedPatriarch::pClassPointer = NULL;

// Class kfgamecontent.AICommand_Patriarch_MinigunBarrage
// 0x0004 (0x00F8 - 0x00F4)
class UAICommand_Patriarch_MinigunBarrage : public UAICommand_SpecialMove
{
public:
	DWORD                                              bIsFanFire : 1;                                   		// 0x00F4 (0x0004) [0x0000000000000000] [0x00000001] 
	DWORD                                              bBeganFire : 1;                                   		// 0x00F4 (0x0004) [0x0000000000000000] [0x00000002] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 110680 ];

		return pClassPointer;
	};

	void GetSpecialMove ( );
	void Popped ( );
	void LockdownAI ( );
	void Pushed ( );
	void MinigunBarrage ( );
};

UClass* UAICommand_Patriarch_MinigunBarrage::pClassPointer = NULL;

// Class kfgamecontent.KFSM_Patriarch_MinigunBarrage
// 0x005C (0x01AC - 0x0150)
class UKFSM_Patriarch_MinigunBarrage : public UKFSM_PlaySingleAnim
{
public:
	class AKFPawn_ZedPatriarch*                        MyPatPawn;                                        		// 0x0150 (0x0008) [0x0000000000000000]              
	class AKFAIController_ZedPatriarch*                MyPatController;                                  		// 0x0158 (0x0008) [0x0000000000000000]              
	struct FName                                       AimOffsetProfileName;                             		// 0x0160 (0x0008) [0x0000000000000000]              
	struct FName                                       WindUpAnimName;                                   		// 0x0168 (0x0008) [0x0000000000000000]              
	struct FName                                       WindDownAnimName;                                 		// 0x0170 (0x0008) [0x0000000000000000]              
	TArray< struct FName >                             FanAnimNames;                                     		// 0x0178 (0x0010) [0x0000000000000000]              
	DWORD                                              bIsFanFire : 1;                                   		// 0x0188 (0x0004) [0x0000000000000000] [0x00000001] 
	DWORD                                              bInterrupted : 1;                                 		// 0x0188 (0x0004) [0x0000000000000000] [0x00000002] 
	DWORD                                              bObstructed : 1;                                  		// 0x0188 (0x0004) [0x0000000000000000] [0x00000004] 
	struct FRotator                                    FocusFireRotationRate;                            		// 0x018C (0x000C) [0x0000000000000000]              
	class UAkEvent*                                    MinigunLoop;                                      		// 0x0198 (0x0008) [0x0000000000000000]              
	class UAkEvent*                                    MinigunLoopEnd;                                   		// 0x01A0 (0x0008) [0x0000000000000000]              
	float                                              VisibilityCheckTime;                              		// 0x01A8 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 110710 ];

		return pClassPointer;
	};

	void SpecialMoveEnded ( );
	void AnimEndNotify ( );
	void PlayWindDownAnim ( );
	void Timer_SearchForMinigunTargets ( );
	void Timer_CheckIfFireAllowed ( );
	void PlayFireAnim ( );
	void SpecialMoveFlagsUpdated ( );
	void Timer_CheckEnemyLOS ( );
	void PlayWindUpAnimation ( );
	void PlayAnimation ( );
	void GetAnimStance ( );
	void SpecialMoveStarted ( );
	void PackSMFlags ( );
};

UClass* UKFSM_Patriarch_MinigunBarrage::pClassPointer = NULL;

// Class kfgamecontent.AICommand_Patriarch_MissileAttack
// 0x0000 (0x00F4 - 0x00F4)
class UAICommand_Patriarch_MissileAttack : public UAICommand_SpecialMove
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 110715 ];

		return pClassPointer;
	};

	void Popped ( );
	void Pushed ( );
	void FireMissiles ( );
};

UClass* UAICommand_Patriarch_MissileAttack::pClassPointer = NULL;

// Class kfgamecontent.AICommand_Patriarch_MortarAttack
// 0x0004 (0x00F8 - 0x00F4)
class UAICommand_Patriarch_MortarAttack : public UAICommand_SpecialMove
{
public:
	DWORD                                              bDoBarrage : 1;                                   		// 0x00F4 (0x0004) [0x0000000000000000] [0x00000001] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 110732 ];

		return pClassPointer;
	};

	void Popped ( );
	void Pushed ( );
	void FireMortar ( );
};

UClass* UAICommand_Patriarch_MortarAttack::pClassPointer = NULL;

// Class kfgamecontent.AICommand_Siren_Scream
// 0x0008 (0x00FC - 0x00F4)
class UAICommand_Siren_Scream : public UAICommand_SpecialMove
{
public:
	int                                                MinScreamRangeSQ;                                 		// 0x00F4 (0x0004) [0x0000000000000000]              
	int                                                MaxScreamRangeSQ;                                 		// 0x00F8 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 110750 ];

		return pClassPointer;
	};

	void Popped ( );
	void Pushed ( );
	void LockdownAI ( );
	void Scream ( );
};

UClass* UAICommand_Siren_Scream::pClassPointer = NULL;

// Class kfgamecontent.KFAIController_ZedSiren
// 0x000C (0x0ACC - 0x0AC0)
class AKFAIController_ZedSiren : public AKFAIController_Monster
{
public:
	float                                              ScreamDelayTime;                                  		// 0x0AC0 (0x0004) [0x0000000000000000]              
	float                                              ScreamCooldown;                                   		// 0x0AC4 (0x0004) [0x0000000000000000]              
	float                                              LastScreamTime;                                   		// 0x0AC8 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 110772 ];

		return pClassPointer;
	};

	void EnterZedVictoryState ( );
	void DoPanicWander ( );
	void NotifyCommandFinished ( );
	void NotifyMeleeAttackFinished ( );
	void NotifyReachedLatentMoveGoal ( );
	void NotifySpecialMoveEnded ( );
	void NotifySpecialMoveStarted ( );
	void AcquireEnemyAndScream ( );
	void DoScream ( );
	void PreMoveToEnemy ( );
};

UClass* AKFAIController_ZedSiren::pClassPointer = NULL;

// Class kfgamecontent.KFAffliction_Fire_Patriarch
// 0x0000 (0x00CC - 0x00CC)
class UKFAffliction_Fire_Patriarch : public UKFAffliction_Fire
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 110777 ];

		return pClassPointer;
	};

	void SetMaterialParameter ( );
};

UClass* UKFAffliction_Fire_Patriarch::pClassPointer = NULL;

// Class kfgamecontent.KFAIController_HansFriendlyTest
// 0x0008 (0x0BEC - 0x0BE4)
class AKFAIController_HansFriendlyTest : public AKFAIController_Hans
{
public:
	float                                              EnemyVisionCheckInterval;                         		// 0x0BE4 (0x0004) [0x0000000000000000]              
	float                                              LastEnemyVisionCheckTime;                         		// 0x0BE8 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 110781 ];

		return pClassPointer;
	};

	void NotifyTakeHit ( );
	void ShouldSprint ( );
	void eventScriptGetTeamNum ( );
	void InitPlayerReplicationInfo ( );
};

UClass* AKFAIController_HansFriendlyTest::pClassPointer = NULL;

// Class kfgamecontent.KFPawn_ZedHusk
// 0x004C (0x0DF0 - 0x0DA4)
class AKFPawn_ZedHusk : public AKFPawn_Monster
{
public:
	class UClass*                                      FireballClass;                                    		// 0x0DA4 (0x0008) [0x0000000000000000]              
	struct FsHuskFireballSettings                      FireballSettings;                                 		// 0x0DAC (0x0008) [0x0000000000000000]              
	struct FVector                                     PlayerFireOffset;                                 		// 0x0DB4 (0x000C) [0x0000000000000000]              
	class UKFGameExplosion*                            ExplosionTemplate;                                		// 0x0DC0 (0x0008) [0x0000000000000000]              
	DWORD                                              bHasExploded : 1;                                 		// 0x0DC8 (0x0004) [0x0000000000000000] [0x00000001] 
	DWORD                                              bHasSuicideExploded : 1;                          		// 0x0DC8 (0x0004) [0x0000000000000000] [0x00000002] 
	DWORD                                              bUseFireballLightRadius : 1;                      		// 0x0DC8 (0x0004) [0x0000000000000000] [0x00000004] 
	class UPointLightComponent*                        ChestLightComponent;                              		// 0x0DCC (0x0008) [0x0000000000000000]              
	struct FName                                       ChestLightSocketName;                             		// 0x0DD4 (0x0008) [0x0000000000000000]              
	float                                              FireballChargeLightRadius;                        		// 0x0DDC (0x0004) [0x0000000000000000]              
	float                                              AmbientLightRadiusInterpSpeed;                    		// 0x0DE0 (0x0004) [0x0000000000000000]              
	float                                              FireballLightRadiusInterpSpeed;                   		// 0x0DE4 (0x0004) [0x0000000000000000]              
	float                                              FireballLightMinBrightness;                       		// 0x0DE8 (0x0004) [0x0000000000000000]              
	float                                              FireballLightMaxBrightness;                       		// 0x0DEC (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 110876 ];

		return pClassPointer;
	};

	void GetTraderAdviceID ( );
	void OnStackingAfflictionChanged ( );
	void PlayHit ( );
	void NotifyTakeHit ( );
	void AdjustDamage ( );
	void OnExploded ( );
	void WeeklyShouldExplodeOnDeath ( );
	void TriggerExplosion ( );
	void HitZoneInjured ( );
	void CanInjureHitZone ( );
	void ApplySpecialZoneHealthMod ( );
	void GetSuicideSM ( );
	void OnAnimNotifyParticleSystemSpawned ( );
	void TerminateEffectsOnDeath ( );
	void eventGetWeaponStartTraceLocation ( );
	void ANIMNOTIFY_HuskFireballAttack ( );
	void eventTick ( );
	void SetFireLightEnabled ( );
	void ANIMNOTIFY_WarnZedsOfFireball ( );
	void NotifyAnimInterrupt ( );
	void ANIMNOTIFY_FlameThrowerOff ( );
	void ANIMNOTIFY_FlameThrowerOn ( );
	void SetCharacterArch ( );
	void PossessedBy ( );
};

UClass* AKFPawn_ZedHusk::pClassPointer = NULL;

// Class kfgamecontent.KFProj_Husk_Fireball
// 0x001C (0x03B8 - 0x039C)
class AKFProj_Husk_Fireball : public AKFProjectile
{
public:
	float                                              BurnDuration;                                     		// 0x039C (0x0004) [0x0000000000000000]              
	float                                              BurnDamageInterval;                               		// 0x03A0 (0x0004) [0x0000000000000000]              
	class UClass*                                      GroundFireExplosionActorClass;                    		// 0x03A4 (0x0008) [0x0000000000000000]              
	DWORD                                              bSpawnGroundFire : 1;                             		// 0x03AC (0x0004) [0x00000000001E0000] [0x00000001] ( CPF_EditConst | CPF_GlobalConfig | CPF_Component )
	class UKFGameExplosion*                            GroundFireExplosionTemplate;                      		// 0x03B0 (0x0008) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 110880 ];

		return pClassPointer;
	};

	void TriggerExplosion ( );
	void PrepareExplosionTemplate ( );
};

UClass* AKFProj_Husk_Fireball::pClassPointer = NULL;

// Class kfgamecontent.KFAIController_HuskFriendlyTest
// 0x0000 (0x0B3C - 0x0B3C)
class AKFAIController_HuskFriendlyTest : public AKFAIController_ZedHusk
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 110884 ];

		return pClassPointer;
	};

	void CanDoFlamethrower ( );
	void CanDoFireball ( );
	void eventScriptGetTeamNum ( );
	void InitPlayerReplicationInfo ( );
};

UClass* AKFAIController_HuskFriendlyTest::pClassPointer = NULL;

// Class kfgamecontent.KFAIController_ZedBloat
// 0x0000 (0x0AC0 - 0x0AC0)
class AKFAIController_ZedBloat : public AKFAIController_Monster
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 110895 ];

		return pClassPointer;
	};

};

UClass* AKFAIController_ZedBloat::pClassPointer = NULL;

// Class kfgamecontent.KFAIController_ZedClot_Alpha
// 0x0000 (0x0AC0 - 0x0AC0)
class AKFAIController_ZedClot_Alpha : public AKFAIController_ZedClot
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 110897 ];

		return pClassPointer;
	};

};

UClass* AKFAIController_ZedClot_Alpha::pClassPointer = NULL;

// Class kfgamecontent.KFAIController_ZedClot_AlphaKing
// 0x000C (0x0ACC - 0x0AC0)
class AKFAIController_ZedClot_AlphaKing : public AKFAIController_ZedClot_Alpha
{
public:
