/*
#############################################################################################
# Killing Floor 2 (1.8787) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: kfgamecontent_classes.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/

#define CONST_MaxPhases                                          4
#define CONST_MAX_ACTIVE_PUKE_MINES                              30
#define CONST_BOSS_WAVE                                          5
#define CONST_FriendlyZedInfoShowDistanceSQ                      562000
#define CONST_ChestBombZoneIndex                                 3
#define CONST_BackpackZoneIndex                                  3
#define CONST_MINMINEFLOORZ                                      0.8f

#define CONST_CrouchDetonateAnim                                 'CH_Shoot'
#define CONST_WeaponShoot                                        'Shoot'
#define CONST_CH_SecondaryReloadAnim                             'Reload_Secondary_CH'
#define CONST_SecondaryReloadEliteAnim                           'Reload_Secondary_Elite'
#define CONST_CH_SecondaryReloadEliteAnim                        'Reload_Secondary_Elite_CH'
#define CONST_PulverizerShoot_F                                  'Atk_F_Shoot'
#define CONST_PulverizerShoot_B                                  'Atk_B_Shoot'
#define CONST_PulverizerShoot_L                                  'Atk_L_Shoot'
#define CONST_PulverizerShoot_R                                  'Atk_R_Shoot'
#define CONST_CH_PulverizerShoot_F                               'Atk_F_Shoot_CH'
#define CONST_CH_PulverizerShoot_B                               'Atk_B_Shoot_CH'
#define CONST_CH_PulverizerShoot_L                               'Atk_L_Shoot_CH'
#define CONST_CH_PulverizerShoot_R                               'Atk_R_Shoot_CH'

/*
# ========================================================================================= #
# Enums
# ========================================================================================= #
*/

// Enum kfgamecontent.KFGameInfo_Survival.EWaveEndCondition
/*enum EWaveEndCondition
{
	WEC_WaveWon                                        = 0,
	WEC_TeamWipedOut                                   = 1,
	WEC_GameWon                                        = 2,
	WEC_MAX                                            = 3
};*/

// Enum kfgamecontent.KFMG_BloatDunk.eBloatGameState
/*enum eBloatGameState
{
	BGS_Off                                            = 0,
	BGS_On                                             = 1,
	BGS_Victory                                        = 2,
	BGS_Defeat                                         = 3,
	BGS_MAX                                            = 4
};*/

// Enum kfgamecontent.KFMG_RiggedTargetGame.eAnimationState
/*enum eAnimationState
{
	EAS_Closed                                         = 0,
	EAS_Open                                           = 1,
	EAS_Active                                         = 2,
	EAS_Idle                                           = 3,
	EAS_Close                                          = 4,
	EAS_MAX                                            = 5
};*/

// Enum kfgamecontent.KFProj_Thrown_C4.EImpactResult
/*enum EImpactResult
{
	EIR_None                                           = 0,
	EIR_Stick                                          = 1,
	EIR_Bounce                                         = 2,
	EIR_MAX                                            = 3
};*/


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class kfgamecontent.AICommand_Base_Patriarch
// 0x0000 (0x00E8 - 0x00E8)
class UAICommand_Base_Patriarch : public UAICommand_Base_Boss
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class kfgamecontent.AICommand_Base_Patriarch" );

		return pClassPointer;
	};

};

UClass* UAICommand_Base_Patriarch::pClassPointer = NULL;

// Class kfgamecontent.KFAIController_ZedPatriarch
// 0x0110 (0x0BD8 - 0x0AC8)
class AKFAIController_ZedPatriarch : public AKFAIController_ZedBoss
{
public:
	class AKFPawn_ZedPatriarch*                        MyPatPawn;                                        		// 0x0AC8 (0x0008) [0x0000000000000000]              
	DWORD                                              bCanEvaluateAttacks : 1;                          		// 0x0AD0 (0x0004) [0x0000000000000000] [0x00000001] 
	DWORD                                              bDoingChargeAttack : 1;                           		// 0x0AD0 (0x0004) [0x0000000000000000] [0x00000002] 
	DWORD                                              bWantsToCharge : 1;                               		// 0x0AD0 (0x0004) [0x0000000000000000] [0x00000004] 
	DWORD                                              bHadMinigunAttack : 1;                            		// 0x0AD0 (0x0004) [0x0000000000000000] [0x00000008] 
	DWORD                                              bSprintUntilAttack : 1;                           		// 0x0AD0 (0x0004) [0x0000000000000000] [0x00000010] 
	DWORD                                              bRaging : 1;                                      		// 0x0AD0 (0x0004) [0x0000000000000000] [0x00000020] 
	DWORD                                              bRagedThisPhase : 1;                              		// 0x0AD0 (0x0004) [0x0000000000000000] [0x00000040] 
	DWORD                                              bWantsToFlee : 1;                                 		// 0x0AD0 (0x0004) [0x0000000000000000] [0x00000080] 
	DWORD                                              bFleeing : 1;                                     		// 0x0AD0 (0x0004) [0x0000000000000000] [0x00000100] 
	DWORD                                              bFleeInterrupted : 1;                             		// 0x0AD0 (0x0004) [0x0000000000000000] [0x00000200] 
	float                                              LostSightSprintDelay;                             		// 0x0AD4 (0x0004) [0x0000000000000000]              
	float                                              AggroFalloffWaitTime;                             		// 0x0AD8 (0x0004) [0x0000000000000000]              
	float                                              AggroFalloffPerSecond;                            		// 0x0ADC (0x0004) [0x0000000000000000]              
	float                                              VisibleAggroDmgThreshold;                         		// 0x0AE0 (0x0004) [0x0000000000000000]              
	float                                              HiddenAggroDmgThreshold;                          		// 0x0AE4 (0x0004) [0x0000000000000000]              
	TArray< struct FPatriarch_TrackedEnemyInfo >       RecentlySeenEnemyList;                            		// 0x0AE8 (0x0010) [0x0000000000000000]              
	TArray< struct FPatriarch_TrackedEnemyInfo >       HiddenEnemies;                                    		// 0x0AF8 (0x0010) [0x0000000000000000]              
	TArray< class AKFPawn* >                           LastMinigunEnemies;                               		// 0x0B08 (0x0010) [0x0000000000000000]              
	float                                              MinMinigunRangeSQ;                                		// 0x0B18 (0x0004) [0x0000000000000000]              
	float                                              MaxMinigunRangeSQ;                                		// 0x0B1C (0x0004) [0x0000000000000000]              
	float                                              MaxFanFireRangeSQ;                                		// 0x0B20 (0x0004) [0x0000000000000000]              
	TArray< class AKFPawn* >                           LastChargedPlayers;                               		// 0x0B24 (0x0010) [0x0000000000000000]              
	float                                              MinChargeRangeSQ;                                 		// 0x0B34 (0x0004) [0x0000000000000000]              
	float                                              LastChargeAttackTime;                             		// 0x0B38 (0x0004) [0x0000000000000000]              
	class APawn*                                       CachedChargeTarget;                               		// 0x0B3C (0x0008) [0x0000000000000000]              
	TArray< class AKFPawn* >                           LastGrabbedPlayers;                               		// 0x0B44 (0x0010) [0x0000000000000000]              
	float                                              LastGrabAttackTime;                               		// 0x0B54 (0x0004) [0x0000000000000000]              
	float                                              MinTentacleRangeSQ;                               		// 0x0B58 (0x0004) [0x0000000000000000]              
	TArray< class AKFPawn* >                           LastMissileEnemies;                               		// 0x0B5C (0x0010) [0x0000000000000000]              
	float                                              LastMissileAttackTime;                            		// 0x0B6C (0x0004) [0x0000000000000000]              
	float                                              MinMissileRangeSQ;                                		// 0x0B70 (0x0004) [0x0000000000000000]              
	float                                              MaxMissileRangeSQ;                                		// 0x0B74 (0x0004) [0x0000000000000000]              
	float                                              LastMortarAttackTime;                             		// 0x0B78 (0x0004) [0x0000000000000000]              
	float                                              LastSuccessfulAttackTime;                         		// 0x0B7C (0x0004) [0x0000000000000000]              
	float                                              RecentSeenEnemyListUpdateInterval;                		// 0x0B80 (0x0004) [0x0000000000000000]              
	float                                              LastRecentSeenEnemyListUpdateTime;                		// 0x0B84 (0x0004) [0x0000000000000000]              
	float                                              LastAttackMoveFinishTime;                         		// 0x0B88 (0x0004) [0x0000000000000000]              
	float                                              NextAttackCheckTime;                              		// 0x0B8C (0x0004) [0x0000000000000000]              
	float                                              LastSprintTime;                                   		// 0x0B90 (0x0004) [0x0000000000000000]              
	float                                              LastRetargetTime;                                 		// 0x0B94 (0x0004) [0x0000000000000000]              
	float                                              RetargetWaitTime;                                 		// 0x0B98 (0x0004) [0x0000000000000000]              
	int                                                MaxRageAttacks;                                   		// 0x0B9C (0x0004) [0x0000000000000000]              
	int                                                RageAttackCount;                                  		// 0x0BA0 (0x0004) [0x0000000000000000]              
	float                                              MaxRageRangeSQ;                                   		// 0x0BA4 (0x0004) [0x0000000000000000]              
	float                                              RageTimeOut;                                      		// 0x0BA8 (0x0004) [0x0000000000000000]              
	TArray< class AKFPawn* >                           RageAttackedTargets;                              		// 0x0BAC (0x0010) [0x0000000000000000]              
	int                                                HumanBumpDamage;                                  		// 0x0BBC (0x0004) [0x0000000000000000]              
	int                                                HumanBumpMomentum;                                		// 0x0BC0 (0x0004) [0x0000000000000000]              
	float                                              FleeHealthThreshold;                              		// 0x0BC4 (0x0004) [0x0000000000000000]              
	float                                              MaxFleeDuration;                                  		// 0x0BC8 (0x0004) [0x0000000000000000]              
	float                                              MaxFleeDistance;                                  		// 0x0BCC (0x0004) [0x0000000000000000]              
	float                                              FleeStartTime;                                    		// 0x0BD0 (0x0004) [0x0000000000000000]              
	float                                              TotalFleeTime;                                    		// 0x0BD4 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class kfgamecontent.KFAIController_ZedPatriarch" );

		return pClassPointer;
	};

	void DrawDebug ( );
	void PlayDamagePlayerDialog ( );
	void EnterZedVictoryState ( );
	void ForceHeal ( );
	void NotifyFleeFinished ( );
	void Flee ( );
	void DoFleeFrom ( );
	void DoHeavyZedBump ( );
	void DoHeavyBump ( );
	void Timer_SearchForChargeObstructions ( );
	void Timer_SearchForFleeObstructions ( );
	void NextBattlePhase ( );
	void Timer_StopSummoningZeds ( );
	void AmIAllowedToSuicideWhenStuck ( );
	void Timer_RageTimeOut ( );
	void UpdateRageState ( );
	void StartPaternalInstinct ( );
	void NotifyTakeHit ( );
	void NotifyKilled ( );
	void NotifyMeleeDamageDealt ( );
	void NotifySpecialMoveEnded ( );
	void NotifyCommandFinished ( );
	void NotifyAttackActor ( );
	void DoorFinished ( );
	void NotifyAttackDoor ( );
	void SomeEnemiesAreHidden ( );
	void IsCeilingClear ( );
	void CanSetSprinting ( );
	void ShouldSprint ( );
	void EvaluateSprinting ( );
	void DoStrike ( );
	void GetAdjustedAimFor ( );
	void IsWeaponArmClear ( );
	void EvaluateAttacks ( );
	void UpdateRecentlySeenEnemyList ( );
	void eventSeePlayer ( );
	void Tick ( );
	void SetBestTarget ( );
	void eventChangeEnemy ( );
	void ForceSetEnemy ( );
	void eventSetEnemy ( );
	void eventFindNewEnemy ( );
	void GetAggroRating ( );
	void CanSwitchEnemies ( );
	void IsAggroEnemySwitchAllowed ( );
	void eventDestroyed ( );
	void PawnDied ( );
	void eventPossess ( );
};

UClass* AKFAIController_ZedPatriarch::pClassPointer = NULL;

// Class kfgamecontent.AICommand_BloatKing_Gorge
// 0x0000 (0x00F4 - 0x00F4)
class UAICommand_BloatKing_Gorge : public UAICommand_SpecialMove
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class kfgamecontent.AICommand_BloatKing_Gorge" );

		return pClassPointer;
	};

	void Popped ( );
	void Pushed ( );
	void StartGorge ( );
};

UClass* UAICommand_BloatKing_Gorge::pClassPointer = NULL;

// Class kfgamecontent.KFAIController_ZedBloat
// 0x0000 (0x0AC4 - 0x0AC4)
class AKFAIController_ZedBloat : public AKFAIController_Monster
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class kfgamecontent.KFAIController_ZedBloat" );

		return pClassPointer;
	};

};

UClass* AKFAIController_ZedBloat::pClassPointer = NULL;

// Class kfgamecontent.KFAIController_ZedBloatKing
// 0x007C (0x0B40 - 0x0AC4)
class AKFAIController_ZedBloatKing : public AKFAIController_ZedBloat
{
public:
	class AKFPawn_ZedBloatKing*                        BloatPawn;                                        		// 0x0AC4 (0x0008) [0x0000000000000000]              
	float                                              LostSightSprintDelay;                             		// 0x0ACC (0x0004) [0x0000000000000000]              
	float                                              MinionSpawnTimer[ 0x4 ];                          		// 0x0AD0 (0x0010) [0x0000000000000000]              
	struct FVector2D                                   NumMinionsToSpawn[ 0x4 ];                         		// 0x0AE0 (0x0020) [0x0000000000000000]              
	class UKFAIWaveInfo*                               ContinuousSpawnWaveInfos[ 0x4 ];                  		// 0x0B00 (0x0020) [0x0000000000000000]              
	float                                              ArmorEnrageTimer;                                 		// 0x0B20 (0x0004) [0x0000000000000000]              
	float                                              NextSpecialMoveCheck;                             		// 0x0B24 (0x0004) [0x0000000000000000]              
	float                                              NextGorgeAttackCheck;                             		// 0x0B28 (0x0004) [0x0000000000000000]              
	float                                              NextHumanGorgeAttackCheck;                        		// 0x0B2C (0x0004) [0x0000000000000000]              
	float                                              LastRetargetTime;                                 		// 0x0B30 (0x0004) [0x0000000000000000]              
	struct FVector2D                                   RetargetWaitTimeRange;                            		// 0x0B34 (0x0008) [0x0000000000000000]              
	float                                              ActualRetargetWaitTime;                           		// 0x0B3C (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class kfgamecontent.KFAIController_ZedBloatKing" );

		return pClassPointer;
	};

	void EnterZedVictoryState ( );
	void PawnDied ( );
	void EndArmorEnrage ( );
	void StartArmorEnrage ( );
	void SetEnrageTimer ( );
	void GetNumMinionsToSpawn ( );
	void GetWaveInfo ( );
	void StopBossWave ( );
	void PauseBossWave ( );
	void SpawnMinions ( );
	void StartMinionWaves ( );
	void ShouldSprint ( );
	void EvaluateSprinting ( );
	void eventChangeEnemy ( );
	void NotifySpecialMoveEnded ( );
	void eventSeePlayer ( );
	void CanDoGorgeAttack ( );
	void TriggerGorge ( );
	void EvaluateSpecialMoves ( );
	void AmIAllowedToSuicideWhenStuck ( );
	void Tick ( );
	void eventPossess ( );
};

UClass* AKFAIController_ZedBloatKing::pClassPointer = NULL;

// Class kfgamecontent.AICommand_BloatKingSubspawn_Explode
// 0x0000 (0x00F4 - 0x00F4)
class UAICommand_BloatKingSubspawn_Explode : public UAICommand_SpecialMove
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class kfgamecontent.AICommand_BloatKingSubspawn_Explode" );

		return pClassPointer;
	};

	void Popped ( );
	void Pushed ( );
	void StartExplode ( );
};

UClass* UAICommand_BloatKingSubspawn_Explode::pClassPointer = NULL;

// Class kfgamecontent.KFAIController_ZedBloatKingSubspawn
// 0x000C (0x0AD0 - 0x0AC4)
class AKFAIController_ZedBloatKingSubspawn : public AKFAIController_Monster
{
public:
	float                                              ExplosionRadiusSq;                                		// 0x0AC4 (0x0004) [0x0000000000000000]              
	class AKFPawn_ZedBloatKingSubspawn*                PoopPawn;                                         		// 0x0AC8 (0x0008) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class kfgamecontent.KFAIController_ZedBloatKingSubspawn" );

		return pClassPointer;
	};

	void CheckMeleeTargetExplosion ( );
	void CanDoStrike ( );
	void Tick ( );
	void eventPossess ( );
};

UClass* AKFAIController_ZedBloatKingSubspawn::pClassPointer = NULL;

// Class kfgamecontent.AICommand_RangedAttack
// 0x0018 (0x010C - 0x00F4)
class UAICommand_RangedAttack : public UAICommand_SpecialMove
{
public:
	struct FVector                                     LastKnownEnemyLocation;                           		// 0x00F4 (0x000C) [0x0000000000000000]              
	float                                              LastEnemyLocationCheckTime;                       		// 0x0100 (0x0004) [0x0000000000000000]              
	class UClass*                                      SpecialMoveClass;                                 		// 0x0104 (0x0008) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class kfgamecontent.AICommand_RangedAttack" );

		return pClassPointer;
	};

	void eventHandleAICommandSpecialAction ( );
	void Popped ( );
	void Pushed ( );
};

UClass* UAICommand_RangedAttack::pClassPointer = NULL;

// Class kfgamecontent.AICommand_DAR_EMPAttack
// 0x0000 (0x010C - 0x010C)
class UAICommand_DAR_EMPAttack : public UAICommand_RangedAttack
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class kfgamecontent.AICommand_DAR_EMPAttack" );

		return pClassPointer;
	};

	void Popped ( );
	void Pushed ( );
	void EMPAttack ( );
};

UClass* UAICommand_DAR_EMPAttack::pClassPointer = NULL;

// Class kfgamecontent.KFAIController_Ranged
// 0x0004 (0x0AC8 - 0x0AC4)
class AKFAIController_Ranged : public AKFAIController_Monster
{
public:
	DWORD                                              bDebugAimError : 1;                               		// 0x0AC4 (0x0004) [0x0000000000000000] [0x00000001] 
	DWORD                                              bCanLeadTarget : 1;                               		// 0x0AC4 (0x0004) [0x0000000000000000] [0x00000002] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class kfgamecontent.KFAIController_Ranged" );

		return pClassPointer;
	};

	void DebugAimError ( );
};

UClass* AKFAIController_Ranged::pClassPointer = NULL;

// Class kfgamecontent.KFAIController_ZedDAR
// 0x004C (0x0B14 - 0x0AC8)
class AKFAIController_ZedDAR : public AKFAIController_Ranged
{
public:
	float                                              MinRangeAttackDist;                               		// 0x0AC8 (0x0004) [0x0000000000000000]              
	float                                              MaxRangeAttackDist;                               		// 0x0ACC (0x0004) [0x0000000000000000]              
	float                                              LastRangeAttackTime;                              		// 0x0AD0 (0x0004) [0x0000000000000000]              
	float                                              TimeBetweenRangeAttacks;                          		// 0x0AD4 (0x0004) [0x0000000000000000]              
	float                                              BaseTimeBetweenRangeAttacks;                      		// 0x0AD8 (0x0004) [0x0000000000000000]              
	float                                              TimeBetweenRangeAttackVariance;                   		// 0x0ADC (0x0004) [0x0000000000000000]              
	float                                              CheckSpecialMoveTime;                             		// 0x0AE0 (0x0004) [0x0000000000000000]              
	float                                              LastCheckSpecialMoveTime;                         		// 0x0AE4 (0x0004) [0x0000000000000000]              
	struct FName                                       FiringSocketName;                                 		// 0x0AE8 (0x0008) [0x0000000000000000]              
	float                                              RangeAttackIntervalNormal;                        		// 0x0AF0 (0x0004) [0x0000000000000000]              
	float                                              RangeAttackIntervalHard;                          		// 0x0AF4 (0x0004) [0x0000000000000000]              
	float                                              RangeAttackIntervalSuicidal;                      		// 0x0AF8 (0x0004) [0x0000000000000000]              
	float                                              RangeAttackIntervalHellOnEarth;                   		// 0x0AFC (0x0004) [0x0000000000000000]              
	float                                              HeadLossAttackTimeDebuff;                         		// 0x0B00 (0x0004) [0x0000000000000000]              
	float                                              HeadLossAccuracyDebuffPct;                        		// 0x0B04 (0x0004) [0x0000000000000000]              
	float                                              AimError;                                         		// 0x0B08 (0x0004) [0x0000000000000000]              
	DWORD                                              bAllowedToSprint : 1;                             		// 0x0B0C (0x0004) [0x0000000000000000] [0x00000001] 
	DWORD                                              bCanEvade : 1;                                    		// 0x0B0C (0x0004) [0x0000000000000000] [0x00000002] 
	int                                                ArmorLossStumblePower;                            		// 0x0B10 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class kfgamecontent.KFAIController_ZedDAR" );

		return pClassPointer;
	};

	void OnArmorLoss ( );
	void CanEvade ( );
	void ShouldSprint ( );
	void GetStartFireLocation ( );
	void FireRangedAttack ( );
	void StartRangedAttack ( );
	void eventSetEnemy ( );
	void Tick ( );
	void CanDoRangedAttack ( );
	void GetAttackIntervalByDifficulty ( );
	void eventPostBeginPlay ( );
};

UClass* AKFAIController_ZedDAR::pClassPointer = NULL;

// Class kfgamecontent.KFAIController_ZedDAR_EMP
// 0x0008 (0x0B1C - 0x0B14)
class AKFAIController_ZedDAR_EMP : public AKFAIController_ZedDAR
{
public:
	struct FName                                       EMPSocketName;                                    		// 0x0B14 (0x0008) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class kfgamecontent.KFAIController_ZedDAR_EMP" );

		return pClassPointer;
	};

	void StartRangedAttack ( );
};

UClass* AKFAIController_ZedDAR_EMP::pClassPointer = NULL;

// Class kfgamecontent.KFSM_DAR_EMPAttack
// 0x0088 (0x0204 - 0x017C)
class UKFSM_DAR_EMPAttack : public UKFSM_RangedAttack
{
public:
	class UParticleSystem*                             EMPPSCTemplate;                                   		// 0x017C (0x0008) [0x0000000000000000]              
	class UParticleSystemComponent*                    EMPPSC;                                           		// 0x0184 (0x0008) [0x0000000000000000]              
	class UParticleSystem*                             EMPHitPSCTemplate;                                		// 0x018C (0x0008) [0x0000000000000000]              
	class UParticleSystemComponent*                    EMPHitPSC;                                        		// 0x0194 (0x0008) [0x0000000000000000]              
	class UAkEvent*                                    EMPStartSFX;                                      		// 0x019C (0x0008) [0x0000000000000000]              
	class UAkEvent*                                    EMPEndSFX;                                        		// 0x01A4 (0x0008) [0x0000000000000000]              
	class UAkEvent*                                    EMPHitSFX;                                        		// 0x01AC (0x0008) [0x0000000000000000]              
	class UAkEvent*                                    EMPHitStopSFX;                                    		// 0x01B4 (0x0008) [0x0000000000000000]              
	class UCameraShake*                                EMPHitShake;                                      		// 0x01BC (0x0008) [0x0000000000000000]              
	struct FName                                       EMPSocketName;                                    		// 0x01C4 (0x0008) [0x0000000000000000]              
	class UClass*                                      EMPDamageType;                                    		// 0x01CC (0x0008) [0x0000000000000000]              
	float                                              MaxEMPLength;                                     		// 0x01D4 (0x0004) [0x0000000000000000]              
	struct FVector                                     EMPExtent;                                        		// 0x01D8 (0x000C) [0x0000000000000000]              
	int                                                EMPDamage;                                        		// 0x01E4 (0x0004) [0x0000000000000000]              
	TArray< struct FEMPBlastHitInfo >                  Victims;                                          		// 0x01E8 (0x0010) [0x0000000000000000]              
	float                                              ApplyDamageDelay;                                 		// 0x01F8 (0x0004) [0x0000000000000000]              
	DWORD                                              bDrawDebugEMP : 1;                                		// 0x01FC (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              GrappleTime;                                      		// 0x0200 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class kfgamecontent.KFSM_DAR_EMPAttack" );

		return pClassPointer;
	};

	void DeactivateHitPSC ( );
	void DeactivatePSC ( );
	void ReleaseVictims ( );
	void ApplyDamage ( );
	void GetEnemyByTrace ( );
	void SetEMPEndPoint ( );
	void WithinRange ( );
	void IsValidTarget ( );
	void DisableEMP ( );
	void ToggleEMP ( );
	void SpecialMoveEnded ( );
	void SpecialMoveStarted ( );
};

UClass* UKFSM_DAR_EMPAttack::pClassPointer = NULL;

// Class kfgamecontent.AICommand_DAR_LaserAttack
// 0x0000 (0x010C - 0x010C)
class UAICommand_DAR_LaserAttack : public UAICommand_RangedAttack
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class kfgamecontent.AICommand_DAR_LaserAttack" );

		return pClassPointer;
	};

	void Popped ( );
	void Pushed ( );
	void LaserAttack ( );
};

UClass* UAICommand_DAR_LaserAttack::pClassPointer = NULL;

// Class kfgamecontent.KFAIController_ZedDAR_Laser
// 0x0000 (0x0B14 - 0x0B14)
class AKFAIController_ZedDAR_Laser : public AKFAIController_ZedDAR
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class kfgamecontent.KFAIController_ZedDAR_Laser" );

		return pClassPointer;
	};

	void GetStartFireLocation ( );
	void StartRangedAttack ( );
};

UClass* AKFAIController_ZedDAR_Laser::pClassPointer = NULL;

// Class kfgamecontent.KFSM_DAR_LaserAttack
// 0x0000 (0x017C - 0x017C)
class UKFSM_DAR_LaserAttack : public UKFSM_RangedAttack
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class kfgamecontent.KFSM_DAR_LaserAttack" );

		return pClassPointer;
	};

};

UClass* UKFSM_DAR_LaserAttack::pClassPointer = NULL;

// Class kfgamecontent.AICommand_DAR_RocketAttack
// 0x0000 (0x010C - 0x010C)
class UAICommand_DAR_RocketAttack : public UAICommand_RangedAttack
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class kfgamecontent.AICommand_DAR_RocketAttack" );

		return pClassPointer;
	};

	void Popped ( );
	void Pushed ( );
	void RocketAttack ( );
};

UClass* UAICommand_DAR_RocketAttack::pClassPointer = NULL;

// Class kfgamecontent.KFAIController_ZedDAR_Rocket
// 0x0000 (0x0B14 - 0x0B14)
class AKFAIController_ZedDAR_Rocket : public AKFAIController_ZedDAR
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class kfgamecontent.KFAIController_ZedDAR_Rocket" );

		return pClassPointer;
	};

	void GetStartFireLocation ( );
	void StartRangedAttack ( );
};

UClass* AKFAIController_ZedDAR_Rocket::pClassPointer = NULL;

// Class kfgamecontent.KFSM_DAR_RocketAttack
// 0x0000 (0x017C - 0x017C)
class UKFSM_DAR_RocketAttack : public UKFSM_RangedAttack
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class kfgamecontent.KFSM_DAR_RocketAttack" );

		return pClassPointer;
	};

};

UClass* UKFSM_DAR_RocketAttack::pClassPointer = NULL;

// Class kfgamecontent.AICommand_FleshpoundKing_ChestBeamAttack
// 0x0000 (0x00F4 - 0x00F4)
class UAICommand_FleshpoundKing_ChestBeamAttack : public UAICommand_SpecialMove
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class kfgamecontent.AICommand_FleshpoundKing_ChestBeamAttack" );

		return pClassPointer;
	};

	void Popped ( );
	void Pushed ( );
	void ChestBeamAttack ( );
};

UClass* UAICommand_FleshpoundKing_ChestBeamAttack::pClassPointer = NULL;

// Class kfgamecontent.KFAIController_ZedFleshpoundKing
// 0x0038 (0x0B4C - 0x0B14)
class AKFAIController_ZedFleshpoundKing : public AKFAIController_ZedFleshpound
{
public:
	class AKFPawn_ZedFleshpoundKing*                   MyPawn;                                           		// 0x0B14 (0x0008) [0x0000000000000000]              
	float                                              NextBeamCheckTime;                                		// 0x0B1C (0x0004) [0x0000000000000000]              
	float                                              LastBeamTickTime;                                 		// 0x0B20 (0x0004) [0x0000000000000000]              
	struct FVector2D                                   BeamAttackWaitTimeRange;                          		// 0x0B24 (0x0008) [0x0000000000000000]              
	float                                              MinChestBeamTargetAngle;                          		// 0x0B2C (0x0004) [0x0000000000000000]              
	float                                              MaxChestBeamHeightOffset;                         		// 0x0B30 (0x0004) [0x0000000000000000]              
	int                                                CurrentPhase;                                     		// 0x0B34 (0x0004) [0x0000000000000000]              
	float                                              PhaseThresholds[ 0x4 ];                           		// 0x0B38 (0x0010) [0x0000000000000000]              
	int                                                ChestBeamMinPhase;                                		// 0x0B48 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class kfgamecontent.KFAIController_ZedFleshpoundKing" );

		return pClassPointer;
	};

	void ForceTargetChange ( );
	void eventChangeEnemy ( );
	void eventSetEnemy ( );
	void eventFindNewEnemy ( );
	void CanSwitchEnemies ( );
	void NotifySpecialMoveEnded ( );
	void TransitionToPhase ( );
	void NotifyTakeHit ( );
	void CheckForBeamAttack ( );
	void eventTick ( );
	void eventSeePlayer ( );
	void AmIAllowedToSuicideWhenStuck ( );
	void eventPossess ( );
};

UClass* AKFAIController_ZedFleshpoundKing::pClassPointer = NULL;

// Class kfgamecontent.KFDifficulty_FleshpoundKing
// 0x0010 (0x02A4 - 0x0294)
class UKFDifficulty_FleshpoundKing : public UKFMonsterDifficultyInfo
{
public:
	TArray< float >                                    ChestBeamCooldowns;                               		// 0x0294 (0x0010) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class kfgamecontent.KFDifficulty_FleshpoundKing" );

		return pClassPointer;
	};

	void GetChestBeamCooldownTime ( );
};

UClass* UKFDifficulty_FleshpoundKing::pClassPointer = NULL;

// Class kfgamecontent.AICommand_Husk_Suicide
// 0x0000 (0x00F4 - 0x00F4)
class UAICommand_Husk_Suicide : public UAICommand_SpecialMove
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class kfgamecontent.AICommand_Husk_Suicide" );

		return pClassPointer;
	};

	void GetSpecialMove ( );
	void Popped ( );
	void Paused ( );
	void Resumed ( );
	void Pushed ( );
	void Suicide ( );
};

UClass* UAICommand_Husk_Suicide::pClassPointer = NULL;

// Class kfgamecontent.KFAIController_ZedHusk
// 0x007C (0x0B44 - 0x0AC8)
class AKFAIController_ZedHusk : public AKFAIController_Ranged
{
public:
	DWORD                                              bBaseCommandInitialized : 1;                      		// 0x0AC8 (0x0004) [0x0000000000000000] [0x00000001] 
	DWORD                                              bCanUseFlameThrower : 1;                          		// 0x0AC8 (0x0004) [0x0000000000000000] [0x00000002] 
	float                                              MinDistanceToSuicide;                             		// 0x0ACC (0x0004) [0x0000000000000000]              
	float                                              RequiredHealthPercentForSuicide;                  		// 0x0AD0 (0x0004) [0x0000000000000000]              
	struct FVector                                     LastEnemySeenPosition;                            		// 0x0AD4 (0x000C) [0x0000000000000000]              
	float                                              LastFireBallTime;                                 		// 0x0AE0 (0x0004) [0x0000000000000000]              
	float                                              LastFlameThrowerTime;                             		// 0x0AE4 (0x0004) [0x0000000000000000]              
	float                                              BaseTimeBetweenFireBalls;                         		// 0x0AE8 (0x0004) [0x0000000000000000]              
	float                                              TimeBetweenFireBalls;                             		// 0x0AEC (0x0004) [0x0000000000000000]              
	float                                              TimeBetweenFlameThrower;                          		// 0x0AF0 (0x0004) [0x0000000000000000]              
	float                                              FireballRandomizedValue;                          		// 0x0AF4 (0x0004) [0x0000000000000000]              
	int                                                MaxDistanceForFlameThrower;                       		// 0x0AF8 (0x0004) [0x0000000000000000]              
	int                                                MinDistanceForFireBall;                           		// 0x0AFC (0x0004) [0x0000000000000000]              
	int                                                MaxDistanceForFireBall;                           		// 0x0B00 (0x0004) [0x0000000000000000]              
	float                                              LastCheckSpecialMoveTime;                         		// 0x0B04 (0x0004) [0x0000000000000000]              
	float                                              CheckSpecialMoveTime;                             		// 0x0B08 (0x0004) [0x0000000000000000]              
	struct FName                                       FireballSocketName;                               		// 0x0B0C (0x0008) [0x0000000000000000]              
	float                                              FireballAimError;                                 		// 0x0B14 (0x0004) [0x0000000000000000]              
	float                                              FireballLeadTargetAimError;                       		// 0x0B18 (0x0004) [0x0000000000000000]              
	float                                              FireballSpeed;                                    		// 0x0B1C (0x0004) [0x0000000000000000]              
	float                                              SplashAimChanceNormal;                            		// 0x0B20 (0x0004) [0x0000000000000000]              
	float                                              SplashAimChanceHard;                              		// 0x0B24 (0x0004) [0x0000000000000000]              
	float                                              SplashAimChanceSuicidal;                          		// 0x0B28 (0x0004) [0x0000000000000000]              
	float                                              SplashAimChanceHellOnEarth;                       		// 0x0B2C (0x0004) [0x0000000000000000]              
	float                                              FireballFireIntervalNormal;                       		// 0x0B30 (0x0004) [0x0000000000000000]              
	float                                              FireballFireIntervalHard;                         		// 0x0B34 (0x0004) [0x0000000000000000]              
	float                                              FireballFireIntervalSuicidal;                     		// 0x0B38 (0x0004) [0x0000000000000000]              
	float                                              FireballFireIntervalHellOnEarth;                  		// 0x0B3C (0x0004) [0x0000000000000000]              
	float                                              LowIntensityAttackScaleOfFireballInterval;        		// 0x0B40 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class kfgamecontent.KFAIController_ZedHusk" );

		return pClassPointer;
	};

	void ShootFireball ( );
	void DoStrike ( );
	void ShouldSprint ( );
	void eventSetEnemy ( );
	void CanDoFireball ( );
	void CanDoFlamethrower ( );
	void CanDoSuicide ( );
	void IsSuicidal ( );
	void Tick ( );
	void eventPostBeginPlay ( );
};

UClass* AKFAIController_ZedHusk::pClassPointer = NULL;

// Class kfgamecontent.AICommand_HuskFireBallAttack
// 0x0000 (0x010C - 0x010C)
class UAICommand_HuskFireBallAttack : public UAICommand_RangedAttack
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class kfgamecontent.AICommand_HuskFireBallAttack" );

		return pClassPointer;
	};

	void Popped ( );
	void Pushed ( );
	void FireBallAttack ( );
};

UClass* UAICommand_HuskFireBallAttack::pClassPointer = NULL;

// Class kfgamecontent.KFSM_Husk_FireBallAttack
// 0x0000 (0x017C - 0x017C)
class UKFSM_Husk_FireBallAttack : public UKFSM_RangedAttack
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class kfgamecontent.KFSM_Husk_FireBallAttack" );

		return pClassPointer;
	};

	void CanOverrideMoveWith ( );
	void SpecialMoveEnded ( );
	void NotifyFireballFired ( );
};

UClass* UKFSM_Husk_FireBallAttack::pClassPointer = NULL;

// Class kfgamecontent.AICommand_HuskFlameThrowerAttack
// 0x0000 (0x00F4 - 0x00F4)
class UAICommand_HuskFlameThrowerAttack : public UAICommand_SpecialMove
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class kfgamecontent.AICommand_HuskFlameThrowerAttack" );

		return pClassPointer;
	};

	void Popped ( );
	void Pushed ( );
	void FlameThrowerAttack ( );
};

UClass* UAICommand_HuskFlameThrowerAttack::pClassPointer = NULL;

// Class kfgamecontent.AICommand_Patriarch_Grab
// 0x0000 (0x00F4 - 0x00F4)
class UAICommand_Patriarch_Grab : public UAICommand_SpecialMove
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class kfgamecontent.AICommand_Patriarch_Grab" );

		return pClassPointer;
	};

	void Popped ( );
	void Pushed ( );
	void TentacleGrab ( );
};

UClass* UAICommand_Patriarch_Grab::pClassPointer = NULL;

// Class kfgamecontent.KFPawn_ZedPatriarch
// 0x02C8 (0x11D0 - 0x0F08)
class AKFPawn_ZedPatriarch : public AKFPawn_MonsterBoss
{
public:
	class UAkEvent*                                    AmbientBreathingEvent;                            		// 0x0F08 (0x0008) [0x0000000000000000]              
	class UAkEvent*                                    LowHealthAmbientBreathingEvent;                   		// 0x0F10 (0x0008) [0x0000000000000000]              
	class UAkComponent*                                CloakedAkComponent;                               		// 0x0F18 (0x0008) [0x0000000000000000]              
	class UAkEvent*                                    CloakedLoop;                                      		// 0x0F20 (0x0008) [0x0000000000000000]              
	class UAkEvent*                                    CloakedLoopEnd;                                   		// 0x0F28 (0x0008) [0x0000000000000000]              
	class UMaterialInstanceConstant*                   BodyMaterial;                                     		// 0x0F30 (0x0008) [0x0000000000000000]              
	class UMaterialInstanceConstant*                   BodyAltMaterial;                                  		// 0x0F38 (0x0008) [0x0000000000000000]              
	class UMaterialInstanceConstant*                   SpottedMaterial;                                  		// 0x0F40 (0x0008) [0x0000000000000000]              
	class UMaterialInstanceConstant*                   CloakedBodyMaterial;                              		// 0x0F48 (0x0008) [0x0000000000000000]              
	class UMaterialInstanceConstant*                   CloakedBodyAltMaterial;                           		// 0x0F50 (0x0008) [0x0000000000000000]              
	class UKFSkelControl_SpinBone*                     BarrelSpinSkelCtrl;                               		// 0x0F58 (0x0008) [0x0000000000000000]              
	class USkelControlLookAt*                          GunTrackingSkelCtrl;                              		// 0x0F60 (0x0008) [0x0000000000000000]              
	TArray< class UStaticMeshComponent* >              HealingSyringeMeshes;                             		// 0x0F68 (0x0010) [0x0000000000000000]              
	TArray< class UMaterialInstanceConstant* >         HealingSyringeMICs;                               		// 0x0F78 (0x0010) [0x0000000000000000]              
	int                                                CurrentSyringeMeshNum;                            		// 0x0F88 (0x0004) [0x0000000000000000]              
	int                                                ActiveSyringe;                                    		// 0x0F8C (0x0004) [0x0000000000000000]              
	float                                              SyringeInjectTimeDuration;                        		// 0x0F90 (0x0004) [0x0000000000000000]              
	float                                              SyringeInjectTimeRemaining;                       		// 0x0F94 (0x0004) [0x0000000000000000]              
	struct FLinearColor                                MechColors[ 0x4 ];                                		// 0x0F98 (0x0040) [0x0000000000000000]              
	struct FLinearColor                                DeadMechColor;                                    		// 0x0FD8 (0x0010) [0x0000000000000000]              
	struct FLinearColor                                BoilColors[ 0x4 ];                                		// 0x0FE8 (0x0040) [0x0000000000000000]              
	struct FLinearColor                                DeadBoilColor;                                    		// 0x1028 (0x0010) [0x0000000000000000]              
	DWORD                                              bPulseBoils : 1;                                  		// 0x1038 (0x0004) [0x0000000000000000] [0x00000001] 
	DWORD                                              bSprayingFire : 1;                                		// 0x1038 (0x0004) [0x0000000000000000] [0x00000002] 
	DWORD                                              bSpinBarrels : 1;                                 		// 0x1038 (0x0004) [0x0000000000000000] [0x00000004] 
	DWORD                                              bUseServerSideGunTracking : 1;                    		// 0x1038 (0x0004) [0x0000000000000000] [0x00000008] 
	DWORD                                              bGunTracking : 1;                                 		// 0x1038 (0x0004) [0x0000000000000000] [0x00000010] 
	DWORD                                              bInFleeAndHealMode : 1;                           		// 0x1038 (0x0004) [0x00000000006F0000] [0x00000020] ( CPF_Travel | CPF_EditConst | CPF_GlobalConfig | CPF_Component | CPF_NeedCtorLink )
	DWORD                                              bHealedThisPhase : 1;                             		// 0x1038 (0x0004) [0x0000000000000000] [0x00000040] 
	float                                              BoilPulseRate;                                    		// 0x103C (0x0004) [0x0000000000000000]              
	float                                              BoilPulseAccum;                                   		// 0x1040 (0x0004) [0x0000000000000000]              
	float                                              BoilLightBrightness[ 0x4 ];                       		// 0x1044 (0x0010) [0x0000000000000000]              
	struct FName                                       BoilLightSocketName;                              		// 0x1054 (0x0008) [0x0000000000000000]              
	class UPointLightComponent*                        BoilLightComponent;                               		// 0x105C (0x0008) [0x0000000000000000]              
	class UParticleSystem*                             CloakFX;                                          		// 0x1064 (0x0008) [0x0000000000000000]              
	struct FName                                       CloakFXSocketName;                                		// 0x106C (0x0008) [0x0000000000000000]              
	float                                              CloakShimmerAmount;                               		// 0x1074 (0x0004) [0x0000000000000000]              
	float                                              LastCloakShimmerTime;                             		// 0x1078 (0x0004) [0x0000000000000000]              
	struct FName                                       BattleDamageFXSocketName_LeftHip;                 		// 0x107C (0x0008) [0x0000000000000000]              
	struct FName                                       BattleDamageFXSocketName_LeftKnee;                		// 0x1084 (0x0008) [0x0000000000000000]              
	struct FName                                       BattleDamageFXSocketName_LeftFoot;                		// 0x108C (0x0008) [0x0000000000000000]              
	struct FName                                       BattleDamageFXSocketName_LeftArm;                 		// 0x1094 (0x0008) [0x0000000000000000]              
	struct FName                                       BattleDamageFXSocketName_Weapon;                  		// 0x109C (0x0008) [0x0000000000000000]              
	struct FName                                       BattleDamageFXSocketName_LowerSpike;              		// 0x10A4 (0x0008) [0x0000000000000000]              
	struct FName                                       BattleDamageFXSocketName_UpperSpike;              		// 0x10AC (0x0008) [0x0000000000000000]              
	struct FName                                       BattleDamageFXSocketName_BackSpike;               		// 0x10B4 (0x0008) [0x0000000000000000]              
	class UParticleSystemComponent*                    BattleDamagePSC_LeftHip;                          		// 0x10BC (0x0008) [0x0000000000000000]              
	class UParticleSystemComponent*                    BattleDamagePSC_LeftKnee;                         		// 0x10C4 (0x0008) [0x0000000000000000]              
	class UParticleSystemComponent*                    BattleDamagePSC_LeftFoot;                         		// 0x10CC (0x0008) [0x0000000000000000]              
	class UParticleSystemComponent*                    BattleDamagePSC_LeftArm;                          		// 0x10D4 (0x0008) [0x0000000000000000]              
	class UParticleSystemComponent*                    BattleDamagePSC_Weapon;                           		// 0x10DC (0x0008) [0x0000000000000000]              
	class UParticleSystemComponent*                    BattleDamagePSC_LowerSpike;                       		// 0x10E4 (0x0008) [0x0000000000000000]              
	class UParticleSystemComponent*                    BattleDamagePSC_UpperSpike;                       		// 0x10EC (0x0008) [0x0000000000000000]              
	class UParticleSystemComponent*                    BattleDamagePSC_BackSpike;                        		// 0x10F4 (0x0008) [0x0000000000000000]              
	class UParticleSystem*                             BattleDamageFX_Sparks_LowDmg;                     		// 0x10FC (0x0008) [0x0000000000000000]              
	class UParticleSystem*                             BattleDamageFX_Sparks_MidDmg;                     		// 0x1104 (0x0008) [0x0000000000000000]              
	class UParticleSystem*                             BattleDamageFX_Sparks_HighDmg;                    		// 0x110C (0x0008) [0x0000000000000000]              
	class UParticleSystem*                             BattleDamageFX_Tentacle_LowDmg;                   		// 0x1114 (0x0008) [0x0000000000000000]              
	class UParticleSystem*                             BattleDamageFX_Tentacle_MidDmg;                   		// 0x111C (0x0008) [0x0000000000000000]              
	class UParticleSystem*                             BattleDamageFX_Tentacle_HighDmg;                  		// 0x1124 (0x0008) [0x0000000000000000]              
	class UParticleSystem*                             BattleDamageFX_Smoke_HighDmg;                     		// 0x112C (0x0008) [0x0000000000000000]              
	float                                              TickDialogInterval;                               		// 0x1134 (0x0004) [0x0000000000000000]              
	float                                              FootstepCameraShakePitchAmplitude;                		// 0x1138 (0x0004) [0x0000000000000000]              
	float                                              FootstepCameraShakeRollAmplitude;                 		// 0x113C (0x0004) [0x0000000000000000]              
	int                                                LastFXBattlePhase;                                		// 0x1140 (0x0004) [0x0000000000000000]              
	TArray< struct FPatriarchBattlePhaseInfo >         BattlePhases;                                     		// 0x1144 (0x0010) [0x0000000000000000]              
	float                                              SprintCooldownTime;                               		// 0x1154 (0x0004) [0x0000000000000000]              
	float                                              TentacleGrabCooldownTime;                         		// 0x1158 (0x0004) [0x0000000000000000]              
	float                                              MissileAttackCooldownTime;                        		// 0x115C (0x0004) [0x0000000000000000]              
	float                                              MortarAttackCooldownTime;                         		// 0x1160 (0x0004) [0x0000000000000000]              
	float                                              ChargeAttackCooldownTime;                         		// 0x1164 (0x0004) [0x0000000000000000]              
	float                                              MinigunAttackCooldownTime;                        		// 0x1168 (0x0004) [0x0000000000000000]              
	int                                                MaxRageAttacks;                                   		// 0x116C (0x0004) [0x0000000000000000]              
	int                                                TentacleDamage;                                   		// 0x1170 (0x0004) [0x0000000000000000]              
	class UClass*                                      TentacleDamageType;                               		// 0x1174 (0x0008) [0x0000000000000000]              
	class UClass*                                      HeavyBumpDamageType;                              		// 0x117C (0x0008) [0x0000000000000000]              
	float                                              BarrelSpinSpeed;                                  		// 0x1184 (0x0004) [0x0000000000000000]              
	class AActor*                                      GunTarget;                                        		// 0x1188 (0x0008) [0x0000000000700000]              ( CPF_NeedCtorLink )
	class UClass*                                      MissileProjectileClass;                           		// 0x1190 (0x0008) [0x0000000000000000]              
	class UClass*                                      MortarProjectileClass;                            		// 0x1198 (0x0008) [0x0000000000000000]              
	TArray< struct FPatriarch_MortarTarget >           MortarTargets;                                    		// 0x11A0 (0x0010) [0x0000000000000000]              
	float                                              MinMortarRangeSQ;                                 		// 0x11B0 (0x0004) [0x0000000000000000]              
	float                                              MaxMortarRangeSQ;                                 		// 0x11B4 (0x0004) [0x0000000000000000]              
	float                                              FleeSprintSpeedModifier;                          		// 0x11B8 (0x0004) [0x0000000000000000]              
	float                                              CloakPercent;                                     		// 0x11BC (0x0004) [0x0000000000000000]              
	float                                              CloakSpeed;                                       		// 0x11C0 (0x0004) [0x0000000000000000]              
	float                                              DeCloakSpeed;                                     		// 0x11C4 (0x0004) [0x0000000000000000]              
