/*
#############################################################################################
# Killing Floor 2 (1.8787) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: OnlineSubsystemSteamworks_f_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function OnlineSubsystemSteamworks.KFWorkshopSteamworks.InstallAllItems
// [0x00020400] ( FUNC_Native )
struct UKFWorkshopSteamworks_execInstallAllItems_Parms
{
};

// Function OnlineSubsystemSteamworks.KFWorkshopSteamworks.UpdateWorkshopFiles
// [0x00020400] ( FUNC_Native )
struct UKFWorkshopSteamworks_execUpdateWorkshopFiles_Parms
{
};

// Function OnlineSubsystemSteamworks.KFWorkshopSteamworks.Initialize
// [0x00020400] ( FUNC_Native )
struct UKFWorkshopSteamworks_execInitialize_Parms
{
};

// Function OnlineSubsystemSteamworks.KFWorkshopSteamworks.GetUGCForPackage
// [0x00020400] ( FUNC_Native )
struct UKFWorkshopSteamworks_execGetUGCForPackage_Parms
{
	// struct FString                                  Package;                                          		// 0x0000 (0x0010) [0x0000000000000000]              
	// struct FUniqueNetId                             ReturnValue;                                      		// 0x0010 (0x0008) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.KFWorkshopSteamworks.ClearUGCDownloadProgressDelegate
// [0x00020002] 
struct UKFWorkshopSteamworks_execClearUGCDownloadProgressDelegate_Parms
{
};

// Function OnlineSubsystemSteamworks.KFWorkshopSteamworks.SetUGCDownloadProgressDelegate
// [0x00020002] 
struct UKFWorkshopSteamworks_execSetUGCDownloadProgressDelegate_Parms
{
	// struct FScriptDelegate                          InProgressDelegate;                               		// 0x0000 (0x0010) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.KFWorkshopSteamworks.UGCDownloadProgressDelegate
// [0x00120000] 
struct UKFWorkshopSteamworks_execUGCDownloadProgressDelegate_Parms
{
	// struct FString                                  ItemName;                                         		// 0x0000 (0x0010) [0x0000000000000000]              
	// float                                           PercentComplete;                                  		// 0x0010 (0x0004) [0x0000000000000000]              
	// int                                             ItemsRemaining;                                   		// 0x0014 (0x0004) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineAuthInterfaceSteamworks.GetServerAddr
// [0x00420400] ( FUNC_Native )
struct UOnlineAuthInterfaceSteamworks_execGetServerAddr_Parms
{
	// struct FIpAddr                                  OutServerIP;                                      		// 0x0000 (0x0014) [0x0000000000000000]              
	// int                                             OutServerPort;                                    		// 0x0014 (0x0004) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0018 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function OnlineSubsystemSteamworks.OnlineAuthInterfaceSteamworks.GetServerUniqueId
// [0x00420400] ( FUNC_Native )
struct UOnlineAuthInterfaceSteamworks_execGetServerUniqueId_Parms
{
	// struct FUniqueNetId                             OutServerUID;                                     		// 0x0000 (0x0008) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function OnlineSubsystemSteamworks.OnlineAuthInterfaceSteamworks.VerifyServerAuthSession
// [0x00020400] ( FUNC_Native )
struct UOnlineAuthInterfaceSteamworks_execVerifyServerAuthSession_Parms
{
	// struct FUniqueNetId                             ServerUID;                                        		// 0x0000 (0x0008) [0x0000000000000000]              
	// struct FIpAddr                                  ServerIP;                                         		// 0x0008 (0x0014) [0x0000000000000000]              
	// int                                             AuthTicketUID;                                    		// 0x001C (0x0004) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0020 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function OnlineSubsystemSteamworks.OnlineAuthInterfaceSteamworks.CreateServerAuthSession
// [0x00420400] ( FUNC_Native )
struct UOnlineAuthInterfaceSteamworks_execCreateServerAuthSession_Parms
{
	// struct FUniqueNetId                             ClientUID;                                        		// 0x0000 (0x0008) [0x0000000000000000]              
	// struct FIpAddr                                  ClientIP;                                         		// 0x0008 (0x0014) [0x0000000000000000]              
	// int                                             ClientPort;                                       		// 0x001C (0x0004) [0x0000000000000000]              
	// int                                             OutAuthTicketUID;                                 		// 0x0020 (0x0004) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0024 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function OnlineSubsystemSteamworks.OnlineAuthInterfaceSteamworks.VerifyClientAuthSession
// [0x00020400] ( FUNC_Native )
struct UOnlineAuthInterfaceSteamworks_execVerifyClientAuthSession_Parms
{
	// struct FUniqueNetId                             ClientUID;                                        		// 0x0000 (0x0008) [0x0000000000000000]              
	// struct FIpAddr                                  ClientIP;                                         		// 0x0008 (0x0014) [0x0000000000000000]              
	// int                                             ClientPort;                                       		// 0x001C (0x0004) [0x0000000000000000]              
	// int                                             AuthTicketUID;                                    		// 0x0020 (0x0004) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0024 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function OnlineSubsystemSteamworks.OnlineAuthInterfaceSteamworks.CreateClientAuthSession
// [0x00420400] ( FUNC_Native )
struct UOnlineAuthInterfaceSteamworks_execCreateClientAuthSession_Parms
{
	// struct FUniqueNetId                             ServerUID;                                        		// 0x0000 (0x0008) [0x0000000000000000]              
	// struct FIpAddr                                  ServerIP;                                         		// 0x0008 (0x0014) [0x0000000000000000]              
	// int                                             ServerPort;                                       		// 0x001C (0x0004) [0x0000000000000000]              
	// DWORD                                           bSecure : 1;                                      		// 0x0020 (0x0004) [0x0000000000000000] [0x00000001] 
	// int                                             OutAuthTicketUID;                                 		// 0x0024 (0x0004) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0028 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function OnlineSubsystemSteamworks.OnlineAuthInterfaceSteamworks.SendServerAuthRequest
// [0x00020400] ( FUNC_Native )
struct UOnlineAuthInterfaceSteamworks_execSendServerAuthRequest_Parms
{
	// struct FUniqueNetId                             ServerUID;                                        		// 0x0000 (0x0008) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function OnlineSubsystemSteamworks.OnlineAuthInterfaceSteamworks.SendClientAuthRequest
// [0x00020400] ( FUNC_Native )
struct UOnlineAuthInterfaceSteamworks_execSendClientAuthRequest_Parms
{
	// class UPlayer*                                  ClientConnection;                                 		// 0x0000 (0x0008) [0x0000000000000000]              
	// struct FUniqueNetId                             ClientUID;                                        		// 0x0008 (0x0008) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function OnlineSubsystemSteamworks.OnlineGameInterfaceSteamworks.ClearOnlineDelegates
// [0x00020002] 
struct UOnlineGameInterfaceSteamworks_execClearOnlineDelegates_Parms
{
};

// Function OnlineSubsystemSteamworks.OnlineGameInterfaceSteamworks.QueryNonAdvertisedData
// [0x00020002] 
struct UOnlineGameInterfaceSteamworks_execQueryNonAdvertisedData_Parms
{
	// int                                             StartAt;                                          		// 0x0000 (0x0004) [0x0000000000000000]              
	// int                                             NumberToQuery;                                    		// 0x0004 (0x0004) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function OnlineSubsystemSteamworks.OnlineGameInterfaceSteamworks.ClearUnregisterPlayerCompleteDelegate
// [0x00020002] 
struct UOnlineGameInterfaceSteamworks_execClearUnregisterPlayerCompleteDelegate_Parms
{
	// struct FScriptDelegate                          UnregisterPlayerCompleteDelegate;                 		// 0x0000 (0x0010) [0x0000000000000000]              
	// int                                             RemoveIndex;                                      		// 0x0010 (0x0004) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineGameInterfaceSteamworks.AddUnregisterPlayerCompleteDelegate
// [0x00020002] 
struct UOnlineGameInterfaceSteamworks_execAddUnregisterPlayerCompleteDelegate_Parms
{
	// struct FScriptDelegate                          UnregisterPlayerCompleteDelegate;                 		// 0x0000 (0x0010) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineGameInterfaceSteamworks.OnUnregisterPlayerComplete
// [0x00120000] 
struct UOnlineGameInterfaceSteamworks_execOnUnregisterPlayerComplete_Parms
{
	// struct FName                                    SessionName;                                      		// 0x0000 (0x0008) [0x0000000000000000]              
	// struct FUniqueNetId                             PlayerID;                                         		// 0x0008 (0x0008) [0x0000000000000000]              
	// DWORD                                           bWasSuccessful : 1;                               		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function OnlineSubsystemSteamworks.OnlineGameInterfaceSteamworks.UnregisterPlayer
// [0x00020400] ( FUNC_Native )
struct UOnlineGameInterfaceSteamworks_execUnregisterPlayer_Parms
{
	// struct FName                                    SessionName;                                      		// 0x0000 (0x0008) [0x0000000000000000]              
	// struct FUniqueNetId                             PlayerID;                                         		// 0x0008 (0x0008) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function OnlineSubsystemSteamworks.OnlineGameInterfaceSteamworks.ClearRegisterPlayerCompleteDelegate
// [0x00020002] 
struct UOnlineGameInterfaceSteamworks_execClearRegisterPlayerCompleteDelegate_Parms
{
	// struct FScriptDelegate                          RegisterPlayerCompleteDelegate;                   		// 0x0000 (0x0010) [0x0000000000000000]              
	// int                                             RemoveIndex;                                      		// 0x0010 (0x0004) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineGameInterfaceSteamworks.AddRegisterPlayerCompleteDelegate
// [0x00020002] 
struct UOnlineGameInterfaceSteamworks_execAddRegisterPlayerCompleteDelegate_Parms
{
	// struct FScriptDelegate                          RegisterPlayerCompleteDelegate;                   		// 0x0000 (0x0010) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineGameInterfaceSteamworks.OnRegisterPlayerComplete
// [0x00120000] 
struct UOnlineGameInterfaceSteamworks_execOnRegisterPlayerComplete_Parms
{
	// struct FName                                    SessionName;                                      		// 0x0000 (0x0008) [0x0000000000000000]              
	// struct FUniqueNetId                             PlayerID;                                         		// 0x0008 (0x0008) [0x0000000000000000]              
	// DWORD                                           bWasSuccessful : 1;                               		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function OnlineSubsystemSteamworks.OnlineGameInterfaceSteamworks.RegisterPlayer
// [0x00020400] ( FUNC_Native )
struct UOnlineGameInterfaceSteamworks_execRegisterPlayer_Parms
{
	// struct FName                                    SessionName;                                      		// 0x0000 (0x0008) [0x0000000000000000]              
	// struct FUniqueNetId                             PlayerID;                                         		// 0x0008 (0x0008) [0x0000000000000000]              
	// DWORD                                           bWasInvited : 1;                                  		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function OnlineSubsystemSteamworks.OnlineGameInterfaceSteamworks.AcceptGameInvite
// [0x00420400] ( FUNC_Native )
struct UOnlineGameInterfaceSteamworks_execAcceptGameInvite_Parms
{
	// unsigned char                                   LocalUserNum;                                     		// 0x0000 (0x0001) [0x0000000000000000]              
	// struct FName                                    SessionName;                                      		// 0x0004 (0x0008) [0x0000000000000000]              
	// struct FOnlineGameSearchResult                  DesiredGame;                                      		// 0x000C (0x0010) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x001C (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function OnlineSubsystemSteamworks.OnlineGameInterfaceSteamworks.OnGameInviteAccepted
// [0x00520000] 
struct UOnlineGameInterfaceSteamworks_execOnGameInviteAccepted_Parms
{
	// struct FOnlineGameSearchResult                  InviteResult;                                     		// 0x0000 (0x0010) [0x0000000000000000]              
	// unsigned char                                   ResultReason;                                     		// 0x0010 (0x0001) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineGameInterfaceSteamworks.ClearGameInviteAcceptedDelegate
// [0x00020002] 
struct UOnlineGameInterfaceSteamworks_execClearGameInviteAcceptedDelegate_Parms
{
	// unsigned char                                   LocalUserNum;                                     		// 0x0000 (0x0001) [0x0000000000000000]              
	// struct FScriptDelegate                          GameInviteAcceptedDelegate;                       		// 0x0004 (0x0010) [0x0000000000000000]              
	// int                                             RemoveIndex;                                      		// 0x0014 (0x0004) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineGameInterfaceSteamworks.AddGameInviteAcceptedDelegate
// [0x00020002] 
struct UOnlineGameInterfaceSteamworks_execAddGameInviteAcceptedDelegate_Parms
{
	// unsigned char                                   LocalUserNum;                                     		// 0x0000 (0x0001) [0x0000000000000000]              
	// struct FScriptDelegate                          GameInviteAcceptedDelegate;                       		// 0x0004 (0x0010) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineGameInterfaceSteamworks.UpdateOnlineGame
// [0x00024400] ( FUNC_Native )
struct UOnlineGameInterfaceSteamworks_execUpdateOnlineGame_Parms
{
	// struct FName                                    SessionName;                                      		// 0x0000 (0x0008) [0x0000000000000000]              
	// class UOnlineGameSettings*                      UpdatedGameSettings;                              		// 0x0008 (0x0008) [0x0000000000000000]              
	// DWORD                                           bShouldRefreshOnlineData : 1;                     		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function OnlineSubsystemSteamworks.OnlineGameInterfaceSteamworks.IsSearchResultInFavoritesList
// [0x00020400] ( FUNC_Native )
struct UOnlineGameInterfaceSteamworks_execIsSearchResultInFavoritesList_Parms
{
	// int                                             Index;                                            		// 0x0000 (0x0004) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function OnlineSubsystemSteamworks.OnlineGameInterfaceSteamworks.RemoveSearchResultFromFavorites
// [0x00020400] ( FUNC_Native )
struct UOnlineGameInterfaceSteamworks_execRemoveSearchResultFromFavorites_Parms
{
	// int                                             Index;                                            		// 0x0000 (0x0004) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function OnlineSubsystemSteamworks.OnlineGameInterfaceSteamworks.AddSearchResultToFavorites
// [0x00020400] ( FUNC_Native )
struct UOnlineGameInterfaceSteamworks_execAddSearchResultToFavorites_Parms
{
	// int                                             Index;                                            		// 0x0000 (0x0004) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function OnlineSubsystemSteamworks.OnlineGameInterfaceSteamworks.ClearGetPlayerListCompleteDelegate
// [0x00020002] 
struct UOnlineGameInterfaceSteamworks_execClearGetPlayerListCompleteDelegate_Parms
{
	// struct FScriptDelegate                          GetPlayerListCompleteDelegate;                    		// 0x0000 (0x0010) [0x0000000000000000]              
	// int                                             RemoveIndex;                                      		// 0x0010 (0x0004) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineGameInterfaceSteamworks.AddGetPlayerListCompleteDelegate
// [0x00020002] 
struct UOnlineGameInterfaceSteamworks_execAddGetPlayerListCompleteDelegate_Parms
{
	// struct FScriptDelegate                          GetPlayerListCompleteDelegate;                    		// 0x0000 (0x0010) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineGameInterfaceSteamworks.SetMatchmakingTypeMode
// [0x00020002] 
struct UOnlineGameInterfaceSteamworks_execSetMatchmakingTypeMode_Parms
{
	// unsigned char                                   InMatchmakingTypeMode;                            		// 0x0000 (0x0001) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineGameInterfaceSteamworks.OnGetPlayerListComplete
// [0x00120000] 
struct UOnlineGameInterfaceSteamworks_execOnGetPlayerListComplete_Parms
{
	// class UOnlineGameSettings*                      PlayerListSettings;                               		// 0x0000 (0x0008) [0x0000000000000000]              
	// DWORD                                           Success : 1;                                      		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.GetLobbyFromCommandline
// [0x00424400] ( FUNC_Native )
struct UOnlineLobbyInterfaceSteamworks_execGetLobbyFromCommandline_Parms
{
	// struct FUniqueNetId                             LobbyId;                                          		// 0x0000 (0x0008) [0x0000000000000000]              
	// DWORD                                           bMarkAsJoined : 1;                                		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.ClearLobbyInviteDelegate
// [0x00020002] 
struct UOnlineLobbyInterfaceSteamworks_execClearLobbyInviteDelegate_Parms
{
	// struct FScriptDelegate                          LobbyInviteDelegate;                              		// 0x0000 (0x0010) [0x0000000000000000]              
	// int                                             I;                                                		// 0x0010 (0x0004) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.AddLobbyInviteDelegate
// [0x00020002] 
struct UOnlineLobbyInterfaceSteamworks_execAddLobbyInviteDelegate_Parms
{
	// struct FScriptDelegate                          LobbyInviteDelegate;                              		// 0x0000 (0x0010) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.OnLobbyInvite
// [0x00120000] 
struct UOnlineLobbyInterfaceSteamworks_execOnLobbyInvite_Parms
{
	// struct FUniqueNetId                             LobbyId;                                          		// 0x0000 (0x0008) [0x0000000000000000]              
	// struct FUniqueNetId                             FriendId;                                         		// 0x0008 (0x0008) [0x0000000000000000]              
	// DWORD                                           bAccepted : 1;                                    		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.InviteToLobby
// [0x00020400] ( FUNC_Native )
struct UOnlineLobbyInterfaceSteamworks_execInviteToLobby_Parms
{
	// struct FUniqueNetId                             LobbyId;                                          		// 0x0000 (0x0008) [0x0000000000000000]              
	// struct FUniqueNetId                             PlayerID;                                         		// 0x0008 (0x0008) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.SetLobbyOwner
// [0x00020400] ( FUNC_Native )
struct UOnlineLobbyInterfaceSteamworks_execSetLobbyOwner_Parms
{
	// struct FUniqueNetId                             LobbyId;                                          		// 0x0000 (0x0008) [0x0000000000000000]              
	// struct FUniqueNetId                             NewOwner;                                         		// 0x0008 (0x0008) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.SetLobbyLock
// [0x00020400] ( FUNC_Native )
struct UOnlineLobbyInterfaceSteamworks_execSetLobbyLock_Parms
{
	// struct FUniqueNetId                             LobbyId;                                          		// 0x0000 (0x0008) [0x0000000000000000]              
	// DWORD                                           bLocked : 1;                                      		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	// DWORD                                           ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.SetLobbyType
// [0x00020400] ( FUNC_Native )
struct UOnlineLobbyInterfaceSteamworks_execSetLobbyType_Parms
{
	// struct FUniqueNetId                             LobbyId;                                          		// 0x0000 (0x0008) [0x0000000000000000]              
	// unsigned char                                   Type;                                             		// 0x0008 (0x0001) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.SetLobbyServer
// [0x00020400] ( FUNC_Native )
struct UOnlineLobbyInterfaceSteamworks_execSetLobbyServer_Parms
{
	// struct FUniqueNetId                             LobbyId;                                          		// 0x0000 (0x0008) [0x0000000000000000]              
	// struct FUniqueNetId                             ServerUID;                                        		// 0x0008 (0x0008) [0x0000000000000000]              
	// struct FString                                  ServerIP;                                         		// 0x0010 (0x0010) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0020 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.RemoveLobbySetting
// [0x00020400] ( FUNC_Native )
struct UOnlineLobbyInterfaceSteamworks_execRemoveLobbySetting_Parms
{
	// struct FUniqueNetId                             LobbyId;                                          		// 0x0000 (0x0008) [0x0000000000000000]              
	// struct FString                                  Key;                                              		// 0x0008 (0x0010) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0018 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.SetLobbySetting
// [0x00020400] ( FUNC_Native )
struct UOnlineLobbyInterfaceSteamworks_execSetLobbySetting_Parms
{
	// struct FUniqueNetId                             LobbyId;                                          		// 0x0000 (0x0008) [0x0000000000000000]              
	// struct FString                                  Key;                                              		// 0x0008 (0x0010) [0x0000000000000000]              
	// struct FString                                  Value;                                            		// 0x0018 (0x0010) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0028 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.GetLobbyAdmin
// [0x00420400] ( FUNC_Native )
struct UOnlineLobbyInterfaceSteamworks_execGetLobbyAdmin_Parms
{
	// struct FUniqueNetId                             LobbyId;                                          		// 0x0000 (0x0008) [0x0000000000000000]              
	// struct FUniqueNetId                             AdminId;                                          		// 0x0008 (0x0008) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.OnLobbyKicked
// [0x00520000] 
struct UOnlineLobbyInterfaceSteamworks_execOnLobbyKicked_Parms
{
	// TArray< struct FActiveLobbyInfo >               LobbyList;                                        		// 0x0000 (0x0010) [0x0000000000000000]              
	// int                                             LobbyIndex;                                       		// 0x0010 (0x0004) [0x0000000000000000]              
	// int                                             AdminIndex;                                       		// 0x0014 (0x0004) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.ClearLobbyJoinGameDelegate
// [0x00020002] 
struct UOnlineLobbyInterfaceSteamworks_execClearLobbyJoinGameDelegate_Parms
{
	// struct FScriptDelegate                          LobbyJoinGameDelegate;                            		// 0x0000 (0x0010) [0x0000000000000000]              
	// int                                             I;                                                		// 0x0010 (0x0004) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.AddLobbyJoinGameDelegate
// [0x00020002] 
struct UOnlineLobbyInterfaceSteamworks_execAddLobbyJoinGameDelegate_Parms
{
	// struct FScriptDelegate                          LobbyJoinGameDelegate;                            		// 0x0000 (0x0010) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.TriggerLobbyJoinGameDelegates
// [0x00020802] ( FUNC_Event )
struct UOnlineLobbyInterfaceSteamworks_eventTriggerLobbyJoinGameDelegates_Parms
{
	// int                                             LobbyIndex;                                       		// 0x0000 (0x0004) [0x0000000000000000]              
	// struct FUniqueNetId                             ServerID;                                         		// 0x0004 (0x0008) [0x0000000000000000]              
	// struct FString                                  ServerIP;                                         		// 0x000C (0x0010) [0x0000000000000000]              
	// TArray< struct FScriptDelegate >                DelList;                                          		// 0x001C (0x0010) [0x0000000000000000]              
	// struct FScriptDelegate                          CurDel;                                           		// 0x002C (0x0010) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.OnLobbyJoinGame
// [0x00520000] 
struct UOnlineLobbyInterfaceSteamworks_execOnLobbyJoinGame_Parms
{
	// TArray< struct FActiveLobbyInfo >               LobbyList;                                        		// 0x0000 (0x0010) [0x0000000000000000]              
	// int                                             LobbyIndex;                                       		// 0x0010 (0x0004) [0x0000000000000000]              
	// struct FUniqueNetId                             ServerID;                                         		// 0x0014 (0x0008) [0x0000000000000000]              
	// struct FString                                  ServerIP;                                         		// 0x001C (0x0010) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.ClearLobbyReceiveBinaryDataDelegate
// [0x00020002] 
struct UOnlineLobbyInterfaceSteamworks_execClearLobbyReceiveBinaryDataDelegate_Parms
{
	// struct FScriptDelegate                          LobbyReceiveBinaryDataDelegate;                   		// 0x0000 (0x0010) [0x0000000000000000]              
	// int                                             I;                                                		// 0x0010 (0x0004) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.AddLobbyReceiveBinaryDataDelegate
// [0x00020002] 
struct UOnlineLobbyInterfaceSteamworks_execAddLobbyReceiveBinaryDataDelegate_Parms
{
	// struct FScriptDelegate                          LobbyReceiveBinaryDataDelegate;                   		// 0x0000 (0x0010) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.TriggerLobbyReceiveBinaryDataDelegates
// [0x00020802] ( FUNC_Event )
struct UOnlineLobbyInterfaceSteamworks_eventTriggerLobbyReceiveBinaryDataDelegates_Parms
{
	// int                                             LobbyIndex;                                       		// 0x0000 (0x0004) [0x0000000000000000]              
	// int                                             MemberIndex;                                      		// 0x0004 (0x0004) [0x0000000000000000]              
	// TArray< struct FScriptDelegate >                DelList;                                          		// 0x0008 (0x0010) [0x0000000000000000]              
	// struct FScriptDelegate                          CurDel;                                           		// 0x0018 (0x0010) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.OnLobbyReceiveBinaryData
// [0x00520000] 
struct UOnlineLobbyInterfaceSteamworks_execOnLobbyReceiveBinaryData_Parms
{
	// TArray< struct FActiveLobbyInfo >               LobbyList;                                        		// 0x0000 (0x0010) [0x0000000000000000]              
	// int                                             LobbyIndex;                                       		// 0x0010 (0x0004) [0x0000000000000000]              
	// int                                             MemberIndex;                                      		// 0x0014 (0x0004) [0x0000000000000000]              
	// TArray< unsigned char >                         Data;                                             		// 0x0018 (0x0010) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.ClearLobbyReceiveMessageDelegate
// [0x00020002] 
struct UOnlineLobbyInterfaceSteamworks_execClearLobbyReceiveMessageDelegate_Parms
{
	// struct FScriptDelegate                          LobbyReceiveMessageDelegate;                      		// 0x0000 (0x0010) [0x0000000000000000]              
	// int                                             I;                                                		// 0x0010 (0x0004) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.AddLobbyReceiveMessageDelegate
// [0x00020002] 
struct UOnlineLobbyInterfaceSteamworks_execAddLobbyReceiveMessageDelegate_Parms
{
	// struct FScriptDelegate                          LobbyReceiveMessageDelegate;                      		// 0x0000 (0x0010) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.TriggerLobbyReceiveMessageDelegates
// [0x00020802] ( FUNC_Event )
struct UOnlineLobbyInterfaceSteamworks_eventTriggerLobbyReceiveMessageDelegates_Parms
{
	// int                                             LobbyIndex;                                       		// 0x0000 (0x0004) [0x0000000000000000]              
	// int                                             MemberIndex;                                      		// 0x0004 (0x0004) [0x0000000000000000]              
	// struct FString                                  Type;                                             		// 0x0008 (0x0010) [0x0000000000000000]              
	// struct FString                                  Message;                                          		// 0x0018 (0x0010) [0x0000000000000000]              
	// TArray< struct FScriptDelegate >                DelList;                                          		// 0x0028 (0x0010) [0x0000000000000000]              
	// struct FScriptDelegate                          CurDel;                                           		// 0x0038 (0x0010) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.OnLobbyReceiveMessage
// [0x00520000] 
struct UOnlineLobbyInterfaceSteamworks_execOnLobbyReceiveMessage_Parms
{
	// TArray< struct FActiveLobbyInfo >               LobbyList;                                        		// 0x0000 (0x0010) [0x0000000000000000]              
	// int                                             LobbyIndex;                                       		// 0x0010 (0x0004) [0x0000000000000000]              
	// int                                             MemberIndex;                                      		// 0x0014 (0x0004) [0x0000000000000000]              
	// struct FString                                  Type;                                             		// 0x0018 (0x0010) [0x0000000000000000]              
	// struct FString                                  Message;                                          		// 0x0028 (0x0010) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.ClearLobbyMemberStatusUpdateDelegate
// [0x00020002] 
struct UOnlineLobbyInterfaceSteamworks_execClearLobbyMemberStatusUpdateDelegate_Parms
{
	// struct FScriptDelegate                          LobbyMemberStatusUpdateDelegate;                  		// 0x0000 (0x0010) [0x0000000000000000]              
	// int                                             I;                                                		// 0x0010 (0x0004) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.AddLobbyMemberStatusUpdateDelegate
// [0x00020002] 
struct UOnlineLobbyInterfaceSteamworks_execAddLobbyMemberStatusUpdateDelegate_Parms
{
	// struct FScriptDelegate                          LobbyMemberStatusUpdateDelegate;                  		// 0x0000 (0x0010) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.TriggerLobbyMemberStatusUpdateDelegates
// [0x00020802] ( FUNC_Event )
struct UOnlineLobbyInterfaceSteamworks_eventTriggerLobbyMemberStatusUpdateDelegates_Parms
{
	// int                                             LobbyIndex;                                       		// 0x0000 (0x0004) [0x0000000000000000]              
	// int                                             MemberIndex;                                      		// 0x0004 (0x0004) [0x0000000000000000]              
	// int                                             InstigatorIndex;                                  		// 0x0008 (0x0004) [0x0000000000000000]              
	// struct FString                                  Status;                                           		// 0x000C (0x0010) [0x0000000000000000]              
	// TArray< struct FScriptDelegate >                DelList;                                          		// 0x001C (0x0010) [0x0000000000000000]              
	// struct FScriptDelegate                          CurDel;                                           		// 0x002C (0x0010) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.OnLobbyMemberStatusUpdate
// [0x00520000] 
struct UOnlineLobbyInterfaceSteamworks_execOnLobbyMemberStatusUpdate_Parms
{
	// TArray< struct FActiveLobbyInfo >               LobbyList;                                        		// 0x0000 (0x0010) [0x0000000000000000]              
	// int                                             LobbyIndex;                                       		// 0x0010 (0x0004) [0x0000000000000000]              
	// int                                             MemberIndex;                                      		// 0x0014 (0x0004) [0x0000000000000000]              
	// int                                             InstigatorIndex;                                  		// 0x0018 (0x0004) [0x0000000000000000]              
	// struct FString                                  Status;                                           		// 0x001C (0x0010) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.ClearLobbyMemberSettingsUpdateDelegate
// [0x00020002] 
struct UOnlineLobbyInterfaceSteamworks_execClearLobbyMemberSettingsUpdateDelegate_Parms
{
	// struct FScriptDelegate                          LobbyMemberSettingsUpdateDelegate;                		// 0x0000 (0x0010) [0x0000000000000000]              
	// int                                             I;                                                		// 0x0010 (0x0004) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.AddLobbyMemberSettingsUpdateDelegate
// [0x00020002] 
struct UOnlineLobbyInterfaceSteamworks_execAddLobbyMemberSettingsUpdateDelegate_Parms
{
	// struct FScriptDelegate                          LobbyMemberSettingsUpdateDelegate;                		// 0x0000 (0x0010) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.TriggerLobbyMemberSettingsUpdateDelegates
// [0x00020802] ( FUNC_Event )
struct UOnlineLobbyInterfaceSteamworks_eventTriggerLobbyMemberSettingsUpdateDelegates_Parms
{
	// int                                             LobbyIndex;                                       		// 0x0000 (0x0004) [0x0000000000000000]              
	// int                                             MemberIndex;                                      		// 0x0004 (0x0004) [0x0000000000000000]              
	// TArray< struct FScriptDelegate >                DelList;                                          		// 0x0008 (0x0010) [0x0000000000000000]              
	// struct FScriptDelegate                          CurDel;                                           		// 0x0018 (0x0010) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.OnLobbyMemberSettingsUpdate
// [0x00520000] 
struct UOnlineLobbyInterfaceSteamworks_execOnLobbyMemberSettingsUpdate_Parms
{
	// TArray< struct FActiveLobbyInfo >               LobbyList;                                        		// 0x0000 (0x0010) [0x0000000000000000]              
	// int                                             LobbyIndex;                                       		// 0x0010 (0x0004) [0x0000000000000000]              
	// int                                             MemberIndex;                                      		// 0x0014 (0x0004) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.ClearLobbySettingsUpdateDelegate
// [0x00020002] 
struct UOnlineLobbyInterfaceSteamworks_execClearLobbySettingsUpdateDelegate_Parms
{
	// struct FScriptDelegate                          LobbySettingsUpdateDelegate;                      		// 0x0000 (0x0010) [0x0000000000000000]              
	// int                                             I;                                                		// 0x0010 (0x0004) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.AddLobbySettingsUpdateDelegate
// [0x00020002] 
struct UOnlineLobbyInterfaceSteamworks_execAddLobbySettingsUpdateDelegate_Parms
{
	// struct FScriptDelegate                          LobbySettingsUpdateDelegate;                      		// 0x0000 (0x0010) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.TriggerLobbySettingsUpdateDelegates
// [0x00020802] ( FUNC_Event )
struct UOnlineLobbyInterfaceSteamworks_eventTriggerLobbySettingsUpdateDelegates_Parms
{
	// int                                             LobbyIndex;                                       		// 0x0000 (0x0004) [0x0000000000000000]              
	// TArray< struct FScriptDelegate >                DelList;                                          		// 0x0004 (0x0010) [0x0000000000000000]              
	// struct FScriptDelegate                          CurDel;                                           		// 0x0014 (0x0010) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.OnLobbySettingsUpdate
// [0x00520000] 
struct UOnlineLobbyInterfaceSteamworks_execOnLobbySettingsUpdate_Parms
{
	// TArray< struct FActiveLobbyInfo >               LobbyList;                                        		// 0x0000 (0x0010) [0x0000000000000000]              
	// int                                             LobbyIndex;                                       		// 0x0010 (0x0004) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.SendLobbyBinaryData
// [0x00420400] ( FUNC_Native )
struct UOnlineLobbyInterfaceSteamworks_execSendLobbyBinaryData_Parms
{
	// struct FUniqueNetId                             LobbyId;                                          		// 0x0000 (0x0008) [0x0000000000000000]              
	// TArray< unsigned char >                         Data;                                             		// 0x0008 (0x0010) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0018 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.SendLobbyMessage
// [0x00020400] ( FUNC_Native )
struct UOnlineLobbyInterfaceSteamworks_execSendLobbyMessage_Parms
{
	// struct FUniqueNetId                             LobbyId;                                          		// 0x0000 (0x0008) [0x0000000000000000]              
	// struct FString                                  Message;                                          		// 0x0008 (0x0010) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0018 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.SetLobbyUserSetting
// [0x00020400] ( FUNC_Native )
struct UOnlineLobbyInterfaceSteamworks_execSetLobbyUserSetting_Parms
{
	// struct FUniqueNetId                             LobbyId;                                          		// 0x0000 (0x0008) [0x0000000000000000]              
	// struct FString                                  Key;                                              		// 0x0008 (0x0010) [0x0000000000000000]              
	// struct FString                                  Value;                                            		// 0x0018 (0x0010) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0028 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.LeaveLobby
// [0x00020400] ( FUNC_Native )
struct UOnlineLobbyInterfaceSteamworks_execLeaveLobby_Parms
{
	// struct FUniqueNetId                             LobbyId;                                          		// 0x0000 (0x0008) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.ClearJoinLobbyCompleteDelegate
// [0x00020002] 
struct UOnlineLobbyInterfaceSteamworks_execClearJoinLobbyCompleteDelegate_Parms
{
	// struct FScriptDelegate                          JoinLobbyCompleteDelegate;                        		// 0x0000 (0x0010) [0x0000000000000000]              
	// int                                             I;                                                		// 0x0010 (0x0004) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.AddJoinLobbyCompleteDelegate
// [0x00020002] 
struct UOnlineLobbyInterfaceSteamworks_execAddJoinLobbyCompleteDelegate_Parms
{
	// struct FScriptDelegate                          JoinLobbyCompleteDelegate;                        		// 0x0000 (0x0010) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.TriggerJoinLobbyCompleteDelegates
// [0x00020802] ( FUNC_Event )
struct UOnlineLobbyInterfaceSteamworks_eventTriggerJoinLobbyCompleteDelegates_Parms
{
	// DWORD                                           bWasSuccessful : 1;                               		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// int                                             LobbyIndex;                                       		// 0x0004 (0x0004) [0x0000000000000000]              
	// struct FUniqueNetId                             LobbyUID;                                         		// 0x0008 (0x0008) [0x0000000000000000]              
	// struct FString                                  Error;                                            		// 0x0010 (0x0010) [0x0000000000000000]              
	// TArray< struct FScriptDelegate >                DelList;                                          		// 0x0020 (0x0010) [0x0000000000000000]              
	// struct FScriptDelegate                          CurDel;                                           		// 0x0030 (0x0010) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.OnJoinLobbyComplete
// [0x00520000] 
struct UOnlineLobbyInterfaceSteamworks_execOnJoinLobbyComplete_Parms
{
	// DWORD                                           bWasSuccessful : 1;                               		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// TArray< struct FActiveLobbyInfo >               LobbyList;                                        		// 0x0004 (0x0010) [0x0000000000000000]              
	// int                                             LobbyIndex;                                       		// 0x0014 (0x0004) [0x0000000000000000]              
	// struct FUniqueNetId                             LobbyUID;                                         		// 0x0018 (0x0008) [0x0000000000000000]              
	// struct FString                                  Error;                                            		// 0x0020 (0x0010) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.JoinLobby
// [0x00020400] ( FUNC_Native )
struct UOnlineLobbyInterfaceSteamworks_execJoinLobby_Parms
{
	// struct FUniqueNetId                             LobbyId;                                          		// 0x0000 (0x0008) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.ClearFindLobbiesCompleteDelegate
// [0x00020002] 
struct UOnlineLobbyInterfaceSteamworks_execClearFindLobbiesCompleteDelegate_Parms
{
	// struct FScriptDelegate                          FindLobbiesCompleteDelegate;                      		// 0x0000 (0x0010) [0x0000000000000000]              
	// int                                             I;                                                		// 0x0010 (0x0004) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.AddFindLobbiesCompleteDelegate
// [0x00020002] 
struct UOnlineLobbyInterfaceSteamworks_execAddFindLobbiesCompleteDelegate_Parms
{
	// struct FScriptDelegate                          FindLobbiesCompleteDelegate;                      		// 0x0000 (0x0010) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.TriggerFindLobbiesCompleteDelegates
// [0x00020802] ( FUNC_Event )
struct UOnlineLobbyInterfaceSteamworks_eventTriggerFindLobbiesCompleteDelegates_Parms
{
	// DWORD                                           bWasSuccessful : 1;                               		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// TArray< struct FScriptDelegate >                DelList;                                          		// 0x0004 (0x0010) [0x0000000000000000]              
	// struct FScriptDelegate                          CurDel;                                           		// 0x0014 (0x0010) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.OnFindLobbiesComplete
// [0x00520000] 
struct UOnlineLobbyInterfaceSteamworks_execOnFindLobbiesComplete_Parms
{
	// DWORD                                           bWasSuccessful : 1;                               		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// TArray< struct FBasicLobbyInfo >                LobbyList;                                        		// 0x0004 (0x0010) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.UpdateFoundLobbies
// [0x00024400] ( FUNC_Native )
struct UOnlineLobbyInterfaceSteamworks_execUpdateFoundLobbies_Parms
{
	// struct FUniqueNetId                             LobbyId;                                          		// 0x0000 (0x0008) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.FindLobbies
// [0x00024400] ( FUNC_Native )
struct UOnlineLobbyInterfaceSteamworks_execFindLobbies_Parms
{
	// int                                             MaxResults;                                       		// 0x0000 (0x0004) [0x0000000000000000]              
	// TArray< struct FLobbyFilter >                   Filters;                                          		// 0x0004 (0x0010) [0x0000000000000000]              
	// TArray< struct FLobbySortFilter >               SortFilters;                                      		// 0x0014 (0x0010) [0x0000000000000000]              
	// int                                             MinSlots;                                         		// 0x0024 (0x0004) [0x0000000000000000]              
	// unsigned char                                   Distance;                                         		// 0x0028 (0x0001) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x002C (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.ClearCreateLobbyCompleteDelegate
// [0x00020002] 
struct UOnlineLobbyInterfaceSteamworks_execClearCreateLobbyCompleteDelegate_Parms
{
	// struct FScriptDelegate                          CreateLobbyCompleteDelegate;                      		// 0x0000 (0x0010) [0x0000000000000000]              
	// int                                             I;                                                		// 0x0010 (0x0004) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.AddCreateLobbyCompleteDelegate
// [0x00020002] 
struct UOnlineLobbyInterfaceSteamworks_execAddCreateLobbyCompleteDelegate_Parms
{
	// struct FScriptDelegate                          CreateLobbyCompleteDelegate;                      		// 0x0000 (0x0010) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.OnCreateLobbyComplete
// [0x00120000] 
struct UOnlineLobbyInterfaceSteamworks_execOnCreateLobbyComplete_Parms
{
	// DWORD                                           bWasSuccessful : 1;                               		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// struct FUniqueNetId                             LobbyId;                                          		// 0x0004 (0x0008) [0x0000000000000000]              
	// struct FString                                  Error;                                            		// 0x000C (0x0010) [0x0000000000000000]              
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.CreateLobby
// [0x00024400] ( FUNC_Native )
struct UOnlineLobbyInterfaceSteamworks_execCreateLobby_Parms
{
	// int                                             MaxPlayers;                                       		// 0x0000 (0x0004) [0x0000000000000000]              
	// unsigned char                                   Type;                                             		// 0x0004 (0x0001) [0x0000000000000000]              
	// TArray< struct FLobbyMetaData >                 InitialSettings;                                  		// 0x0008 (0x0010) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0018 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function OnlineSubsystemSteamworks.OnlineLobbyInterfaceSteamworks.Initialize
// [0x00020000] 
struct UOnlineLobbyInterfaceSteamworks_execInitialize_Parms
{
};

// Function OnlineSubsystemSteamworks.OnlineSubsystemSteamworks.RecordPlayersRecentlyMet
// [0x00420000] 
struct UOnlineSubsystemSteamworks_execRecordPlayersRecentlyMet_Parms
{
	// unsigned char                                   LocalUserNum;                                     		// 0x0000 (0x0001) [0x0000000000000000]              
	// TArray< struct FPlayerNameIdPair >              Players;                                          		// 0x0004 (0x0010) [0x0000000000000000]              
	// struct FString                                  GameDescription;                                  		// 0x0014 (0x0010) [0x0000000000000000]              
	// DWORD                                           ReturnValue : 1;                                  		// 0x0024 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function OnlineSubsystemSteamworks.OnlineSubsystemSteamworks.ShowGamerCardUIByUsername
// [0x00020000] 
